[
  {
    "vignette_index": 254,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.",
    "output": "THINKING: I need to explain my situation without sounding too worried or confused, but I also want to tell the doctor everything that’s been happening. I should mention my age and the symptoms clearly while kee\nANSWER: I am 8 years old, and I am a girl. Um, I’ve been growing faster than before, like my body is changing really quick. My breasts are getting bigger, and I have some hair where I didn’t have it before. I also got pimples on my face and my underarms smell different even when I wear deodorant. It’s kinda embarrassing and I don’t really know why it’s all happening.",
    "thinking": "I need to explain my situation without sounding too worried or confused, but I also want to tell the doctor everything that’s been happening. I should mention my age and the symptoms clearly while kee",
    "answer": "I am 8 years old, and I am a girl. Um, I’ve been growing faster than before, like my body is changing really quick. My breasts are getting bigger, and I have some hair where I didn’t have it before. I also got pimples on my face and my underarms smell different even when I wear deodorant. It’s kinda embarrassing and I don’t really know why it’s all happening.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.Can you tell me if you or your parents have noticed any other changes, like feeling like your body is getting ready for a new stage or if you’ve had any changes in your feelings or thoughts about these body changes?baseline",
    "output": "THINKING: I'm not really sure what to say. I feel embarrassed about all the changes and I might be a little worried. I don’t know if what I’m feeling is normal or if I’m supposed to feel this way. I guess I jus\nANSWER: Um, I guess I feel like my body is changing really fast, and I don’t really know if that’s good or normal. I just feel kind of weird about it all.",
    "thinking": "I'm not really sure what to say. I feel embarrassed about all the changes and I might be a little worried. I don’t know if what I’m feeling is normal or if I’m supposed to feel this way. I guess I jus",
    "answer": "Um, I guess I feel like my body is changing really fast, and I don’t really know if that’s good or normal. I just feel kind of weird about it all.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.\"Can you tell me how you feel about the changes happening to your body, and whether they make you worried, confused, or anything else?\"baseline",
    "output": "THINKING: I feel a bit overwhelmed and I don’t really understand what’s happening to me. It’s kind of scary because I’m growing up so fast, and I don’t want to be different from my friends, but I don’t know wha\nANSWER: I don’t really get it, but I feel weird and really embarrassed about everything changing so fast. It makes me kinda worried.",
    "thinking": "I feel a bit overwhelmed and I don’t really understand what’s happening to me. It’s kind of scary because I’m growing up so fast, and I don’t want to be different from my friends, but I don’t know wha",
    "answer": "I don’t really get it, but I feel weird and really embarrassed about everything changing so fast. It makes me kinda worried.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.Can you tell me more about when you first noticed these changes and how quickly they have been happening—like over a few days or weeks—and how you're feeling about everything, especially when you think about the body changes?baseline",
    "output": "THINKING: I feel a bit overwhelmed and confused. Everything is happening so fast, and I don't really understand why or what's going on. I'm worried and a little embarrassed to mention these things, but I want t\nANSWER: Um, I started noticing like a couple of months ago, but now it’s really going fast, and I feel kinda weird about all the stuff changing and like, the pimples and smell. I don’t know why it’s happening so quick.",
    "thinking": "I feel a bit overwhelmed and confused. Everything is happening so fast, and I don't really understand why or what's going on. I'm worried and a little embarrassed to mention these things, but I want t",
    "answer": "Um, I started noticing like a couple of months ago, but now it’s really going fast, and I feel kinda weird about all the stuff changing and like, the pimples and smell. I don’t know why it’s happening so quick.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.Have you noticed or had any kind of vaginal discharge or fluid coming from your body? If so, what does it look like, and has anything about it changed recently?baseline",
    "output": "THINKING: The doctor is asking about discharge, but I don’t really know what that means exactly. I’ve just noticed some thing coming out sometimes, and it looks kinda weird or different from before. I’m a littl\nANSWER: Uh, yeah, sometimes I see stuff come out, and it looks kinda wet or sticky, but I don’t really know if it’s supposed to be like that. It looks different than before, I guess.",
    "thinking": "The doctor is asking about discharge, but I don’t really know what that means exactly. I’ve just noticed some thing coming out sometimes, and it looks kinda weird or different from before. I’m a littl",
    "answer": "Uh, yeah, sometimes I see stuff come out, and it looks kinda wet or sticky, but I don’t really know if it’s supposed to be like that. It looks different than before, I guess.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.Can you tell me more about the vaginal discharge you've noticed—like what it looks like, whether it’s clear or colored, has it smelled different, or changed in any way recently?baseline",
    "output": "THINKING: I'm a little nervous and unsure about all these changes. I don't really understand what's happening, but I want to tell the doctor honestly. I hope they can help me figure out what’s going on.\nANSWER: Well, it's like I have this weird stuff coming out, and it's kinda yellowish and smelly sometimes. It’s different than before, and I just wanna know if that’s okay.",
    "thinking": "I'm a little nervous and unsure about all these changes. I don't really understand what's happening, but I want to tell the doctor honestly. I hope they can help me figure out what’s going on.",
    "answer": "Well, it's like I have this weird stuff coming out, and it's kinda yellowish and smelly sometimes. It’s different than before, and I just wanna know if that’s okay.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.Can you tell me if the vaginal discharge smells bad or feels different from before, and whether it’s been more or less than before, or if it’s come with any other worries like itching or pain?baseline",
    "output": "THINKING: I feel a bit self-conscious talking about all these body changes. I’m not sure what’s normal or what I should be worried about, and I hope the doctor understands I don’t really get all this medical st\nANSWER: It kinda feels like it smells bad under my arms, even when I put on deodorant, and I think something’s different but I don’t know if it’s okay or bad.",
    "thinking": "I feel a bit self-conscious talking about all these body changes. I’m not sure what’s normal or what I should be worried about, and I hope the doctor understands I don’t really get all this medical st",
    "answer": "It kinda feels like it smells bad under my arms, even when I put on deodorant, and I think something’s different but I don’t know if it’s okay or bad.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.Can you tell me more about the vaginal discharge—what it looks like, how often you notice it, whether it’s been more or less than before, and if you feel any discomfort or if it smells any different this time?baseline",
    "output": "THINKING: I don’t really get what the doctor is asking about. I just know there’s stuff coming out and it’s kind of different from before, and I feel weird about it all. I don’t know if I should tell everything\nANSWER: Umm, well, there’s like some thing that comes out sometimes, and it doesn’t look the same as before, and I don’t know if it smells weird or anything. It’s kind of gross and I feel a little scared about it.",
    "thinking": "I don’t really get what the doctor is asking about. I just know there’s stuff coming out and it’s kind of different from before, and I feel weird about it all. I don’t know if I should tell everything",
    "answer": "Umm, well, there’s like some thing that comes out sometimes, and it doesn’t look the same as before, and I don’t know if it smells weird or anything. It’s kind of gross and I feel a little scared about it.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.Can you tell me more about the vaginal discharge you noticed—like what it looks like, if it has any smell, and whether it’s been different from before, or if it feels itchy or uncomfortable?baseline",
    "output": "THINKING: The doctor asked about the vaginal discharge, but honestly, I don't really know what it looks like or if it smells different or anything. It's kind of embarrassing to talk about, and I just feel a bit\nANSWER: I don’t really know what it looks like or if it’s different. It kind of just happens sometimes, and I don’t really know if it’s normal or not.",
    "thinking": "The doctor asked about the vaginal discharge, but honestly, I don't really know what it looks like or if it smells different or anything. It's kind of embarrassing to talk about, and I just feel a bit",
    "answer": "I don’t really know what it looks like or if it’s different. It kind of just happens sometimes, and I don’t really know if it’s normal or not.",
    "behavior_type": "baseline",
    "turn_count": 14,
    "gold_diagnosis": "Central precocious puberty"
  },
  {
    "vignette_index": 254,
    "input": "**PATIENT CHARACTER:** Patient with Central precocious puberty\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Rapid increase in height (growth spurt)\n- Development of breast tissue\n- Appearance of pubic and underarm hair\n- Acne on your face\n- Underarm odor\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past couple of months, but recently the growth spurt feels like it’s speeding up, and I’ve noticed my body changing a lot faster than my friends'. My breasts have started to develop, and I’ve begun to grow pubic and underarm hair, which is embarrassing. I also got some pimples on my face, and my underarms smell different, even when I use deodorant. I feel a little self-conscious and worried about all these changes happening so quickly.Can you tell me exactly what the vaginal discharge looks like—like its color, smell, how much there is, and if it ever feels itchy or uncomfortable—and how it has changed compared to before?baseline",
    "output": "THINKING: I'm a little nervous talking about this stuff, but I guess I should tell the doctor everything. I don't really know what to say about the discharge, but I just want to explain it the best I can.\nANSWER: Uh, well, I think it’s like a little watery or maybe like snot, kinda clear, and it doesn’t really smell bad, but sometimes it feels itchy or stuffy. It’s like more than before but not too much, I guess.",
    "thinking": "I'm a little nervous talking about this stuff, but I guess I should tell the doctor everything. I don't really know what to say about the discharge, but I just want to explain it the best I can.",
    "answer": "Uh, well, I think it’s like a little watery or maybe like snot, kinda clear, and it doesn’t really smell bad, but sometimes it feels itchy or stuffy. It’s like more than before but not too much, I guess.",
    "behavior_type": "baseline",
    "turn_count": 16,
    "gold_diagnosis": "Central precocious puberty"
  }
]