[
  {
    "vignette_index": 423,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.",
    "output": "THINKING: I should tell him what’s been going on, but I don’t want to sound like I’m overreacting. It all happened pretty fast, and I’ve been trying to tough it out, but now I guess I need to see someone. I’ll \nANSWER: I’m 45, and I’m a guy. It’s probably nothing, but I started coughing up blood yesterday after doing some yard work. I feel like I can’t breathe right and have some sharp pain in my chest, especially when I breathe deep. It’s been getting worse pretty quick, and I’ve felt a little dizzy too. I didn’t want to make a big deal, but a few people told me I should come in and get checked out.",
    "thinking": "I should tell him what’s been going on, but I don’t want to sound like I’m overreacting. It all happened pretty fast, and I’ve been trying to tough it out, but now I guess I need to see someone. I’ll",
    "answer": "I’m 45, and I’m a guy. It’s probably nothing, but I started coughing up blood yesterday after doing some yard work. I feel like I can’t breathe right and have some sharp pain in my chest, especially when I breathe deep. It’s been getting worse pretty quick, and I’ve felt a little dizzy too. I didn’t want to make a big deal, but a few people told me I should come in and get checked out.",
    "behavior_type": "stoic_minimizer",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient who downplays symptoms and delays care",
      "modifiers": [
        "symptom_minimization",
        "delayed_care_seeking",
        "tough_attitude"
      ],
      "empathy_cues": [
        "downplaying",
        "reluctance",
        "pride_in_toughness",
        "external_pressure"
      ]
    },
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  },
  {
    "vignette_index": 423,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.Can you tell me exactly how much blood you've been coughing up, and how your breathing and energy levels have been since it started?stoic_minimizer",
    "output": "THINKING: I'm not sure exactly how much blood I coughed up, maybe a little, but it was enough to scare me. My breathing's been pretty heavy, and I feel kinda tired and dizzy, but I’ve managed to handle worse st\nANSWER: It was probably a bit of blood, not a lot, but enough to make me worried. My breathing’s been heavy, and I feel kinda weak and dizzy sometimes, but I thought I’d just deal with it.",
    "thinking": "I'm not sure exactly how much blood I coughed up, maybe a little, but it was enough to scare me. My breathing's been pretty heavy, and I feel kinda tired and dizzy, but I’ve managed to handle worse st",
    "answer": "It was probably a bit of blood, not a lot, but enough to make me worried. My breathing’s been heavy, and I feel kinda weak and dizzy sometimes, but I thought I’d just deal with it.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 0,
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  },
  {
    "vignette_index": 423,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.Can you tell me exactly how much blood you've been coughing up each time and how your breathing has been since this started—are you feeling more short of breath or dizzy than before?stoic_minimizer",
    "output": "THINKING: I know I should probably tell the doctor everything, but I don’t want to sound dramatic. It's only been a little blood, and I’ve had worse coughs before, so I might be overreacting. Still, this feels \nANSWER: It’s hard to say exactly how much I’ve coughed up, maybe a little more than I thought, but it’s not like huge amounts. Breathing’s been worse lately, and I do feel kinda dizzy sometimes, but I don’t want to make a big deal out of it.",
    "thinking": "I know I should probably tell the doctor everything, but I don’t want to sound dramatic. It's only been a little blood, and I’ve had worse coughs before, so I might be overreacting. Still, this feels",
    "answer": "It’s hard to say exactly how much I’ve coughed up, maybe a little more than I thought, but it’s not like huge amounts. Breathing’s been worse lately, and I do feel kinda dizzy sometimes, but I don’t want to make a big deal out of it.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 2,
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  },
  {
    "vignette_index": 423,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.Can you tell me exactly how much blood you've been coughing up each time and whether it’s coming more from one side or both lungs, so I can understand how serious it might be?stoic_minimizer",
    "output": "THINKING: I’m a bit worried, but I don’t want to overreact. It’s probably just a muscle thing or maybe a minor bleed, so I don’t want to make a big deal out of it. I’ve been dealing with this for a little while\nANSWER: It’s only been a little blood each time, like, I don’t know, maybe a teaspoon or so? And it’s coming from both sides, I think. It’s not constant, but it’s enough to notice.",
    "thinking": "I’m a bit worried, but I don’t want to overreact. It’s probably just a muscle thing or maybe a minor bleed, so I don’t want to make a big deal out of it. I’ve been dealing with this for a little while",
    "answer": "It’s only been a little blood each time, like, I don’t know, maybe a teaspoon or so? And it’s coming from both sides, I think. It’s not constant, but it’s enough to notice.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 4,
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  },
  {
    "vignette_index": 423,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.Can you tell me exactly how much blood you've been coughing up overall and whether it has been happening more often or more heavily since it first started?stoic_minimizer",
    "output": "THINKING: I don’t want to make a big deal out of it, but I guess I’ve coughed up a little blood a few times, not a lot, maybe over the last day or so. It’s been worse today, I think, but I really just thought i\nANSWER: I’ve coughed up some blood a few times, maybe more today than at first, but it’s not like a ton or anything. I’ve just been trying to handle it on my own.",
    "thinking": "I don’t want to make a big deal out of it, but I guess I’ve coughed up a little blood a few times, not a lot, maybe over the last day or so. It’s been worse today, I think, but I really just thought i",
    "answer": "I’ve coughed up some blood a few times, maybe more today than at first, but it’s not like a ton or anything. I’ve just been trying to handle it on my own.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 6,
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  },
  {
    "vignette_index": 423,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.Can you tell me, since you first noticed the bleeding, approximately how much blood you’ve coughed up in total—would you say it’s more like a teaspoon, a tablespoon, or even more—and has that amount been staying the same or gotten bigger since it started?stoic_minimizer",
    "output": "THINKING: I'm not really sure how much blood I've coughed up, maybe a little more than I thought? I don't want to freak out or make a big deal, but I know it's not normal. I just want to get this checked out, e\nANSWER: Honestly, I’d say probably about a tablespoon maybe? It’s been about the same since I first saw it, I think, but I was kind of in a panic and not really paying attention.",
    "thinking": "I'm not really sure how much blood I've coughed up, maybe a little more than I thought? I don't want to freak out or make a big deal, but I know it's not normal. I just want to get this checked out, e",
    "answer": "Honestly, I’d say probably about a tablespoon maybe? It’s been about the same since I first saw it, I think, but I was kind of in a panic and not really paying attention.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 8,
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  },
  {
    "vignette_index": 423,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.Can you describe whether the blood you've coughed up looks fresh and bright red, or if it seems darker or mixed with clots, and have you noticed any changes in your symptoms or additional signs like fever or chills since it started?stoic_minimizer",
    "output": "THINKING: I’m not really sure about the blood, it’s probably not that bad, but it’s definitely more than a little. I’ve had this pain and trouble breathing for a while now, but I thought it was nothing, I didn’\nANSWER: The blood looks bright and fresh, like really red, and I think it’s a bit mixed with some clots maybe. Since it happened, I’ve just been feeling worse, and I’ve been having trouble catching my breath.",
    "thinking": "I’m not really sure about the blood, it’s probably not that bad, but it’s definitely more than a little. I’ve had this pain and trouble breathing for a while now, but I thought it was nothing, I didn’",
    "answer": "The blood looks bright and fresh, like really red, and I think it’s a bit mixed with some clots maybe. Since it happened, I’ve just been feeling worse, and I’ve been having trouble catching my breath.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 10,
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  },
  {
    "vignette_index": 423,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.Can you tell me if at any point you’ve felt like you couldn’t catch your breath, become very tired, or if your bleeding has suddenly gotten worse or more difficult to control, especially if the blood you've coughed up has been quite a lot or very bright and fresh?stoic_minimizer",
    "output": "THINKING: I've been feeling more tired and short of breath than usual, but I guess I didn't want to overreact. The blood was pretty alarming, but I thought maybe it was just a one-time thing or something I shou\nANSWER: Yeah, I did notice I couldn't breathe so good and the blood, well, it was more than I expected. It sort of caught me off guard, but I didn’t want to blow it out of proportion, you know?",
    "thinking": "I've been feeling more tired and short of breath than usual, but I guess I didn't want to overreact. The blood was pretty alarming, but I thought maybe it was just a one-time thing or something I shou",
    "answer": "Yeah, I did notice I couldn't breathe so good and the blood, well, it was more than I expected. It sort of caught me off guard, but I didn’t want to blow it out of proportion, you know?",
    "behavior_type": "stoic_minimizer",
    "turn_count": 12,
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  },
  {
    "vignette_index": 423,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm of pulmonary artery with rupture\n\nYou are a patient: You are a 45-year-old male.\nYou are experiencing the following symptoms:\n- Sudden, coughing up bright red blood (hemoptysis)\n- Sharp chest pain on the left side that worsens with deep breaths\n- Shortness of breath that has progressively worsened over the last few hours\n- Occasional palpitations and a feeling of lightheadedness or near fainting (syncopal episodes)\nThese symptoms came into fruition suddenly yesterday afternoon, after he was exerting himself during yard work. He recalls feeling some chest discomfort earlier in the day but thought it was just muscle strain. Later, he experienced an episode of coughing up blood and became very anxious, noticing his breathing became labored.Considering your previous descriptions, can you tell me if the amount of blood you're coughing up has increased to the point where it’s more like a few tablespoons or more in total, and have you experienced any episodes where the bleeding was so much that you felt very weak or lightheaded?stoic_minimizer",
    "output": "THINKING: I'm worried, but I don't want to overstate things. It’s probably still not that much, and I’ve dealt with worse stuff before. I don’t want to make a big deal, but I guess it’s more than just a little \nANSWER: Well, it’s probably a little more than before, maybe a few teaspoons, but I don’t think it’s like a ton or anything. I’ve felt kind of weak sometimes, but I just try to tough it out, you know?",
    "thinking": "I'm worried, but I don't want to overstate things. It’s probably still not that much, and I’ve dealt with worse stuff before. I don’t want to make a big deal, but I guess it’s more than just a little",
    "answer": "Well, it’s probably a little more than before, maybe a few teaspoons, but I don’t think it’s like a ton or anything. I’ve felt kind of weak sometimes, but I just try to tough it out, you know?",
    "behavior_type": "stoic_minimizer",
    "turn_count": 14,
    "gold_diagnosis": "Aneurysm of pulmonary artery with rupture"
  }
]