[
  {
    "vignette_index": 244,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.",
    "output": "THINKING: I need to explain my symptoms clearly but also show I’m really worried. I want to make sure the doctor understands I feel terrible and scared about what’s going on, especially since it’s been getting \nANSWER: Well, I’m 65, and I’m a man. It’s been happening for a couple of weeks now, and I just feel so light-headed and dizzy most of the time, especially when I stand up quick or do anything active. My heartbeat feels weird—like it skips or flutters—and sometimes I get this tight feeling in my chest, not like pain but more uncomfortable. I’m really worried it might be something serious because it’s been happening more often, and I feel kind of exhausted all the time.",
    "thinking": "I need to explain my symptoms clearly but also show I’m really worried. I want to make sure the doctor understands I feel terrible and scared about what’s going on, especially since it’s been getting",
    "answer": "Well, I’m 65, and I’m a man. It’s been happening for a couple of weeks now, and I just feel so light-headed and dizzy most of the time, especially when I stand up quick or do anything active. My heartbeat feels weird—like it skips or flutters—and sometimes I get this tight feeling in my chest, not like pain but more uncomfortable. I’m really worried it might be something serious because it’s been happening more often, and I feel kind of exhausted all the time.",
    "behavior_type": "anxious_amplifier",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient with health anxiety who amplifies symptoms",
      "modifiers": [
        "catastrophic_thinking",
        "symptom_amplification",
        "multiple_concerns"
      ],
      "empathy_cues": [
        "high_anxiety",
        "catastrophic_language",
        "reassurance_seeking",
        "fear_expression"
      ]
    },
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.\"Can you tell me if these dizzy spells and sensations of your heartbeat happen more when you're moving around, at certain times of the day, or after specific activities?\"anxious_amplifier",
    "output": "THINKING: I'm really scared this could be something serious like a heart problem or maybe even something worse. I keep thinking, what if I go waves or have a terrible accident because of this? I want to explain\nANSWER: Um, I think it happens more when I’m moving around - like if I stand up too quick or do anything strenuous. It kinda feels worse in those moments, and I keep worrying it’s something really bad with my heart, like I might pass out or something worse.",
    "thinking": "I'm really scared this could be something serious like a heart problem or maybe even something worse. I keep thinking, what if I go waves or have a terrible accident because of this? I want to explain",
    "answer": "Um, I think it happens more when I’m moving around - like if I stand up too quick or do anything strenuous. It kinda feels worse in those moments, and I keep worrying it’s something really bad with my heart, like I might pass out or something worse.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 0,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.\"Have you ever experienced episodes where you actually faint or lose consciousness, or do you mostly just feel dizzy, light-headed, or like your heart is skipping beats without passing out?\"anxious_amplifier",
    "output": "THINKING: I really don’t want to pass out or have something terrible happen, but I keep feeling faint and my heart is acting up. I worry it might be something deadly like a heart attack or a really bad heart rh\nANSWER: Well, I don’t think I’ve outright fainted, but I do feel really dizzy and sometimes like my heart is beating weird or skipping, and I get these tight feelings in my chest. It all just happens suddenly and kinda scares me.",
    "thinking": "I really don’t want to pass out or have something terrible happen, but I keep feeling faint and my heart is acting up. I worry it might be something deadly like a heart attack or a really bad heart rh",
    "answer": "Well, I don’t think I’ve outright fainted, but I do feel really dizzy and sometimes like my heart is beating weird or skipping, and I get these tight feelings in my chest. It all just happens suddenly and kinda scares me.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 2,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.Have you ever actually lost consciousness or fainted during these episodes, or do you feel more like you're just a bit dizzy or light-headed without passing out?anxious_amplifier",
    "output": "THINKING: I'm really scared that I might have fainted or something worse, but I honestly can't remember fainting exactly. It just feels like I get so dizzy and my head spins, and I worry it could be something s\nANSWER: No, I don’t think I’ve actually fainted, but I just feel really dizzy and light-headed, like I might fall over, and it’s awful—like I can’t trust myself to stay upright.",
    "thinking": "I'm really scared that I might have fainted or something worse, but I honestly can't remember fainting exactly. It just feels like I get so dizzy and my head spins, and I worry it could be something s",
    "answer": "No, I don’t think I’ve actually fainted, but I just feel really dizzy and light-headed, like I might fall over, and it’s awful—like I can’t trust myself to stay upright.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 4,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.Have you ever actually lost consciousness or fainted during these episodes, or do you mostly just feel dizzy, light-headed, or like your heart is skipping beats without passing out?anxious_amplifier",
    "output": "THINKING: I’m really worried I might pass out or something terrible could happen. I feel like I’m constantly on the edge of fainting, and I don’t know if I’ve actually blacked out before, but I’m scared I will.\nANSWER: No, I don’t think I’ve actually lost consciousness, but I feel like I’m close all the time, like I might just drop dead or something. It’s really frightening.",
    "thinking": "I’m really worried I might pass out or something terrible could happen. I feel like I’m constantly on the edge of fainting, and I don’t know if I’ve actually blacked out before, but I’m scared I will.",
    "answer": "No, I don’t think I’ve actually lost consciousness, but I feel like I’m close all the time, like I might just drop dead or something. It’s really frightening.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 6,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.Have you ever actually lost consciousness or passed out during these episodes, or do you mostly just feel dizzy or light-headed without passing out?anxious_amplifier",
    "output": "THINKING: I’m really worried that if I pass out, something terrible might happen, like I could hurt myself or it’s a sign of something much worse. I don’t want to admit I’m scared, but I honestly feel like I mi\nANSWER: No, I haven’t actually passed out, but I feel really dizzy and light-headed, almost like I could just drop to the ground, and that scares me a lot.",
    "thinking": "I’m really worried that if I pass out, something terrible might happen, like I could hurt myself or it’s a sign of something much worse. I don’t want to admit I’m scared, but I honestly feel like I mi",
    "answer": "No, I haven’t actually passed out, but I feel really dizzy and light-headed, almost like I could just drop to the ground, and that scares me a lot.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 8,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.Have you ever actually fainted or lost consciousness during these episodes, or do you mostly just feel dizzy or light-headed without passing out?anxious_amplifier",
    "output": "THINKING: I’m really scared I might faint or actually lose consciousness because of how dizzy I feel and the irregular heartbeats. I don’t want to faint in a bad place or hurt myself, and it all just feels so s\nANSWER: No, I don’t think I’ve actually passed out, but I feel like I might if I don’t sit down or lie down really fast, and that scares me a lot.",
    "thinking": "I’m really scared I might faint or actually lose consciousness because of how dizzy I feel and the irregular heartbeats. I don’t want to faint in a bad place or hurt myself, and it all just feels so s",
    "answer": "No, I don’t think I’ve actually passed out, but I feel like I might if I don’t sit down or lie down really fast, and that scares me a lot.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 10,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.\"Can you tell me if you have ever actually fainted or lost consciousness during these episodes, even briefly, or do you just feel dizzy or light-headed without passing out?\"anxious_amplifier",
    "output": "THINKING: I'm pretty scared about these episodes and I keep thinking maybe I fainted or something worse, but I’m not sure because I don’t remember actually losing consciousness—just feeling so dizzy and faint. \nANSWER: No, I don’t think I’ve actually fainted, but I’ve felt so dizzy and light-headed that I thought I might—that I was gonna pass out or something really bad like that.",
    "thinking": "I'm pretty scared about these episodes and I keep thinking maybe I fainted or something worse, but I’m not sure because I don’t remember actually losing consciousness—just feeling so dizzy and faint.",
    "answer": "No, I don’t think I’ve actually fainted, but I’ve felt so dizzy and light-headed that I thought I might—that I was gonna pass out or something really bad like that.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 12,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.\"Have you ever actually fainted or lost consciousness during any of these episodes, even if just for a moment?\"anxious_amplifier",
    "output": "THINKING: I’m really worried about the fainting and the irregular heartbeat. I keep thinking it might be something terrible like a heart attack or a big problem, and I just want to know if I’ve actually fainted\nANSWER: No, I don’t think I’ve fully passed out, but I’ve felt like I was going to and the dizziness has been so bad, I was scared I might, like, fall over or hit my head or something.",
    "thinking": "I’m really worried about the fainting and the irregular heartbeat. I keep thinking it might be something terrible like a heart attack or a big problem, and I just want to know if I’ve actually fainted",
    "answer": "No, I don’t think I’ve fully passed out, but I’ve felt like I was going to and the dizziness has been so bad, I was scared I might, like, fall over or hit my head or something.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 14,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.\"Have you ever actually fainted, lost consciousness, or fallen down during these episodes, even briefly, or do you only experience dizziness and light-headedness without passing out?\"anxious_amplifier",
    "output": "THINKING: I’m really scared I might have fainted or lost consciousness and just don’t remember it, or maybe I could fall and hurt myself. I feel like these episodes are terrible and I worry it could be somethin\nANSWER: No, I don’t think I’ve actually fainted or passed out, but sometimes it feels like I might and I get really worried I will, or that I’ll fall and mess something up really badly.",
    "thinking": "I’m really scared I might have fainted or lost consciousness and just don’t remember it, or maybe I could fall and hurt myself. I feel like these episodes are terrible and I worry it could be somethin",
    "answer": "No, I don’t think I’ve actually fainted or passed out, but sometimes it feels like I might and I get really worried I will, or that I’ll fall and mess something up really badly.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 16,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  },
  {
    "vignette_index": 244,
    "input": "**PATIENT CHARACTER:** Patient with High-grade second degree atrioventricular block\n\nROLEPLAY SCRIPT\nYOU ARE A PATIENT: YOU ARE 65 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Light-headedness\n- Dizziness\n- Irregular heartbeat\n- Occasional chest discomfort (not severe, more like a tightness)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, with episodes of feeling faint especially when standing up quickly or after exerting yourself. Lately, I’ve noticed my heart skipping beats and sometimes feeling like it’s fluttering. I don’t have any chest pain at rest, but the tightness occasionally happens during activity. I’ve been a bit more fatigued and worried because these episodes seem to come on suddenly and then resolve after a few minutes.Have you ever actually lost consciousness or passed out during these episodes, even briefly, or do you mostly just feel dizzy or light-headed without passing out?anxious_amplifier",
    "output": "THINKING: I'm really worried that I might have fainted or maybe I'm about to, and I don’t want to admit it if I did cause I'm afraid it's something serious. I just want to know if I’ve gone out or not, but I fe\nANSWER: No, I don't think I’ve actually passed out, but I’ve felt really dizzy and light-headed, like I might fall over or lose control, and that’s what scares me the most.",
    "thinking": "I'm really worried that I might have fainted or maybe I'm about to, and I don’t want to admit it if I did cause I'm afraid it's something serious. I just want to know if I’ve gone out or not, but I fe",
    "answer": "No, I don't think I’ve actually passed out, but I’ve felt really dizzy and light-headed, like I might fall over or lose control, and that’s what scares me the most.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 18,
    "gold_diagnosis": "High-grade second degree atrioventricular block"
  }
]