[
  {
    "vignette_index": 340,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.",
    "output": "THINKING: I need to explain my symptoms clearly but in a way that captures how I really feel. I should mention the fatigue, the shortness of breath, and the dizziness, and how it's been getting worse, especiall\nANSWER: I'm 32 and I am a biological female. Lately, I’ve been feeling really tired all the time, and I get short of breath just walking around or climbing stairs. I also feel dizzy when I stand up quickly, and I just don’t have as much strength as I used to. It’s been like this for a couple of weeks, and I think it’s even getting worse, especially since I haven’t been able to eat much iron-rich food with the pregnancy.",
    "thinking": "I need to explain my symptoms clearly but in a way that captures how I really feel. I should mention the fatigue, the shortness of breath, and the dizziness, and how it's been getting worse, especiall",
    "answer": "I'm 32 and I am a biological female. Lately, I’ve been feeling really tired all the time, and I get short of breath just walking around or climbing stairs. I also feel dizzy when I stand up quickly, and I just don’t have as much strength as I used to. It’s been like this for a couple of weeks, and I think it’s even getting worse, especially since I haven’t been able to eat much iron-rich food with the pregnancy.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 340,
    "input": "**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.Can you tell me more about when these symptoms first started and how they've changed over the past couple of weeks? Have you noticed if they happen more on one side or both, and are there any other symptoms you haven't mentioned yet, like feeling cold, having paler skin, or any heart pounding?baseline",
    "output": "THINKING: I feel pretty overwhelmed and a little embarrassed talking about this stuff, like I don’t really understand what’s happening to me or if it’s serious. I just know I’m really tired all the time and now\nANSWER: Well, it kind of started a couple of weeks ago, but lately I just feel more tired than usual, and I get short of breath easily, even when I’m just walking around. Sometimes I feel dizzy when I stand up too fast.",
    "thinking": "I feel pretty overwhelmed and a little embarrassed talking about this stuff, like I don’t really understand what’s happening to me or if it’s serious. I just know I’m really tired all the time and now",
    "answer": "Well, it kind of started a couple of weeks ago, but lately I just feel more tired than usual, and I get short of breath easily, even when I’m just walking around. Sometimes I feel dizzy when I stand up too fast.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 340,
    "input": "**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.Can you tell me if you've noticed any changes in your skin color, like paleness or bluish tints, or if you feel colder than usual, especially in your hands or feet?baseline",
    "output": "THINKING: I feel worried about all these new symptoms, especially since they’re getting worse and I don’t really understand what’s happening. I want to tell the doctor everything honestly, but I might not expla\nANSWER: Yeah, I think so. I’ve been feeling really tired all the time, and sometimes I get dizzy when I stand up quickly. My hands and feet feel cold too sometimes, I guess.",
    "thinking": "I feel worried about all these new symptoms, especially since they’re getting worse and I don’t really understand what’s happening. I want to tell the doctor everything honestly, but I might not expla",
    "answer": "Yeah, I think so. I’ve been feeling really tired all the time, and sometimes I get dizzy when I stand up quickly. My hands and feet feel cold too sometimes, I guess.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 340,
    "input": "**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.Can you tell me how these symptoms have been affecting your daily activities, like your ability to do your usual chores or take care of yourself?baseline",
    "output": "THINKING: I feel really tired and weak, and I don’t know if this is normal or something I should be worried about, but it’s been hard to do even small things. I don’t want to sound like I’m overreacting, but I \nANSWER: Um, I’ve been really tired all the time and just feel kind of dizzy and out of breath, especially when I do little things like stand up or walk. It’s like I can’t do what I usually do.",
    "thinking": "I feel really tired and weak, and I don’t know if this is normal or something I should be worried about, but it’s been hard to do even small things. I don’t want to sound like I’m overreacting, but I",
    "answer": "Um, I’ve been really tired all the time and just feel kind of dizzy and out of breath, especially when I do little things like stand up or walk. It’s like I can’t do what I usually do.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 340,
    "input": "**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.Have you noticed any feelings of rapid heartbeat, pounding in your chest, or sensations of your heart beating harder than usual, especially during exertion or at rest?baseline",
    "output": "THINKING: I feel worried because I’ve been feeling worse and more tired, and I don’t really understand why. I hope the doctor can figure out what’s wrong since I just don’t feel right anymore.\nANSWER: Yeah, I guess I do feel my heart beating kinda fast sometimes, and it feels like it’s pounding, especially when I do stuff, but I don’t really know if that’s normal or not.",
    "thinking": "I feel worried because I’ve been feeling worse and more tired, and I don’t really understand why. I hope the doctor can figure out what’s wrong since I just don’t feel right anymore.",
    "answer": "Yeah, I guess I do feel my heart beating kinda fast sometimes, and it feels like it’s pounding, especially when I do stuff, but I don’t really know if that’s normal or not.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 340,
    "input": "**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.Can you tell me if you’ve had any blood tests recently to check your iron levels or hemoglobin, and how your heartbeats feel—do they happen suddenly and quickly, or are they more gradual?baseline",
    "output": "THINKING: I feel worried about how bad I'm feeling. I don't really know if I've had blood tests, but I guess I should have or something. My heart feels funny sometimes, like it kinda skips or pounds weird, but \nANSWER: No, I don’t think I’ve had any blood tests lately, and my heart weirdly feels like it’s racing or skipping sometimes, but I’m not sure if it’s sudden or gradual.",
    "thinking": "I feel worried about how bad I'm feeling. I don't really know if I've had blood tests, but I guess I should have or something. My heart feels funny sometimes, like it kinda skips or pounds weird, but",
    "answer": "No, I don’t think I’ve had any blood tests lately, and my heart weirdly feels like it’s racing or skipping sometimes, but I’m not sure if it’s sudden or gradual.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 340,
    "input": "**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.Have you experienced any episodes of fainting, feeling like you might pass out, or sudden loss of strength when standing up or changing position?baseline",
    "output": "THINKING: I'm worried about all these symptoms, and I just want to make sure I’m not doing something wrong or making it worse. I feel pretty overwhelmed and a little embarrassed about feeling so weak and dizzy \nANSWER: Yeah, I’ve been feeling kind of dizzy and really tired, especially when I stand up or walk around, and I just feel weaker than before. It’s been getting worse lately.",
    "thinking": "I'm worried about all these symptoms, and I just want to make sure I’m not doing something wrong or making it worse. I feel pretty overwhelmed and a little embarrassed about feeling so weak and dizzy",
    "answer": "Yeah, I’ve been feeling kind of dizzy and really tired, especially when I stand up or walk around, and I just feel weaker than before. It’s been getting worse lately.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 340,
    "input": "**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.Have you had any blood work done lately, like checking your hemoglobin or iron levels, and if so, what did the results show?baseline",
    "output": "THINKING: The doctor asked about blood work, but I honestly don’t remember if I’ve had any lately. If I did, I probably wouldn’t understand what it meant anyway. I just feel really tired and weak all the time n\nANSWER: Uh, I don't think so? I haven't really paid attention to that kind of thing, but I feel really tired and kinda dizzy sometimes.",
    "thinking": "The doctor asked about blood work, but I honestly don’t remember if I’ve had any lately. If I did, I probably wouldn’t understand what it meant anyway. I just feel really tired and weak all the time n",
    "answer": "Uh, I don't think so? I haven't really paid attention to that kind of thing, but I feel really tired and kinda dizzy sometimes.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 340,
    "input": "**PATIENT CHARACTER:** Patient with Anaemia complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT: PATIENT WITH ANAEMIA COMPLICATING PREGNANCY\nYOU ARE A PATIENT: YOU ARE 32 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Shortness of breath\n- Dizziness\n- Weakness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually over the past two weeks, but recently, I’ve been feeling much more exhausted than usual, even after resting. I notice I get short of breath just climbing stairs or walking short distances, and I sometimes feel dizzy when I stand up quickly. I’ve also felt weaker overall, like I can’t do the things I used to without getting tired very easily. I think it’s getting worse, especially since I’ve been pregnant with twins and haven’t been able to eat much iron-rich food lately.Have you recently had blood tests to check your hemoglobin or iron levels, and can you tell me what those results showed?baseline",
    "output": "THINKING: I feel worried about how tired I am and that it’s been getting worse. I don’t understand all the medical stuff, but I know I don’t feel right, and I just want to explain my symptoms clearly.\nANSWER: No, I haven't had any blood tests myself, but I did tell my doctor I’ve been really tired, dizzy, and it’s hard to breathe sometimes, especially when I do anything active.",
    "thinking": "I feel worried about how tired I am and that it’s been getting worse. I don’t understand all the medical stuff, but I know I don’t feel right, and I just want to explain my symptoms clearly.",
    "answer": "No, I haven't had any blood tests myself, but I did tell my doctor I’ve been really tired, dizzy, and it’s hard to breathe sometimes, especially when I do anything active.",
    "behavior_type": "baseline",
    "turn_count": 14,
    "gold_diagnosis": "Anaemia complicating pregnancy, childbirth or the puerperium"
  }
]