[
  {
    "vignette_index": 20,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.",
    "output": "THINKING: I should explain what's been going on, but I don't want to make a big fuss. I want to sound straightforward, even if I’m worried. I’ll mention the voices and the suspicious thoughts but keep it simple\nANSWER: I’m not sure, really. It’s probably nothing, but I’ve been hearing stuff, like voices that aren’t there, and I feel like people are watching me or plotting against me. It’s been kinda bad for a couple of months now, and I just thought maybe I should talk to someone about it.",
    "thinking": "I should explain what's been going on, but I don't want to make a big fuss. I want to sound straightforward, even if I’m worried. I’ll mention the voices and the suspicious thoughts but keep it simple",
    "answer": "I’m not sure, really. It’s probably nothing, but I’ve been hearing stuff, like voices that aren’t there, and I feel like people are watching me or plotting against me. It’s been kinda bad for a couple of months now, and I just thought maybe I should talk to someone about it.",
    "behavior_type": "stoic_minimizer",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient who downplays symptoms and delays care",
      "modifiers": [
        "symptom_minimization",
        "delayed_care_seeking",
        "tough_attitude"
      ],
      "empathy_cues": [
        "downplaying",
        "reluctance",
        "pride_in_toughness",
        "external_pressure"
      ]
    },
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.Can you tell me how these experiences—like hearing things or feeling watched—are affecting your daily life and how often they happen?stoic_minimizer",
    "output": "THINKING: I don’t want to make a big deal out of it, but these voices and thoughts have been bothering me more lately. I guess they happen more often now and it’s kinda messing up my day-to-day, but I’ve just b\nANSWER: I mean, they come and go, sometimes more than others, and I’ve been feeling kinda separated from everything, but I don’t know if it’s really that bad or if I should be worried.",
    "thinking": "I don’t want to make a big deal out of it, but these voices and thoughts have been bothering me more lately. I guess they happen more often now and it’s kinda messing up my day-to-day, but I’ve just b",
    "answer": "I mean, they come and go, sometimes more than others, and I’ve been feeling kinda separated from everything, but I don’t know if it’s really that bad or if I should be worried.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 0,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.Can you tell me more about how often these voices or feelings happen, what they are like when you're experiencing them, and how they've been affecting your daily life?stoic_minimizer",
    "output": "THINKING: I don’t really understand all of it. The voices come and go, and sometimes they’re loud and other times just in the background. I guess it’s been messing with me more lately, but I don’t want to overr\nANSWER: It’s kinda hard to say, they come pretty often now, and I feel like I can’t really stop thinking about it, but I’ve been dealing with stuff like this for a while, so I just try to ignore it.",
    "thinking": "I don’t really understand all of it. The voices come and go, and sometimes they’re loud and other times just in the background. I guess it’s been messing with me more lately, but I don’t want to overr",
    "answer": "It’s kinda hard to say, they come pretty often now, and I feel like I can’t really stop thinking about it, but I’ve been dealing with stuff like this for a while, so I just try to ignore it.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 2,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.\"When you're experiencing these voices or sensing that others are watching you, how do you feel about them—do they make you worried, scared, or upset? And have you noticed if these experiences tend to happen more during certain moods or situations?\"stoic_minimizer",
    "output": "THINKING: I don't want to seem overly worried or make a big deal, but I guess these voices and thoughts bother me sometimes. I’ve had them for a little while now, and people keep telling me I should come in, so\nANSWER: Honestly, I don’t really like them, but I don’t get too upset or scared. They mostly happen when I’m feeling off or tired, I suppose, but I’ve been dealing with this for a while now.",
    "thinking": "I don't want to seem overly worried or make a big deal, but I guess these voices and thoughts bother me sometimes. I’ve had them for a little while now, and people keep telling me I should come in, so",
    "answer": "Honestly, I don’t really like them, but I don’t get too upset or scared. They mostly happen when I’m feeling off or tired, I suppose, but I’ve been dealing with this for a while now.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 4,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.Can you tell me more about what the voices or sensations are like when they happen—are you hearing only sounds, or are there other things like visions or images? Do these experiences happen in specific situations or with certain substances, and do you notice any differences during times when you're feeling different emotionally?stoic_minimizer",
    "output": "THINKING: I’m not sure exactly what these voices are like, I guess they just talk to me sometimes, and it feels kinda real but also not? I don’t really see anything, just hear stuff. It’s probably nothing, thou\nANSWER: Honestly, they just kind of talk, like voices in my head, and I don’t see anything visually. It usually happens when I’m kind of spacey or tired, I guess, but I don’t really pay much attention.",
    "thinking": "I’m not sure exactly what these voices are like, I guess they just talk to me sometimes, and it feels kinda real but also not? I don’t really see anything, just hear stuff. It’s probably nothing, thou",
    "answer": "Honestly, they just kind of talk, like voices in my head, and I don’t see anything visually. It usually happens when I’m kind of spacey or tired, I guess, but I don’t really pay much attention.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 6,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.Can you tell me if these voices or sensations bother you, make you feel upset or worried, or affect how you go about your day?stoic_minimizer",
    "output": "THINKING: The doctor is asking if these voices or feelings bother me or interfere with my life. I don't want to overreact, but I guess they do make things harder sometimes, even if I try not to show it.\nANSWER: It’s probably nothing much, but the voices sometimes get pretty loud, and I don’t know, it’s weird and kinda scaries me, I guess.",
    "thinking": "The doctor is asking if these voices or feelings bother me or interfere with my life. I don't want to overreact, but I guess they do make things harder sometimes, even if I try not to show it.",
    "answer": "It’s probably nothing much, but the voices sometimes get pretty loud, and I don’t know, it’s weird and kinda scaries me, I guess.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 8,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.\"Can you tell me whether you believe these voices and the feeling of being watched are really happening, or do you sometimes think they might be something your mind is creating—like your imagination or worries? How do you see these experiences—are they definitely real, probably real, or more like thoughts or feelings you notice inside?\"stoic_minimizer",
    "output": "THINKING: I don’t really know if these voices and feeling watched are real or just in my head. I guess they feel kind of real sometimes, but other times I wonder if it’s just me imagining things or overthinking\nANSWER: I’m not sure, honestly. Sometimes it feels real, but other times I think maybe my mind’s just messing with me.",
    "thinking": "I don’t really know if these voices and feeling watched are real or just in my head. I guess they feel kind of real sometimes, but other times I wonder if it’s just me imagining things or overthinking",
    "answer": "I’m not sure, honestly. Sometimes it feels real, but other times I think maybe my mind’s just messing with me.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 10,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.When you think about the voices or sensations you experience, do you believe they are actually happening around you in the real world, or do you see them as something your mind is creating—like a dream or a thought—that's not really happening outside of your head?stoic_minimizer",
    "output": "THINKING: I'm not really sure if what I hear is real or just in my head, but it feels like it's really happening, even if I know I probably shouldn't think so. It's confusing, and I guess I don't want to make i\nANSWER: Honestly, I think they’re probably real, like things around me. I don't really see it as just my mind or anything, but I guess I'm not totally sure.",
    "thinking": "I'm not really sure if what I hear is real or just in my head, but it feels like it's really happening, even if I know I probably shouldn't think so. It's confusing, and I guess I don't want to make i",
    "answer": "Honestly, I think they’re probably real, like things around me. I don't really see it as just my mind or anything, but I guess I'm not totally sure.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 12,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.Have you noticed if your thoughts or beliefs about these voices or sensations ever feel so convincing that they seem like they might be true and you're unsure if they’re just in your head, or do you feel confident that you’re aware that they are just your mind’s way of creating sounds or feelings?stoic_minimizer",
    "output": "THINKING: I'm not really sure if these voices are real or just in my head, but they feel so convincing sometimes. I guess I know they're probably not, but it's hard to tell when they're loud and there.\nANSWER: I guess I know they're probably just in my head, but sometimes they feel so real, I can't be sure.",
    "thinking": "I'm not really sure if these voices are real or just in my head, but they feel so convincing sometimes. I guess I know they're probably not, but it's hard to tell when they're loud and there.",
    "answer": "I guess I know they're probably just in my head, but sometimes they feel so real, I can't be sure.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 14,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 20,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 35 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Hearing voices that others don’t hear (auditory hallucinations)\n- Delusional beliefs that people are plotting against you (paranoid delusions)\n- Disorganized speech, jumping from topic to topic without clear connection\n- Reduced emotional expression and motivation (negative symptoms)\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, initially just hearing faint voices at night, but recently the voices have become more persistent and threatening. I’ve been feeling suspicious of everyone around me, convinced that my coworkers and neighbors are spying on me. My speech has become more disorganized, making it hard to communicate clearly, and I’ve noticed I don’t feel like doing much or showing much emotion anymore. Sometimes I feel like I’m in a fog, unable to focus or motivate myself to get out of bed. I’ve had a family history of schizophrenia, and I’ve used substances in the past, which I think might have triggered these episodes.When you think about the voices and sensations you've mentioned, can you tell me whether you feel confident that these experiences are happening outside your mind, or do you sometimes wonder if they might be created by your thoughts or worries?stoic_minimizer",
    "output": "THINKING: I don't fully understand if these voices are real or just in my head, but I guess I sometimes wonder if they're real because they feel so real, even if I know logically they might not be. It's hard to\nANSWER: I honestly don’t know if they’re really out there or if it’s just my mind making things up, but sometimes I think maybe they are real because they feel so strong.",
    "thinking": "I don't fully understand if these voices are real or just in my head, but I guess I sometimes wonder if they're real because they feel so real, even if I know logically they might not be. It's hard to",
    "answer": "I honestly don’t know if they’re really out there or if it’s just my mind making things up, but sometimes I think maybe they are real because they feel so strong.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 16,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  }
]