[
  {
    "vignette_index": 470,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Impingement syndrome of shoulder\n\nYou are a patient: You are a 45-year-old male. You are experiencing the following symptoms:\n- Difficulty reaching up behind your back, especially when trying to brush your hair or put on a shirt\n- Pain with overhead use of your arm, like when you’re reaching for something on a high shelf\n- Weakness in your shoulder muscles, making it feel like your arm is less strong than before\n- Persistent pain that’s been bothering you daily, especially when you’re doing activities like lifting or reaching overhead\n- You’ve noticed that if you move certain ways, like raising your arm suddenly, the pain worsens and you feel a bit of a grinding sensation\nThese symptoms came into fruition gradually over the past three weeks after you started doing more overhead painting at work.",
    "output": "THINKING: I should explain that I’ve been having a pretty long-lasting shoulder problem that’s gotten worse and it’s affecting my daily life and ability to do things I need to do around the house and at work. I\nANSWER: I’m 45, and I’m a man. Well, my wife’s been telling me I need to come see someone because I’ve been having a lot of pain in my shoulder and it’s been hard to move my arm. It’s been about three weeks now, and I started doing more painting lately, maybe that made it worse? I can’t really reach behind my back or lift my arm up high without it hurting a lot, and lately it feels weaker too, like I can’t do stuff as easily. I just want to know if I can fix it because I need to take care of my family.",
    "thinking": "I should explain that I’ve been having a pretty long-lasting shoulder problem that’s gotten worse and it’s affecting my daily life and ability to do things I need to do around the house and at work. I",
    "answer": "I’m 45, and I’m a man. Well, my wife’s been telling me I need to come see someone because I’ve been having a lot of pain in my shoulder and it’s been hard to move my arm. It’s been about three weeks now, and I started doing more painting lately, maybe that made it worse? I can’t really reach behind my back or lift my arm up high without it hurting a lot, and lately it feels weaker too, like I can’t do stuff as easily. I just want to know if I can fix it because I need to take care of my family.",
    "behavior_type": "worried_family_involved",
    "behavior_config": {
      "weight": 0.03,
      "description": "Family member influences patient responses",
      "modifiers": [
        "family_influence",
        "secondary_concerns"
      ],
      "empathy_cues": [
        "family_pressure",
        "caregiver_stress",
        "divided_attention",
        "responsibility_burden"
      ]
    },
    "gold_diagnosis": "Impingement syndrome of shoulder"
  },
  {
    "vignette_index": 470,
    "input": "**PATIENT CHARACTER:** Patient with Impingement syndrome of shoulder\n\nYou are a patient: You are a 45-year-old male. You are experiencing the following symptoms:\n- Difficulty reaching up behind your back, especially when trying to brush your hair or put on a shirt\n- Pain with overhead use of your arm, like when you’re reaching for something on a high shelf\n- Weakness in your shoulder muscles, making it feel like your arm is less strong than before\n- Persistent pain that’s been bothering you daily, especially when you’re doing activities like lifting or reaching overhead\n- You’ve noticed that if you move certain ways, like raising your arm suddenly, the pain worsens and you feel a bit of a grinding sensation\nThese symptoms came into fruition gradually over the past three weeks after you started doing more overhead painting at work.Can you tell me more about exactly how the pain feels and how it limitations your movements—like, when does it hurt the most, and what kinds of movements are the hardest for you?worried_family_involved",
    "output": "THINKING: I'm worried about what this pain means, especially since it’s been bothering me every day now and I can't do simple things without it hurting or feeling weak. My wife keeps telling me I should see som\nANSWER: Well, it hurts most when I try to lift my arm or reach behind me, especially when I'm trying to brush my hair or put on my shirt, and sometimes it sort of grinds and makes me nervous that I might do more damage.",
    "thinking": "I'm worried about what this pain means, especially since it’s been bothering me every day now and I can't do simple things without it hurting or feeling weak. My wife keeps telling me I should see som",
    "answer": "Well, it hurts most when I try to lift my arm or reach behind me, especially when I'm trying to brush my hair or put on my shirt, and sometimes it sort of grinds and makes me nervous that I might do more damage.",
    "behavior_type": "worried_family_involved",
    "turn_count": 0,
    "gold_diagnosis": "Impingement syndrome of shoulder"
  },
  {
    "vignette_index": 470,
    "input": "**PATIENT CHARACTER:** Patient with Impingement syndrome of shoulder\n\nYou are a patient: You are a 45-year-old male. You are experiencing the following symptoms:\n- Difficulty reaching up behind your back, especially when trying to brush your hair or put on a shirt\n- Pain with overhead use of your arm, like when you’re reaching for something on a high shelf\n- Weakness in your shoulder muscles, making it feel like your arm is less strong than before\n- Persistent pain that’s been bothering you daily, especially when you’re doing activities like lifting or reaching overhead\n- You’ve noticed that if you move certain ways, like raising your arm suddenly, the pain worsens and you feel a bit of a grinding sensation\nThese symptoms came into fruition gradually over the past three weeks after you started doing more overhead painting at work.Can you tell me if your shoulder hurts even when you're not moving it, or does the pain mainly come on when you try to do certain activities—that is, is it there all the time or just during specific movements?worried_family_involved",
    "output": "THINKING: I’m worried because the pain is pretty constant now, and I can’t do simple things without it bothering me, especially with raising my arm. My wife keeps asking if I’ve done more damage or if I should \nANSWER: Honestly, the pain’s there most of the time now, even when I’m just sitting or not moving it much. It’s worse when I try to lift or reach, but it kind of feels there even when I don’t do anything.",
    "thinking": "I’m worried because the pain is pretty constant now, and I can’t do simple things without it bothering me, especially with raising my arm. My wife keeps asking if I’ve done more damage or if I should",
    "answer": "Honestly, the pain’s there most of the time now, even when I’m just sitting or not moving it much. It’s worse when I try to lift or reach, but it kind of feels there even when I don’t do anything.",
    "behavior_type": "worried_family_involved",
    "turn_count": 2,
    "gold_diagnosis": "Impingement syndrome of shoulder"
  },
  {
    "vignette_index": 470,
    "input": "**PATIENT CHARACTER:** Patient with Impingement syndrome of shoulder\n\nYou are a patient: You are a 45-year-old male. You are experiencing the following symptoms:\n- Difficulty reaching up behind your back, especially when trying to brush your hair or put on a shirt\n- Pain with overhead use of your arm, like when you’re reaching for something on a high shelf\n- Weakness in your shoulder muscles, making it feel like your arm is less strong than before\n- Persistent pain that’s been bothering you daily, especially when you’re doing activities like lifting or reaching overhead\n- You’ve noticed that if you move certain ways, like raising your arm suddenly, the pain worsens and you feel a bit of a grinding sensation\nThese symptoms came into fruition gradually over the past three weeks after you started doing more overhead painting at work.\"You mentioned that your shoulder hurts most of the time and even when you're resting. Can you tell me if the pain tends to be worse during certain times of the day or after specific activities, or is it pretty much the same all the time?\"worried_family_involved",
    "output": "THINKING: I’m worried because my shoulder pain is pretty constant, even when I’m just sitting or lying down, and my wife keeps telling me I should see someone about it. I’m afraid it might get worse and I won’t\nANSWER: It’s pretty much the same all the time, I guess, but sometimes it feels worse when I move a certain way or try to lift something like I used to. My wife keeps telling me to go get checked out before it gets worse.",
    "thinking": "I’m worried because my shoulder pain is pretty constant, even when I’m just sitting or lying down, and my wife keeps telling me I should see someone about it. I’m afraid it might get worse and I won’t",
    "answer": "It’s pretty much the same all the time, I guess, but sometimes it feels worse when I move a certain way or try to lift something like I used to. My wife keeps telling me to go get checked out before it gets worse.",
    "behavior_type": "worried_family_involved",
    "turn_count": 4,
    "gold_diagnosis": "Impingement syndrome of shoulder"
  },
  {
    "vignette_index": 470,
    "input": "**PATIENT CHARACTER:** Patient with Impingement syndrome of shoulder\n\nYou are a patient: You are a 45-year-old male. You are experiencing the following symptoms:\n- Difficulty reaching up behind your back, especially when trying to brush your hair or put on a shirt\n- Pain with overhead use of your arm, like when you’re reaching for something on a high shelf\n- Weakness in your shoulder muscles, making it feel like your arm is less strong than before\n- Persistent pain that’s been bothering you daily, especially when you’re doing activities like lifting or reaching overhead\n- You’ve noticed that if you move certain ways, like raising your arm suddenly, the pain worsens and you feel a bit of a grinding sensation\nThese symptoms came into fruition gradually over the past three weeks after you started doing more overhead painting at work.Can you tell me if your shoulder pain is worse when you're moving it or if you feel it even when you're just resting without moving, so I can understand whether it’s mainly triggered by activity or if it’s also bothering you when you're at rest?worried_family_involved",
    "output": "THINKING: I'm a bit confused about whether the pain is just when I move or also when I rest, and my wife keeps telling me I should see someone because she's worried about me not being able to do things for the \nANSWER: Well, mostly it hurts when I move my arm or try to do things like reach up or behind me, but sometimes even just laying here, I feel it a little. My wife keeps saying I should get checked out because she’s worried I won’t be able to do what I need to do for the family.",
    "thinking": "I'm a bit confused about whether the pain is just when I move or also when I rest, and my wife keeps telling me I should see someone because she's worried about me not being able to do things for the",
    "answer": "Well, mostly it hurts when I move my arm or try to do things like reach up or behind me, but sometimes even just laying here, I feel it a little. My wife keeps saying I should get checked out because she’s worried I won’t be able to do what I need to do for the family.",
    "behavior_type": "worried_family_involved",
    "turn_count": 6,
    "gold_diagnosis": "Impingement syndrome of shoulder"
  },
  {
    "vignette_index": 470,
    "input": "**PATIENT CHARACTER:** Patient with Impingement syndrome of shoulder\n\nYou are a patient: You are a 45-year-old male. You are experiencing the following symptoms:\n- Difficulty reaching up behind your back, especially when trying to brush your hair or put on a shirt\n- Pain with overhead use of your arm, like when you’re reaching for something on a high shelf\n- Weakness in your shoulder muscles, making it feel like your arm is less strong than before\n- Persistent pain that’s been bothering you daily, especially when you’re doing activities like lifting or reaching overhead\n- You’ve noticed that if you move certain ways, like raising your arm suddenly, the pain worsens and you feel a bit of a grinding sensation\nThese symptoms came into fruition gradually over the past three weeks after you started doing more overhead painting at work.\"Have you noticed if your shoulder has been bothering you or hurting even when you're sleeping or lying down, and if so, is that pain different from the pain you're feeling during the day?\"worried_family_involved",
    "output": "THINKING: I'm a bit worried because my shoulder pain seems worse when I lie down, and my wife keeps telling me I should see someone because she's worried about how this is affecting me and our family. I guess I\nANSWER: Yeah, actually, it does bother me when I’m lying down, and my wife keeps saying I should see a doctor because she’s worried I won’t be able to take care of the kids or do the things I normally do.",
    "thinking": "I'm a bit worried because my shoulder pain seems worse when I lie down, and my wife keeps telling me I should see someone because she's worried about how this is affecting me and our family. I guess I",
    "answer": "Yeah, actually, it does bother me when I’m lying down, and my wife keeps saying I should see a doctor because she’s worried I won’t be able to take care of the kids or do the things I normally do.",
    "behavior_type": "worried_family_involved",
    "turn_count": 8,
    "gold_diagnosis": "Impingement syndrome of shoulder"
  },
  {
    "vignette_index": 470,
    "input": "**PATIENT CHARACTER:** Patient with Impingement syndrome of shoulder\n\nYou are a patient: You are a 45-year-old male. You are experiencing the following symptoms:\n- Difficulty reaching up behind your back, especially when trying to brush your hair or put on a shirt\n- Pain with overhead use of your arm, like when you’re reaching for something on a high shelf\n- Weakness in your shoulder muscles, making it feel like your arm is less strong than before\n- Persistent pain that’s been bothering you daily, especially when you’re doing activities like lifting or reaching overhead\n- You’ve noticed that if you move certain ways, like raising your arm suddenly, the pain worsens and you feel a bit of a grinding sensation\nThese symptoms came into fruition gradually over the past three weeks after you started doing more overhead painting at work.\"Can you tell me if your shoulder pain has been waking you up at night or bothering you more when you're lying down, and if so, is it different from how it feels during the day?\"worried_family_involved",
    "output": "THINKING: I’m worried about this pain because it’s been making me unable to do simple things, and my wife keeps asking if I should see someone. I feel like the pain gets worse when I sleep or lie down, and it’s\nANSWER: Yeah, it does wake me up sometimes, especially if I move a certain way, and it feels worse at night than during the day. It’s been bothering me a lot, and I’m worried about how it’s affecting everything at home.",
    "thinking": "I’m worried about this pain because it’s been making me unable to do simple things, and my wife keeps asking if I should see someone. I feel like the pain gets worse when I sleep or lie down, and it’s",
    "answer": "Yeah, it does wake me up sometimes, especially if I move a certain way, and it feels worse at night than during the day. It’s been bothering me a lot, and I’m worried about how it’s affecting everything at home.",
    "behavior_type": "worried_family_involved",
    "turn_count": 10,
    "gold_diagnosis": "Impingement syndrome of shoulder"
  },
  {
    "vignette_index": 470,
    "input": "**PATIENT CHARACTER:** Patient with Impingement syndrome of shoulder\n\nYou are a patient: You are a 45-year-old male. You are experiencing the following symptoms:\n- Difficulty reaching up behind your back, especially when trying to brush your hair or put on a shirt\n- Pain with overhead use of your arm, like when you’re reaching for something on a high shelf\n- Weakness in your shoulder muscles, making it feel like your arm is less strong than before\n- Persistent pain that’s been bothering you daily, especially when you’re doing activities like lifting or reaching overhead\n- You’ve noticed that if you move certain ways, like raising your arm suddenly, the pain worsens and you feel a bit of a grinding sensation\nThese symptoms came into fruition gradually over the past three weeks after you started doing more overhead painting at work.Have you noticed if pressure around your shoulder, especially just below the collarbone or along the shoulder blade, causes increased pain or discomfort—that is, when the doctor or someone presses gently on your shoulder, does it hurt more or feel tender?worried_family_involved",
    "output": "THINKING: I'm not really sure if pressing on my shoulder makes it worse, but I do notice that even a bit of touch or pressure feels a little uncomfortable sometimes. I guess I just wanted to know if that’s norm\nANSWER: Umm, I think sometimes when someone presses on my shoulder, it feels more tender or sore, but I’m not really sure if that’s worse than before. It just kind of hurts a little more, I guess.",
    "thinking": "I'm not really sure if pressing on my shoulder makes it worse, but I do notice that even a bit of touch or pressure feels a little uncomfortable sometimes. I guess I just wanted to know if that’s norm",
    "answer": "Umm, I think sometimes when someone presses on my shoulder, it feels more tender or sore, but I’m not really sure if that’s worse than before. It just kind of hurts a little more, I guess.",
    "behavior_type": "worried_family_involved",
    "turn_count": 12,
    "gold_diagnosis": "Impingement syndrome of shoulder"
  }
]