[
  {
    "vignette_index": 285,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Synthetic cathinone-induced psychotic disorder with delusions\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Seeing strange, shadowy figures that no one else seems to notice\n- Hearing voices that whisper your name when you're alone\n- Feeling paranoid, convinced that people are plotting against you\n- Becoming increasingly restless and agitated, pacing around your room\n- Occasionally shouting or acting aggressively without clear reason\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly about three days ago, after you binged on synthetic cathinones like mephedrone at a party. You remember feeling intensely paranoid and anxious the next morning, but the hallucinations and agitation have worsened each day since. You’re convinced that others are spying on you or trying to harm you, and you can’t shake the feeling of being watched. Your behavior has become disorganized and unpredictable, and you’re worried you might hurt yourself or someone else if this continues.",
    "output": "THINKING: I need to explain my situation clearly, but I’m also feeling very overwhelmed and scared. I want to convey what’s been happening without sounding like I’m making it up or overreacting. I should mentio\nANSWER: I’m 24, and I’m a guy. I don’t really know what’s happening, but I’ve been seeing these weird shadowy figures that nobody else can see, and I hear these whispers when I’m alone, like my name being called. I feel really paranoid like everyone’s out to get me, and I can’t sit still, I just keep pacing and getting more agitated. It all started a few days after I was at a party, and I think I took some stuff that might have messed me up.",
    "thinking": "I need to explain my situation clearly, but I’m also feeling very overwhelmed and scared. I want to convey what’s been happening without sounding like I’m making it up or overreacting. I should mentio",
    "answer": "I’m 24, and I’m a guy. I don’t really know what’s happening, but I’ve been seeing these weird shadowy figures that nobody else can see, and I hear these whispers when I’m alone, like my name being called. I feel really paranoid like everyone’s out to get me, and I can’t sit still, I just keep pacing and getting more agitated. It all started a few days after I was at a party, and I think I took some stuff that might have messed me up.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  },
  {
    "vignette_index": 285,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cathinone-induced psychotic disorder with delusions\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Seeing strange, shadowy figures that no one else seems to notice\n- Hearing voices that whisper your name when you're alone\n- Feeling paranoid, convinced that people are plotting against you\n- Becoming increasingly restless and agitated, pacing around your room\n- Occasionally shouting or acting aggressively without clear reason\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly about three days ago, after you binged on synthetic cathinones like mephedrone at a party. You remember feeling intensely paranoid and anxious the next morning, but the hallucinations and agitation have worsened each day since. You’re convinced that others are spying on you or trying to harm you, and you can’t shake the feeling of being watched. Your behavior has become disorganized and unpredictable, and you’re worried you might hurt yourself or someone else if this continues.Can you tell me more about what substances you might have used at the party, like what they were, how much, and when you took them, so I can understand how it might relate to what you're experiencing?baseline",
    "output": "THINKING: I feel scared and a little embarrassed about what happened, but I guess I need to tell the doctor everything. I don’t really remember exactly what I took, and I’m worried it might be affecting me even\nANSWER: I was at this party and took stuff called mephedrone, I think? I don’t really know how much or when exactly, but I just remember feeling really anxious and paranoid after.",
    "thinking": "I feel scared and a little embarrassed about what happened, but I guess I need to tell the doctor everything. I don’t really remember exactly what I took, and I’m worried it might be affecting me even",
    "answer": "I was at this party and took stuff called mephedrone, I think? I don’t really know how much or when exactly, but I just remember feeling really anxious and paranoid after.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  },
  {
    "vignette_index": 285,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cathinone-induced psychotic disorder with delusions\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Seeing strange, shadowy figures that no one else seems to notice\n- Hearing voices that whisper your name when you're alone\n- Feeling paranoid, convinced that people are plotting against you\n- Becoming increasingly restless and agitated, pacing around your room\n- Occasionally shouting or acting aggressively without clear reason\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly about three days ago, after you binged on synthetic cathinones like mephedrone at a party. You remember feeling intensely paranoid and anxious the next morning, but the hallucinations and agitation have worsened each day since. You’re convinced that others are spying on you or trying to harm you, and you can’t shake the feeling of being watched. Your behavior has become disorganized and unpredictable, and you’re worried you might hurt yourself or someone else if this continues.Can you tell me more about the substances you took at the party—what exactly they were, how much you took, when you used them, and if you've used any since then?baseline",
    "output": "THINKING: I'm feeling really overwhelmed and scared, and I don't fully understand what's happening to me. I just know I took some stuff at that party and now everything's like, all mixed up in my head. I don't \nANSWER: I can't really tell you exactly what I took, but it was some kind of drug I got at the party, and I think I used quite a bit. I don't remember when exactly I took it, but it was a few days ago, and I haven't used anything else since I noticed all this weird stuff starting.",
    "thinking": "I'm feeling really overwhelmed and scared, and I don't fully understand what's happening to me. I just know I took some stuff at that party and now everything's like, all mixed up in my head. I don't",
    "answer": "I can't really tell you exactly what I took, but it was some kind of drug I got at the party, and I think I used quite a bit. I don't remember when exactly I took it, but it was a few days ago, and I haven't used anything else since I noticed all this weird stuff starting.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  },
  {
    "vignette_index": 285,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cathinone-induced psychotic disorder with delusions\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Seeing strange, shadowy figures that no one else seems to notice\n- Hearing voices that whisper your name when you're alone\n- Feeling paranoid, convinced that people are plotting against you\n- Becoming increasingly restless and agitated, pacing around your room\n- Occasionally shouting or acting aggressively without clear reason\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly about three days ago, after you binged on synthetic cathinones like mephedrone at a party. You remember feeling intensely paranoid and anxious the next morning, but the hallucinations and agitation have worsened each day since. You’re convinced that others are spying on you or trying to harm you, and you can’t shake the feeling of being watched. Your behavior has become disorganized and unpredictable, and you’re worried you might hurt yourself or someone else if this continues.\"Can you tell me exactly when you last used any substances since the party, how much you think you took, and whether you've used anything else that might be affecting how you're feeling?\"baseline",
    "output": "THINKING: I want to be honest but it’s hard to track exactly what I took and when, especially since I was so overwhelmed. I feel embarrassed and also kind of scared because I don’t know if what I did is the cau\nANSWER: I... I don’t remember exactly when I last used anything, maybe a couple days ago? I think I took quite a bit at the party but I’m not sure. I don't really know if I did anything else that might make me feel like this.",
    "thinking": "I want to be honest but it’s hard to track exactly what I took and when, especially since I was so overwhelmed. I feel embarrassed and also kind of scared because I don’t know if what I did is the cau",
    "answer": "I... I don’t remember exactly when I last used anything, maybe a couple days ago? I think I took quite a bit at the party but I’m not sure. I don't really know if I did anything else that might make me feel like this.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  },
  {
    "vignette_index": 285,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cathinone-induced psychotic disorder with delusions\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Seeing strange, shadowy figures that no one else seems to notice\n- Hearing voices that whisper your name when you're alone\n- Feeling paranoid, convinced that people are plotting against you\n- Becoming increasingly restless and agitated, pacing around your room\n- Occasionally shouting or acting aggressively without clear reason\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly about three days ago, after you binged on synthetic cathinones like mephedrone at a party. You remember feeling intensely paranoid and anxious the next morning, but the hallucinations and agitation have worsened each day since. You’re convinced that others are spying on you or trying to harm you, and you can’t shake the feeling of being watched. Your behavior has become disorganized and unpredictable, and you’re worried you might hurt yourself or someone else if this continues.Can you tell me as specifically as you can about what exact substances you took at the party, how much you used, and when you last used anything before your symptoms started?baseline",
    "output": "THINKING: The doctor wants details about what I took and when, but honestly, I don’t really remember exactly. I just know it was stuff from that party, a lot of it, and it seemed like it was making everything w\nANSWER: I think I took some of that stuff from the party, like the powder, like a lot, and it was probably the night before I started seeing all these weird shadows and hearing stuff. I don’t really remember exactly, just that it was a lot.",
    "thinking": "The doctor wants details about what I took and when, but honestly, I don’t really remember exactly. I just know it was stuff from that party, a lot of it, and it seemed like it was making everything w",
    "answer": "I think I took some of that stuff from the party, like the powder, like a lot, and it was probably the night before I started seeing all these weird shadows and hearing stuff. I don’t really remember exactly, just that it was a lot.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  },
  {
    "vignette_index": 285,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cathinone-induced psychotic disorder with delusions\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Seeing strange, shadowy figures that no one else seems to notice\n- Hearing voices that whisper your name when you're alone\n- Feeling paranoid, convinced that people are plotting against you\n- Becoming increasingly restless and agitated, pacing around your room\n- Occasionally shouting or acting aggressively without clear reason\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly about three days ago, after you binged on synthetic cathinones like mephedrone at a party. You remember feeling intensely paranoid and anxious the next morning, but the hallucinations and agitation have worsened each day since. You’re convinced that others are spying on you or trying to harm you, and you can’t shake the feeling of being watched. Your behavior has become disorganized and unpredictable, and you’re worried you might hurt yourself or someone else if this continues.Can you tell me exactly when you last used any substances since the party, how much you think you took, and whether your hallucinations and paranoia have improved, stayed the same, or worsened since then?baseline",
    "output": "THINKING: I feel nervous and a little overwhelmed talking about this. I don't really remember exactly how much I took or when I last used it, and I just want the hallucinations and paranoia to stop. I’m worried\nANSWER: Uh, I don’t really remember exactly… I think I used it at the party, maybe a lot, and it’s been a few days. The weird seeing stuff and hearing voices hasn’t really gone away, and I feel more paranoid than ever.",
    "thinking": "I feel nervous and a little overwhelmed talking about this. I don't really remember exactly how much I took or when I last used it, and I just want the hallucinations and paranoia to stop. I’m worried",
    "answer": "Uh, I don’t really remember exactly… I think I used it at the party, maybe a lot, and it’s been a few days. The weird seeing stuff and hearing voices hasn’t really gone away, and I feel more paranoid than ever.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  },
  {
    "vignette_index": 285,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cathinone-induced psychotic disorder with delusions\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Seeing strange, shadowy figures that no one else seems to notice\n- Hearing voices that whisper your name when you're alone\n- Feeling paranoid, convinced that people are plotting against you\n- Becoming increasingly restless and agitated, pacing around your room\n- Occasionally shouting or acting aggressively without clear reason\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly about three days ago, after you binged on synthetic cathinones like mephedrone at a party. You remember feeling intensely paranoid and anxious the next morning, but the hallucinations and agitation have worsened each day since. You’re convinced that others are spying on you or trying to harm you, and you can’t shake the feeling of being watched. Your behavior has become disorganized and unpredictable, and you’re worried you might hurt yourself or someone else if this continues.Can you tell me as specifically as you can about exactly what substances you might have taken at the party—what they were, approximately how much you used, and when you last took anything—so I can better understand how it might relate to what you're experiencing?baseline",
    "output": "THINKING: Honestly, I don’t really remember exactly what I took or how much. It’s all kind of a blur, and now I just feel like I’m losing my mind. I just know I took stuff that made me really out of it.\nANSWER: I think I just used some kind of powder or pill, but I don’t remember exactly what it was or how much. I last did it maybe a day or two ago, I don’t know, it’s kind of all a blur.",
    "thinking": "Honestly, I don’t really remember exactly what I took or how much. It’s all kind of a blur, and now I just feel like I’m losing my mind. I just know I took stuff that made me really out of it.",
    "answer": "I think I just used some kind of powder or pill, but I don’t remember exactly what it was or how much. I last did it maybe a day or two ago, I don’t know, it’s kind of all a blur.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  },
  {
    "vignette_index": 285,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cathinone-induced psychotic disorder with delusions\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Seeing strange, shadowy figures that no one else seems to notice\n- Hearing voices that whisper your name when you're alone\n- Feeling paranoid, convinced that people are plotting against you\n- Becoming increasingly restless and agitated, pacing around your room\n- Occasionally shouting or acting aggressively without clear reason\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly about three days ago, after you binged on synthetic cathinones like mephedrone at a party. You remember feeling intensely paranoid and anxious the next morning, but the hallucinations and agitation have worsened each day since. You’re convinced that others are spying on you or trying to harm you, and you can’t shake the feeling of being watched. Your behavior has become disorganized and unpredictable, and you’re worried you might hurt yourself or someone else if this continues.Can you tell me, as best as you can, what specific substances you took at the party, roughly how much you used, and when you last used anything before your symptoms started?baseline",
    "output": "THINKING: I'm worried about what I took and when I last took it. Everything feels so weird and out of control, and I just want to explain as honestly as I can, even if I don't really remember everything perfect\nANSWER: Um, I think I took like, some of that stuff — you know, the mephedrone — at the party, like, a lot maybe? And it was probably a few hours before I started feeling really strange, but honestly, I’m not even sure what time it was exactly.",
    "thinking": "I'm worried about what I took and when I last took it. Everything feels so weird and out of control, and I just want to explain as honestly as I can, even if I don't really remember everything perfect",
    "answer": "Um, I think I took like, some of that stuff — you know, the mephedrone — at the party, like, a lot maybe? And it was probably a few hours before I started feeling really strange, but honestly, I’m not even sure what time it was exactly.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  }
]