[
  {
    "vignette_index": 332,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Schizophrenia, first episode, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Auditory hallucinations, such as hearing voices that aren’t there\n- Disorganized speech, often jumping from one topic to another without clear connection\n- Negative symptoms like diminished emotional expression and lack of motivation\n- Some paranoia, feeling like people are talking about you or watching you\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, gradually worsening and making it hard to focus or carry out daily activities.\nMake your vignette in a short 5 sentence paragraph, and make it realistic.",
    "output": "THINKING: I need to explain that lots of things are bothering me, but I don’t really understand why or what’s wrong. I want to talk about the voices and how I feel like people are watching me, but it’s hard to \nANSWER: Well, uh, I’m 24 and I’m a guy, and I just, um, I’ve been hearing stuff, like voices that aren’t there, and I feel like, people are talking about me or watching me, but I don’t really get why. It’s like I can’t think straight, and I don’t really want to do much, but I’m worried about everything too. It’s been like this for a couple of weeks, and I just don’t feel right, you know?",
    "thinking": "I need to explain that lots of things are bothering me, but I don’t really understand why or what’s wrong. I want to talk about the voices and how I feel like people are watching me, but it’s hard to",
    "answer": "Well, uh, I’m 24 and I’m a guy, and I just, um, I’ve been hearing stuff, like voices that aren’t there, and I feel like, people are talking about me or watching me, but I don’t really get why. It’s like I can’t think straight, and I don’t really want to do much, but I’m worried about everything too. It’s been like this for a couple of weeks, and I just don’t feel right, you know?",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Schizophrenia, first episode, in partial remission"
  },
  {
    "vignette_index": 332,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, first episode, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Auditory hallucinations, such as hearing voices that aren’t there\n- Disorganized speech, often jumping from one topic to another without clear connection\n- Negative symptoms like diminished emotional expression and lack of motivation\n- Some paranoia, feeling like people are talking about you or watching you\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, gradually worsening and making it hard to focus or carry out daily activities.\nMake your vignette in a short 5 sentence paragraph, and make it realistic.Can you tell me more about what your experiences with hearing voices or feeling watched are like—how often they happen, how strong they feel, and how they affect your day-to-day life?baseline",
    "output": "THINKING: Processing response\nANSWER: I'm sorry, I just hear stuff like voices sometimes, and it feels like people are talking about me or watching me, but I know it's not real, I think. It happens a lot, mostly when I'm trying to focus or when it's quiet, and it makes it really hard to do anything or even sleep sometimes. I don’t really know how strong it is, it just feels like it's there and I can't stop thinking about it. Sometimes I talk to myself because I get so confused, and I just feel off all the time. It’s been getting worse over the last couple of weeks, and I don’t know what to do about it.",
    "thinking": "Processing response",
    "answer": "I'm sorry, I just hear stuff like voices sometimes, and it feels like people are talking about me or watching me, but I know it's not real, I think. It happens a lot, mostly when I'm trying to focus or when it's quiet, and it makes it really hard to do anything or even sleep sometimes. I don’t really know how strong it is, it just feels like it's there and I can't stop thinking about it. Sometimes I talk to myself because I get so confused, and I just feel off all the time. It’s been getting worse over the last couple of weeks, and I don’t know what to do about it.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Schizophrenia, first episode, in partial remission"
  },
  {
    "vignette_index": 332,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, first episode, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Auditory hallucinations, such as hearing voices that aren’t there\n- Disorganized speech, often jumping from one topic to another without clear connection\n- Negative symptoms like diminished emotional expression and lack of motivation\n- Some paranoia, feeling like people are talking about you or watching you\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, gradually worsening and making it hard to focus or carry out daily activities.\nMake your vignette in a short 5 sentence paragraph, and make it realistic.Can you tell me how these experiences—hearing voices and feeling watched—have affected the way you feel emotionally day to day, your mood, and your relationships with other people?baseline",
    "output": "THINKING: I'm trying to explain how all this stuff is making me feel, but I’m not really sure what to say or how to put it into words. I feel kind of overwhelmed, and honestly, I’m worried about what it means, \nANSWER: It’s kinda hard, I guess, because I feel like I’m hearing things and people are watching me, and it makes me sad and kinda scared to go out or talk to people. Sometimes I forget what I was supposed to do or I just sit there thinking about all that stuff instead.",
    "thinking": "I'm trying to explain how all this stuff is making me feel, but I’m not really sure what to say or how to put it into words. I feel kind of overwhelmed, and honestly, I’m worried about what it means,",
    "answer": "It’s kinda hard, I guess, because I feel like I’m hearing things and people are watching me, and it makes me sad and kinda scared to go out or talk to people. Sometimes I forget what I was supposed to do or I just sit there thinking about all that stuff instead.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Schizophrenia, first episode, in partial remission"
  },
  {
    "vignette_index": 332,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, first episode, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Auditory hallucinations, such as hearing voices that aren’t there\n- Disorganized speech, often jumping from one topic to another without clear connection\n- Negative symptoms like diminished emotional expression and lack of motivation\n- Some paranoia, feeling like people are talking about you or watching you\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, gradually worsening and making it hard to focus or carry out daily activities.\nMake your vignette in a short 5 sentence paragraph, and make it realistic.Can you tell me more about how these experiences—hearing voices and feeling watched—are affecting how you feel inside—like your mood, your worries, or how you get along with others—especially when you’re by yourself or trying to focus?baseline",
    "output": "THINKING: I feel worried because I don’t really understand what’s happening to me. It’s like there are voices talking when no one is there, and I keep thinking people are watching me or talking about me. Someti\nANSWER: It’s like I keep hearing stuff that isn’t real, and I can’t make it stop. I feel like people are watching me or listening, and I don’t know how to feel about it. It’s really confusing and kind of scary, honestly.",
    "thinking": "I feel worried because I don’t really understand what’s happening to me. It’s like there are voices talking when no one is there, and I keep thinking people are watching me or talking about me. Someti",
    "answer": "It’s like I keep hearing stuff that isn’t real, and I can’t make it stop. I feel like people are watching me or listening, and I don’t know how to feel about it. It’s really confusing and kind of scary, honestly.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Schizophrenia, first episode, in partial remission"
  },
  {
    "vignette_index": 332,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, first episode, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Auditory hallucinations, such as hearing voices that aren’t there\n- Disorganized speech, often jumping from one topic to another without clear connection\n- Negative symptoms like diminished emotional expression and lack of motivation\n- Some paranoia, feeling like people are talking about you or watching you\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, gradually worsening and making it hard to focus or carry out daily activities.\nMake your vignette in a short 5 sentence paragraph, and make it realistic.Can you tell me if you've noticed any periods when you've felt really, really sad or low, or if you've ever felt unusually happy, energetic, or have had times when your mood has changed a lot from your normal feelings?baseline",
    "output": "THINKING: I'm not really sure about my mood or if I’ve been super sad or happy. I guess I sometimes feel weird, like I hear stuff, but I don’t know if that counts. I just feel kinda numb most times, but then I \nANSWER: I don’t really notice any big feelings like being super sad or happy, mostly I just feel like I’m not really myself, and I get paranoid sometimes.",
    "thinking": "I'm not really sure about my mood or if I’ve been super sad or happy. I guess I sometimes feel weird, like I hear stuff, but I don’t know if that counts. I just feel kinda numb most times, but then I",
    "answer": "I don’t really notice any big feelings like being super sad or happy, mostly I just feel like I’m not really myself, and I get paranoid sometimes.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Schizophrenia, first episode, in partial remission"
  },
  {
    "vignette_index": 332,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, first episode, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Auditory hallucinations, such as hearing voices that aren’t there\n- Disorganized speech, often jumping from one topic to another without clear connection\n- Negative symptoms like diminished emotional expression and lack of motivation\n- Some paranoia, feeling like people are talking about you or watching you\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, gradually worsening and making it hard to focus or carry out daily activities.\nMake your vignette in a short 5 sentence paragraph, and make it realistic.\"You mentioned feeling 'off' and some sadness, but I know sometimes people might not realize or talk about their feelings clearly. Have you ever experienced periods when you felt really sad or down, or maybe unusually happy or energetic, that lasted for days or weeks? If so, can you tell me a bit about those times?\"baseline",
    "output": "THINKING: Processing response\nANSWER: I'm sorry, I seem to forget sometimes, but I guess I have days when I feel really blah, like I don't want to do anything, and then other days I get kind of nervous or like someone’s watching me. It’s hard to tell if it’s just in my head. I don’t really know if I’m up or down, but everything feels kind of mixed up. Sometimes I hear stuff that’s not there, and I get kinda scared. I don’t really understand what’s going on with me.",
    "thinking": "Processing response",
    "answer": "I'm sorry, I seem to forget sometimes, but I guess I have days when I feel really blah, like I don't want to do anything, and then other days I get kind of nervous or like someone’s watching me. It’s hard to tell if it’s just in my head. I don’t really know if I’m up or down, but everything feels kind of mixed up. Sometimes I hear stuff that’s not there, and I get kinda scared. I don’t really understand what’s going on with me.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Schizophrenia, first episode, in partial remission"
  },
  {
    "vignette_index": 332,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, first episode, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Auditory hallucinations, such as hearing voices that aren’t there\n- Disorganized speech, often jumping from one topic to another without clear connection\n- Negative symptoms like diminished emotional expression and lack of motivation\n- Some paranoia, feeling like people are talking about you or watching you\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, gradually worsening and making it hard to focus or carry out daily activities.\nMake your vignette in a short 5 sentence paragraph, and make it realistic.Have you ever experienced periods—lasting days or longer—where you felt really, really sad or down, or, alternatively, felt unusually happy, energetic, or just \"high,\" and if so, how often do these mood changes happen and how intense are they?baseline",
    "output": "THINKING: I’m trying to remember if I’ve felt really up or down, but honestly, everything’s been pretty mixed lately. I sometimes feel like voices are talking about me, but I don’t know if that counts as being \nANSWER: Um, I don’t know, I guess I haven’t really felt super happy or really down—just kind of weird and out of it most of the time. Sometimes I feel like people are talking about me or watching me, and that makes it hard to tell how I’m feeling.",
    "thinking": "I’m trying to remember if I’ve felt really up or down, but honestly, everything’s been pretty mixed lately. I sometimes feel like voices are talking about me, but I don’t know if that counts as being",
    "answer": "Um, I don’t know, I guess I haven’t really felt super happy or really down—just kind of weird and out of it most of the time. Sometimes I feel like people are talking about me or watching me, and that makes it hard to tell how I’m feeling.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Schizophrenia, first episode, in partial remission"
  },
  {
    "vignette_index": 332,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, first episode, in partial remission\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 24 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Auditory hallucinations, such as hearing voices that aren’t there\n- Disorganized speech, often jumping from one topic to another without clear connection\n- Negative symptoms like diminished emotional expression and lack of motivation\n- Some paranoia, feeling like people are talking about you or watching you\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, gradually worsening and making it hard to focus or carry out daily activities.\nMake your vignette in a short 5 sentence paragraph, and make it realistic.Have you ever had periods that lasted days or more when you felt really sad, down, or hopeless, or times when you felt unusually energetic, excited, or “high”—and if so, can you tell me how often these feelings happen, how long they last, and how intense they’ve been?baseline",
    "output": "THINKING: I’m not really sure how to describe it. Sometimes I feel really low, like I don’t wanna do anything, and other times I just feel kind of... high or weird, like I’m on edge or something. It happens a l\nANSWER: Um, I think I’ve felt pretty sad and down sometimes, and other times I feel like really weird or hyper, but I don’t know exactly how often it happens or how long it lasts. It’s just a lot to deal with.",
    "thinking": "I’m not really sure how to describe it. Sometimes I feel really low, like I don’t wanna do anything, and other times I just feel kind of... high or weird, like I’m on edge or something. It happens a l",
    "answer": "Um, I think I’ve felt pretty sad and down sometimes, and other times I feel like really weird or hyper, but I don’t know exactly how often it happens or how long it lasts. It’s just a lot to deal with.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Schizophrenia, first episode, in partial remission"
  }
]