[
  {
    "vignette_index": 183,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Streptococcal pharyngitis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 10 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A very sore throat that started suddenly yesterday\n- Fever that has been fluctuating and reaching up to 102°F (38.9°C)\n- Swollen and tender lymph nodes on your neck\n- Red, swollen tonsils with some white patches\n- Headache that has been bothering you throughout the day\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday afternoon after you came home from school. You remember sharing drinks and eating utensils with your friends during recess, and you’ve been feeling worse as the day went on. You’ve been feeling tired and achy, and your mom noticed your neck was swollen. You’re worried because you don’t feel like eating much and just want to rest.",
    "output": "THINKING: I should explain that I've been feeling pretty bad and it's been getting worse, but I don't want to scare the doctor or sound like I'm overreacting. I want to be honest but also not make a big deal ou\nANSWER: I’m, uh, 10 years old and I’m a boy. I’ve had this really sore throat that came on all of a sudden yesterday, and I’ve been running a fever, like up and down to almost 103. I guess my neck feels swollen and kinda tender too. My head’s been hurting all day and I don’t really feel like eating much. My mom made me come in because she said I should see someone, but I thought I’d be okay and it’s probably nothing.",
    "thinking": "I should explain that I've been feeling pretty bad and it's been getting worse, but I don't want to scare the doctor or sound like I'm overreacting. I want to be honest but also not make a big deal ou",
    "answer": "I’m, uh, 10 years old and I’m a boy. I’ve had this really sore throat that came on all of a sudden yesterday, and I’ve been running a fever, like up and down to almost 103. I guess my neck feels swollen and kinda tender too. My head’s been hurting all day and I don’t really feel like eating much. My mom made me come in because she said I should see someone, but I thought I’d be okay and it’s probably nothing.",
    "behavior_type": "stoic_minimizer",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient who downplays symptoms and delays care",
      "modifiers": [
        "symptom_minimization",
        "delayed_care_seeking",
        "tough_attitude"
      ],
      "empathy_cues": [
        "downplaying",
        "reluctance",
        "pride_in_toughness",
        "external_pressure"
      ]
    },
    "gold_diagnosis": "Streptococcal pharyngitis"
  },
  {
    "vignette_index": 183,
    "input": "**PATIENT CHARACTER:** Patient with Streptococcal pharyngitis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 10 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A very sore throat that started suddenly yesterday\n- Fever that has been fluctuating and reaching up to 102°F (38.9°C)\n- Swollen and tender lymph nodes on your neck\n- Red, swollen tonsils with some white patches\n- Headache that has been bothering you throughout the day\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday afternoon after you came home from school. You remember sharing drinks and eating utensils with your friends during recess, and you’ve been feeling worse as the day went on. You’ve been feeling tired and achy, and your mom noticed your neck was swollen. You’re worried because you don’t feel like eating much and just want to rest.Can you tell me more about how you're feeling right now—like, is your throat and neck as sore or uncomfortable as you expected, or is it worse than you thought?stoic_minimizer",
    "output": "THINKING: I don't really wanna make a big deal, but it's pretty sore and I feel kinda all over the place. My mom said I should see someone, so I guess I better tell the doctor what's going on.\nANSWER: It's really sore and my neck's all swollen and tender, but I guess it's not as bad as I thought. It just started yesterday and I feel pretty tired.",
    "thinking": "I don't really wanna make a big deal, but it's pretty sore and I feel kinda all over the place. My mom said I should see someone, so I guess I better tell the doctor what's going on.",
    "answer": "It's really sore and my neck's all swollen and tender, but I guess it's not as bad as I thought. It just started yesterday and I feel pretty tired.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 0,
    "gold_diagnosis": "Streptococcal pharyngitis"
  },
  {
    "vignette_index": 183,
    "input": "**PATIENT CHARACTER:** Patient with Streptococcal pharyngitis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 10 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A very sore throat that started suddenly yesterday\n- Fever that has been fluctuating and reaching up to 102°F (38.9°C)\n- Swollen and tender lymph nodes on your neck\n- Red, swollen tonsils with some white patches\n- Headache that has been bothering you throughout the day\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday afternoon after you came home from school. You remember sharing drinks and eating utensils with your friends during recess, and you’ve been feeling worse as the day went on. You’ve been feeling tired and achy, and your mom noticed your neck was swollen. You’re worried because you don’t feel like eating much and just want to rest.Can you tell me how bad your sore throat and tiredness are right now compared to how you've felt before you came in, and if they've ever been worse than this, what that was like?stoic_minimizer",
    "output": "THINKING: I want to explain that I don’t think it’s that serious, even though I do feel pretty bad. I’ve had worse colds before, but I don’t want to overreact or bother anyone. I just want to get it over with a\nANSWER: It’s probably not that bad, I guess. My throat’s just really sore, but I think I’ve had worse stuff before. I’ve been feeling tired and hot, but I’ve dealt with it before.",
    "thinking": "I want to explain that I don’t think it’s that serious, even though I do feel pretty bad. I’ve had worse colds before, but I don’t want to overreact or bother anyone. I just want to get it over with a",
    "answer": "It’s probably not that bad, I guess. My throat’s just really sore, but I think I’ve had worse stuff before. I’ve been feeling tired and hot, but I’ve dealt with it before.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 2,
    "gold_diagnosis": "Streptococcal pharyngitis"
  },
  {
    "vignette_index": 183,
    "input": "**PATIENT CHARACTER:** Patient with Streptococcal pharyngitis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 10 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A very sore throat that started suddenly yesterday\n- Fever that has been fluctuating and reaching up to 102°F (38.9°C)\n- Swollen and tender lymph nodes on your neck\n- Red, swollen tonsils with some white patches\n- Headache that has been bothering you throughout the day\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday afternoon after you came home from school. You remember sharing drinks and eating utensils with your friends during recess, and you’ve been feeling worse as the day went on. You’ve been feeling tired and achy, and your mom noticed your neck was swollen. You’re worried because you don’t feel like eating much and just want to rest.\"Sometimes, when people have a sore throat like this, they also feel pretty tired, have a stiff neck, or notice certain symptoms in their mouth or stomach. Can you tell me if you've felt any of these things or if your throat feels worse or different than yesterday?\"stoic_minimizer",
    "output": "THINKING: I don’t want to seem weak or make it seem like I’m exaggerating, but I do feel pretty bad. Maybe I should mention the neck swelling and the fever, but I don’t want to sound like I’m just complaining.\nANSWER: Yeah, my throat’s been really sore, and I feel kinda tired, but I guess that’s normal when I don’t feel good. My neck’s a little swollen too, but I don’t want to make it into a big deal.",
    "thinking": "I don’t want to seem weak or make it seem like I’m exaggerating, but I do feel pretty bad. Maybe I should mention the neck swelling and the fever, but I don’t want to sound like I’m just complaining.",
    "answer": "Yeah, my throat’s been really sore, and I feel kinda tired, but I guess that’s normal when I don’t feel good. My neck’s a little swollen too, but I don’t want to make it into a big deal.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 4,
    "gold_diagnosis": "Streptococcal pharyngitis"
  },
  {
    "vignette_index": 183,
    "input": "**PATIENT CHARACTER:** Patient with Streptococcal pharyngitis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 10 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A very sore throat that started suddenly yesterday\n- Fever that has been fluctuating and reaching up to 102°F (38.9°C)\n- Swollen and tender lymph nodes on your neck\n- Red, swollen tonsils with some white patches\n- Headache that has been bothering you throughout the day\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday afternoon after you came home from school. You remember sharing drinks and eating utensils with your friends during recess, and you’ve been feeling worse as the day went on. You’ve been feeling tired and achy, and your mom noticed your neck was swollen. You’re worried because you don’t feel like eating much and just want to rest.Can you tell me if your sore throat has any unusual signs like white patches or pus on your tonsils, if you’ve noticed any rash or swelling elsewhere, or if you've had contact with anyone sick recently?stoic_minimizer",
    "output": "THINKING: I don’t want to make a big deal, but I'm pretty uncomfortable. I guess it might be serious, but I’ve had sore throats before, and it usually gets better. I just want to go home and rest.\nANSWER: Yeah, I saw some white stuff on my tonsils and I feel kind of weird, but I think it’s probably nothing. It started out of nowhere yesterday, and I’ve been tired.",
    "thinking": "I don’t want to make a big deal, but I'm pretty uncomfortable. I guess it might be serious, but I’ve had sore throats before, and it usually gets better. I just want to go home and rest.",
    "answer": "Yeah, I saw some white stuff on my tonsils and I feel kind of weird, but I think it’s probably nothing. It started out of nowhere yesterday, and I’ve been tired.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 6,
    "gold_diagnosis": "Streptococcal pharyngitis"
  },
  {
    "vignette_index": 183,
    "input": "**PATIENT CHARACTER:** Patient with Streptococcal pharyngitis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 10 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A very sore throat that started suddenly yesterday\n- Fever that has been fluctuating and reaching up to 102°F (38.9°C)\n- Swollen and tender lymph nodes on your neck\n- Red, swollen tonsils with some white patches\n- Headache that has been bothering you throughout the day\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday afternoon after you came home from school. You remember sharing drinks and eating utensils with your friends during recess, and you’ve been feeling worse as the day went on. You’ve been feeling tired and achy, and your mom noticed your neck was swollen. You’re worried because you don’t feel like eating much and just want to rest.\"Can you tell me if it's ever been really hard for you to swallow, or if you feel like your throat is closing up or making it hard to breathe at all?\"stoic_minimizer",
    "output": "THINKING: I don't want to make it seem like it's a big deal, but I do feel pretty bad and it's been going on for a day. I haven't felt like I couldn't breathe or anything, so maybe it's not that serious, but my\nANSWER: No, I don’t think it’s ever been really hard to swallow or anything like that, and I don’t feel like my throat is closing up. It just hurts a lot.",
    "thinking": "I don't want to make it seem like it's a big deal, but I do feel pretty bad and it's been going on for a day. I haven't felt like I couldn't breathe or anything, so maybe it's not that serious, but my",
    "answer": "No, I don’t think it’s ever been really hard to swallow or anything like that, and I don’t feel like my throat is closing up. It just hurts a lot.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 8,
    "gold_diagnosis": "Streptococcal pharyngitis"
  },
  {
    "vignette_index": 183,
    "input": "**PATIENT CHARACTER:** Patient with Streptococcal pharyngitis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 10 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A very sore throat that started suddenly yesterday\n- Fever that has been fluctuating and reaching up to 102°F (38.9°C)\n- Swollen and tender lymph nodes on your neck\n- Red, swollen tonsils with some white patches\n- Headache that has been bothering you throughout the day\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday afternoon after you came home from school. You remember sharing drinks and eating utensils with your friends during recess, and you’ve been feeling worse as the day went on. You’ve been feeling tired and achy, and your mom noticed your neck was swollen. You’re worried because you don’t feel like eating much and just want to rest.Have you noticed at any point that it’s been hard to breathe, a feeling like your throat is closing, or that your voice has sounded different, even if it’s just a little bit?stoic_minimizer",
    "output": "THINKING: I don't want to overreact, but my throat really hurts and it’s been like this for a while now. I don’t know if it’s serious or just something I’ll get better from. My mom keeps saying I should see som\nANSWER: Yeah, I guess I’ve noticed it’s kinda hard to breathe sometimes, but it’s probably nothing. My throat's been sore and swollen, but I’ve had stuff like this before, so I can handle it.",
    "thinking": "I don't want to overreact, but my throat really hurts and it’s been like this for a while now. I don’t know if it’s serious or just something I’ll get better from. My mom keeps saying I should see som",
    "answer": "Yeah, I guess I’ve noticed it’s kinda hard to breathe sometimes, but it’s probably nothing. My throat's been sore and swollen, but I’ve had stuff like this before, so I can handle it.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 10,
    "gold_diagnosis": "Streptococcal pharyngitis"
  },
  {
    "vignette_index": 183,
    "input": "**PATIENT CHARACTER:** Patient with Streptococcal pharyngitis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 10 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A very sore throat that started suddenly yesterday\n- Fever that has been fluctuating and reaching up to 102°F (38.9°C)\n- Swollen and tender lymph nodes on your neck\n- Red, swollen tonsils with some white patches\n- Headache that has been bothering you throughout the day\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday afternoon after you came home from school. You remember sharing drinks and eating utensils with your friends during recess, and you’ve been feeling worse as the day went on. You’ve been feeling tired and achy, and your mom noticed your neck was swollen. You’re worried because you don’t feel like eating much and just want to rest.Have you noticed any times when it’s been really hard for you to breathe, or if you felt like your throat was closing up or making it hard to swallow or talk properly, even just for a moment?stoic_minimizer",
    "output": "THINKING: I don’t want to make a big deal out of this, but my throat really hurts and I’ve been tired and hot all day. I guess it’s probably nothing, but my mom said I should tell the doctor, so I’m here.\nANSWER: It's been pretty hard to breathe or talk properly or anything like that, but I think it's probably nothing. I just feel really tired and my neck is swollen.",
    "thinking": "I don’t want to make a big deal out of this, but my throat really hurts and I’ve been tired and hot all day. I guess it’s probably nothing, but my mom said I should tell the doctor, so I’m here.",
    "answer": "It's been pretty hard to breathe or talk properly or anything like that, but I think it's probably nothing. I just feel really tired and my neck is swollen.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 12,
    "gold_diagnosis": "Streptococcal pharyngitis"
  }
]