[
  {
    "vignette_index": 262,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.",
    "output": "THINKING: He's asking why I came in today. I've been dealing with all these things for a while, but I didn't want to make a big deal out of it. Maybe I should mention the fainting and the swelling, since they'v\nANSWER: Well, I've been feeling more tired than usual and I've had some swelling in my legs and ankles that I thought would go away. But lately, I've been getting chest pain even when I'm just resting, and I fainted once when I got up quickly. I’ve also been feeling kinda nauseous and bloated after meals. I’ve had this stuff for a couple of months, but it’s been worse recently. And, I don’t know, I just thought I should come in and see if it’s anything serious.",
    "thinking": "He's asking why I came in today. I've been dealing with all these things for a while, but I didn't want to make a big deal out of it. Maybe I should mention the fainting and the swelling, since they'v",
    "answer": "Well, I've been feeling more tired than usual and I've had some swelling in my legs and ankles that I thought would go away. But lately, I've been getting chest pain even when I'm just resting, and I fainted once when I got up quickly. I’ve also been feeling kinda nauseous and bloated after meals. I’ve had this stuff for a couple of months, but it’s been worse recently. And, I don’t know, I just thought I should come in and see if it’s anything serious.",
    "behavior_type": "stoic_minimizer",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient who downplays symptoms and delays care",
      "modifiers": [
        "symptom_minimization",
        "delayed_care_seeking",
        "tough_attitude"
      ],
      "empathy_cues": [
        "downplaying",
        "reluctance",
        "pride_in_toughness",
        "external_pressure"
      ]
    },
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 262,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.Can you tell me more about how your chest pain and fainting episodes affect your daily activities and how serious they feel to you when they happen?stoic_minimizer",
    "output": "THINKING: I don’t really think it’s that serious, but I guess it’s made me more tired and uncomfortable than I’d like. I don’t want to make a big deal out of it, but it’s been going on for a while now.\nANSWER: Well, I just sort of feel tired all the time, and the fainting was a one-time thing—probably just got dizzy or something. It’s not like I can’t handle it, really.",
    "thinking": "I don’t really think it’s that serious, but I guess it’s made me more tired and uncomfortable than I’d like. I don’t want to make a big deal out of it, but it’s been going on for a while now.",
    "answer": "Well, I just sort of feel tired all the time, and the fainting was a one-time thing—probably just got dizzy or something. It’s not like I can’t handle it, really.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 0,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 262,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.Can you tell me more about whether you've noticed any shortness of breath, especially when you're active or lying down, or if you've been feeling more or less able to do your usual activities lately?stoic_minimizer",
    "output": "THINKING: The doctor is asking about my breathing and activity levels. I honestly haven't thought much about shortness of breath because I usually just deal with feeling tired and dizzy, but I guess I might get\nANSWER: I don’t really notice much trouble breathing, honestly. I’ve been feeling more tired and dizzy, but I thought it was just the usual, so I didn’t pay it too much mind.",
    "thinking": "The doctor is asking about my breathing and activity levels. I honestly haven't thought much about shortness of breath because I usually just deal with feeling tired and dizzy, but I guess I might get",
    "answer": "I don’t really notice much trouble breathing, honestly. I’ve been feeling more tired and dizzy, but I thought it was just the usual, so I didn’t pay it too much mind.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 2,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 262,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.\"Can you tell me if your symptoms—like chest pain, feeling faint, or swelling in your legs—have started to make it harder for you to do the things you usually enjoy or need to do day-to-day?\"stoic_minimizer",
    "output": "THINKING: I don't want to make a big deal out of this, but I guess it's a little harder to do my normal stuff, especially with feeling so tired and all the swelling. Not sure if it's serious or just something I\nANSWER: Yeah, I guess it’s been making it kind of tough to do my usual things, especially with the tiredness and the swelling.",
    "thinking": "I don't want to make a big deal out of this, but I guess it's a little harder to do my normal stuff, especially with feeling so tired and all the swelling. Not sure if it's serious or just something I",
    "answer": "Yeah, I guess it’s been making it kind of tough to do my usual things, especially with the tiredness and the swelling.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 4,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 262,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.Can you tell me if your chest pain and feeling faint happen more when you're active or resting, and if they've been worse during certain activities or positions?stoic_minimizer",
    "output": "THINKING: I guess the chest pain and feeling faint happen whenever I do things, but honestly, it’s not like I’m doing much most of the time. I’ve been feeling like this for a while, so I just deal with it.\nANSWER: It’s kinda always there, I suppose, but sometimes it feels a little worse when I’m just resting, and I fainted once when I stood up quickly.",
    "thinking": "I guess the chest pain and feeling faint happen whenever I do things, but honestly, it’s not like I’m doing much most of the time. I’ve been feeling like this for a while, so I just deal with it.",
    "answer": "It’s kinda always there, I suppose, but sometimes it feels a little worse when I’m just resting, and I fainted once when I stood up quickly.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 6,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 262,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.Can you tell me more about what your chest discomfort feels like—does it come on suddenly or gradually, and is it more of a pressure, dull ache, or sharp pain? Do you notice if it happens mostly when you're resting, active, or in certain positions?stoic_minimizer",
    "output": "THINKING: I’ve been dealing with this stuff for a little while now, and it’s not really like I get sudden sharp pain or anything. It’s mostly a dull thing that happens even when I’m just sitting around, and I g\nANSWER: It’s hard to say, I guess it’s more of a pressure or a dull ache, and it kinda comes and goes even when I’m just sitting, not really doing anything.",
    "thinking": "I’ve been dealing with this stuff for a little while now, and it’s not really like I get sudden sharp pain or anything. It’s mostly a dull thing that happens even when I’m just sitting around, and I g",
    "answer": "It’s hard to say, I guess it’s more of a pressure or a dull ache, and it kinda comes and goes even when I’m just sitting, not really doing anything.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 8,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 262,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.Can you tell me if your chest pain feels different when you're resting versus when you're moving around, and whether certain positions, like lying down or sitting up, make the discomfort better or worse?stoic_minimizer",
    "output": "THINKING: I guess the chest pain happens both when I’m still and when I move around, but I don’t really notice a big difference. Sitting or lying down doesn’t seem to change it much, so I haven’t paid too much \nANSWER: It’s sort of there whether I’m resting or walking around, and I haven’t really seen much change when I sit or lie down.",
    "thinking": "I guess the chest pain happens both when I’m still and when I move around, but I don’t really notice a big difference. Sitting or lying down doesn’t seem to change it much, so I haven’t paid too much",
    "answer": "It’s sort of there whether I’m resting or walking around, and I haven’t really seen much change when I sit or lie down.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 10,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 262,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.Can you tell me if your chest discomfort has specific features, like whether it comes on suddenly or gradually, if it feels like pressure or dull pain, and whether certain positions or activities make it better or worse?stoic_minimizer",
    "output": "THINKING: I want to explain that it's nothing too serious, probably just stuff that will go away. I don’t want to make a big deal out of it because I usually can handle pain and discomfort, and I don’t want to \nANSWER: It kinda feels like pressure, but not sharp, just dull and weird, and it comes on sometimes when I’m just sitting or lying down. I guess it’s not really a specific way, and I haven’t noticed much different with position or anything.",
    "thinking": "I want to explain that it's nothing too serious, probably just stuff that will go away. I don’t want to make a big deal out of it because I usually can handle pain and discomfort, and I don’t want to",
    "answer": "It kinda feels like pressure, but not sharp, just dull and weird, and it comes on sometimes when I’m just sitting or lying down. I guess it’s not really a specific way, and I haven’t noticed much different with position or anything.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 12,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 262,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 52 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fatigue\n- Chest pain at rest\n- Dizziness and occasional fainting spells\n- Edema in your feet and legs\n- Nausea and bloating\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started gradually about two months ago, with you feeling more tired than usual and noticing some swelling in your ankles. Over the past few weeks, the fatigue has worsened, and you sometimes experience chest discomfort even when you're resting. Recently, you've fainted once while standing up quickly, and you've felt increasingly nauseous with occasional bloating after meals. You have a history of sarcoidosis and recent treatments for lymphoma, which you think might be related.Can you tell me if you experience any difficulty breathing or feeling more short of breath when lying down at night, or if you wake up suddenly feeling like you can't breathe, even if only sometimes?stoic_minimizer",
    "output": "THINKING: I guess I’ve been feeling some dizziness and a bit short of breath, especially when I lie down, but I don't want to make a big deal out of it. I've dealt with worse, I think, so I’m not sure if it’s s\nANSWER: Yeah, sometimes I do feel more short of breath when I lie down, but it’s not all the time, and I just figured it’s probably nothing, really.",
    "thinking": "I guess I’ve been feeling some dizziness and a bit short of breath, especially when I lie down, but I don't want to make a big deal out of it. I've dealt with worse, I think, so I’m not sure if it’s s",
    "answer": "Yeah, sometimes I do feel more short of breath when I lie down, but it’s not all the time, and I just figured it’s probably nothing, really.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 14,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  }
]