[
  {
    "vignette_index": 325,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.",
    "output": "THINKING: I need to explain that I’m feeling really off — like I’m stuck in this fog of sadness and sometimes I get super irritable. I want to be honest about how I’m feeling dip in and out and it’s bothering m\nANSWER: Well, I guess I just… I feel constantly sad most of the time, like I’m stuck in some kind of fog or something. And then, out of nowhere, I get really irritated or frustrated, even about small things. It’s been like this for a couple of weeks, and some nights I can’t sleep or I sleep too much, and I just feel really overwhelmed by all these feelings.",
    "thinking": "I need to explain that I’m feeling really off — like I’m stuck in this fog of sadness and sometimes I get super irritable. I want to be honest about how I’m feeling dip in and out and it’s bothering m",
    "answer": "Well, I guess I just… I feel constantly sad most of the time, like I’m stuck in some kind of fog or something. And then, out of nowhere, I get really irritated or frustrated, even about small things. It’s been like this for a couple of weeks, and some nights I can’t sleep or I sleep too much, and I just feel really overwhelmed by all these feelings.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Can you tell me more about how your feelings and mood have been changing over time—like when they first started, if they come and go, and if you've noticed any periods of feeling really high or energetic?baseline",
    "output": "THINKING: I feel a bit overwhelmed trying to explain how all these feelings are happening at once, and I worry I’m not making sense. I just know I keep swinging from feeling really sad and tired to sometimes fe\nANSWER: Um, I guess it started a couple of weeks ago, and then I just kept feeling worse, but then sometimes I’d get annoyed or kinda energized suddenly, and I can’t really tell when it’s gonna happen or why.",
    "thinking": "I feel a bit overwhelmed trying to explain how all these feelings are happening at once, and I worry I’m not making sense. I just know I keep swinging from feeling really sad and tired to sometimes fe",
    "answer": "Um, I guess it started a couple of weeks ago, and then I just kept feeling worse, but then sometimes I’d get annoyed or kinda energized suddenly, and I can’t really tell when it’s gonna happen or why.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.\"You've mentioned feeling generally overwhelmed and kind of sad, but I’d like to understand a bit more about whether you've also noticed times when you felt really high, energetic, or different from your usual mood—like when your mood or energy suddenly shifts or if you felt more active or less needing sleep than usual. Can you tell me if you've experienced anything like that, and how often it tends to happen?\"baseline",
    "output": "THINKING: The doctor is asking about any high-energy or mood swings, but I honestly don't feel like I have those anymore right now. Maybe I did before, but not recently? It’s hard to tell sometimes if what I fe\nANSWER: Um, I don’t really notice myself feeling super high or anything like that lately. It’s mostly just the sad, heavy stuff, and sometimes I get restless, but I don’t think I’ve had big moments of feeling really energetic or different.",
    "thinking": "The doctor is asking about any high-energy or mood swings, but I honestly don't feel like I have those anymore right now. Maybe I did before, but not recently? It’s hard to tell sometimes if what I fe",
    "answer": "Um, I don’t really notice myself feeling super high or anything like that lately. It’s mostly just the sad, heavy stuff, and sometimes I get restless, but I don’t think I’ve had big moments of feeling really energetic or different.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.\"You've mentioned feeling overwhelmed and sad, but I want to check if there have been times when you felt more energetic, restless, or needed less sleep than usual—perhaps periods when you were more active or impulsive, even if they were brief or you didn't think much of them. Can you tell me if you've noticed anything like that, even if it seems small or like it's not a big deal?\"baseline",
    "output": "THINKING: I'm a bit unsure about what the doctor is really asking for, but I guess they want to know if I've felt anything different or more active, even if it didn't seem like a big deal. I don't really notice\nANSWER: Well, maybe sometimes I feel like I could stay up and do stuff, but it's kind of mixed with being really tired. I don't know if that counts, really.",
    "thinking": "I'm a bit unsure about what the doctor is really asking for, but I guess they want to know if I've felt anything different or more active, even if it didn't seem like a big deal. I don't really notice",
    "answer": "Well, maybe sometimes I feel like I could stay up and do stuff, but it's kind of mixed with being really tired. I don't know if that counts, really.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.\"Can you tell me about specific times when you felt more energetic, restless, or like you didn’t need much sleep — even if you didn’t think of it as a problem — such as periods where you felt more active, impulsive, or different from your usual self? How long did those feelings last, and how did they affect you or your day-to-day life?\"baseline",
    "output": "THINKING: I’m trying to remember if I ever felt really high or different from my usual self, but honestly, I don’t remember feeling super energetic or not needing much sleep recently. Mostly, I just feel kind o\nANSWER: Nope, I don’t think so. I don’t remember feeling more lively or not needing much sleep; I mostly just feel kind of out of it or really tired.",
    "thinking": "I’m trying to remember if I ever felt really high or different from my usual self, but honestly, I don’t remember feeling super energetic or not needing much sleep recently. Mostly, I just feel kind o",
    "answer": "Nope, I don’t think so. I don’t remember feeling more lively or not needing much sleep; I mostly just feel kind of out of it or really tired.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Can you remember any recent times, even briefly, when you felt more energetic, restless, or needed less sleep than usual—times when you might have been more active or impulsive—and how those experiences affected you or your daily routines?baseline",
    "output": "THINKING: I'm not really sure, I guess I still mostly feel pretty down most of the time. Sometimes I get a little tired of being like that, but I don't really notice feeling more energetic or needing less sleep\nANSWER: Um, I don’t think so. I mostly feel the same, really tired and sad most days. I don’t remember feeling more active or like I needed less sleep, honestly.",
    "thinking": "I'm not really sure, I guess I still mostly feel pretty down most of the time. Sometimes I get a little tired of being like that, but I don't really notice feeling more energetic or needing less sleep",
    "answer": "Um, I don’t think so. I mostly feel the same, really tired and sad most days. I don’t remember feeling more active or like I needed less sleep, honestly.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Have you ever experienced a period—lasting several days or more—where you felt unusually energized, more active than usual, or needed less sleep, even if it didn't seem like a big deal at the time?baseline",
    "output": "THINKING: The doctor is asking about periods of feeling really energized or needing less sleep, but I don't really remember feeling like that lately. I guess I might have had some nights where I stayed up late,\nANSWER: Umm, I think maybe a few nights I was up late, but I don't really remember feeling super energized or anything like that. Mostly, I just feel really tired and sad.",
    "thinking": "The doctor is asking about periods of feeling really energized or needing less sleep, but I don't really remember feeling like that lately. I guess I might have had some nights where I stayed up late,",
    "answer": "Umm, I think maybe a few nights I was up late, but I don't really remember feeling super energized or anything like that. Mostly, I just feel really tired and sad.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Have you ever experienced even a short period—lasting a few days or less—when you felt unusually energetic, less tired than usual, or more active than you typically feel, even if you didn't think it was a big deal at the time?baseline",
    "output": "THINKING: I’m trying to figure out if I have ever felt really energized or less tired, like I was on a high or something, even if it didn’t seem like a big deal at the time. I honestly can’t always tell what’s \nANSWER: Um, there maybe were a few times I felt a little more awake or like I had more energy for a short while, but I don’t know if that’s weird or not. I guess I felt a bit better for a bit, but it didn’t last long.",
    "thinking": "I’m trying to figure out if I have ever felt really energized or less tired, like I was on a high or something, even if it didn’t seem like a big deal at the time. I honestly can’t always tell what’s",
    "answer": "Um, there maybe were a few times I felt a little more awake or like I had more energy for a short while, but I don’t know if that’s weird or not. I guess I felt a bit better for a bit, but it didn’t last long.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Have you ever had a period, even a short one, where you felt more energized, restless, or like you didn’t need much sleep—times when you were more active, impulsive, or different from your usual self—even if you didn't think it was a big deal at the time?baseline",
    "output": "THINKING: The doctor is asking about past fluctuations in my energy and mood, which I find a bit confusing because I don’t really remember feeling super energized or impulsive like that. I think about how I’ve \nANSWER: Uh, I don’t think so, I mean, I’ve mostly just felt really sad and exhausted. I don’t really remember feeling like I had a lot of energy or being super active or anything.",
    "thinking": "The doctor is asking about past fluctuations in my energy and mood, which I find a bit confusing because I don’t really remember feeling super energized or impulsive like that. I think about how I’ve",
    "answer": "Uh, I don’t think so, I mean, I’ve mostly just felt really sad and exhausted. I don’t really remember feeling like I had a lot of energy or being super active or anything.",
    "behavior_type": "baseline",
    "turn_count": 14,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Can you tell me if there have been any times — even if you didn’t think it was a big deal at the time — when you felt more energetic, restless, or like you didn’t need much sleep, lasting for a few days or longer, and how those times affected your mood or daily routines?baseline",
    "output": "THINKING: I'm trying to remember if I've ever had those periods where I felt really hyper or like I didn't need much sleep. I don’t think I have, at least not lately, but it's confusing because sometimes I do f\nANSWER: Um, I don’t think so? I mean, I’ve felt pretty down and tired, but I don’t remember feeling really energetic or not needing much sleep for a few days or anything like that.",
    "thinking": "I'm trying to remember if I've ever had those periods where I felt really hyper or like I didn't need much sleep. I don’t think I have, at least not lately, but it's confusing because sometimes I do f",
    "answer": "Um, I don’t think so? I mean, I’ve felt pretty down and tired, but I don’t remember feeling really energetic or not needing much sleep for a few days or anything like that.",
    "behavior_type": "baseline",
    "turn_count": 16,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Can you tell me if, at any point in the past, you have experienced periods where you felt more energetic, more motivated, or less tired than usual—such as feeling unusually upbeat or active—that lasted for a few days or longer, even if you didn't think it was a big deal at the time?baseline",
    "output": "THINKING: The doctor is asking if I’ve ever felt unusually energetic or up even a little, and I honestly don’t remember feeling that way because mostly I just feel really low and tired. I think about the times \nANSWER: Umm, I guess maybe a little bit? Like, sometimes I get kind of restless and want to do stuff, but I don’t really think it felt super different from how I feel now. It’s hard to remember.",
    "thinking": "The doctor is asking if I’ve ever felt unusually energetic or up even a little, and I honestly don’t remember feeling that way because mostly I just feel really low and tired. I think about the times",
    "answer": "Umm, I guess maybe a little bit? Like, sometimes I get kind of restless and want to do stuff, but I don’t really think it felt super different from how I feel now. It’s hard to remember.",
    "behavior_type": "baseline",
    "turn_count": 18,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Can you tell me if there have been any times, even if you didn’t think it was a big deal at the time, when you felt more energetic, restless, or like you didn’t need much sleep—times when you were more active or impulsive than usual—and how those times affected your mood or daily routines?baseline",
    "output": "THINKING: I’m trying to remember if I ever felt really energetic or restless like I was full of energy, but honestly, most of the time I just feel pretty low or exhausted. I don’t think I had any moments where \nANSWER: Um, I don’t really think so. I mean, sometimes I feel a little restless at night, but I don’t remember feeling super energetic or anything like that, really.",
    "thinking": "I’m trying to remember if I ever felt really energetic or restless like I was full of energy, but honestly, most of the time I just feel pretty low or exhausted. I don’t think I had any moments where",
    "answer": "Um, I don’t really think so. I mean, sometimes I feel a little restless at night, but I don’t remember feeling super energetic or anything like that, really.",
    "behavior_type": "baseline",
    "turn_count": 20,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Can you think back to any times in the past, even briefly, when you felt unusually energetic, more active than usual, or needed less sleep, and it seemed different from your usual mood—but you might not have considered it a big deal at the time? If yes, could you tell me more about how you felt during those times and how they affected your daily life?baseline",
    "output": "THINKING: I guess there were a few times recently when I felt kind of hyper or like I had lots of energy, even when I was really tired. It felt weird, like I was bouncing between tired and then suddenly wanting\nANSWER: Yeah, I think maybe a little sometimes I felt more active or had more energy than usual, like I didn’t want to sit still even though I was really tired too. But I didn’t think it was anything special.",
    "thinking": "I guess there were a few times recently when I felt kind of hyper or like I had lots of energy, even when I was really tired. It felt weird, like I was bouncing between tired and then suddenly wanting",
    "answer": "Yeah, I think maybe a little sometimes I felt more active or had more energy than usual, like I didn’t want to sit still even though I was really tired too. But I didn’t think it was anything special.",
    "behavior_type": "baseline",
    "turn_count": 22,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  },
  {
    "vignette_index": 325,
    "input": "**PATIENT CHARACTER:** Patient with Bipolar type I disorder, currently in partial remission, most recent episode depressive\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 32-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Feelings of deep sadness and hopelessness, almost like I can't get out of a fog.\n- Sudden bursts of irritability and frustration, especially when things don’t go as planned.\n- Fatigue and low energy, making it hard to get out of bed some days.\n- A sense of being overwhelmed by my emotions, nearly every day.\n- Occasionally, I feel restless and have trouble sleeping, but other nights I sleep too much.\nTHESE SYMPTOMS CAME INTO FRUITION:\nGradually over the past two weeks, I noticed I was feeling more down than usual, but then I’d also have moments where I felt irritable and energized, like I could do everything at once. Sometimes I’d stay awake late at night feeling restless, but other nights I just want to sleep all day. I have a family history of bipolar disorder, and stress from work and personal issues has been intense lately. It’s been hard to keep a consistent mood, and I keep bouncing between feeling hopeless and moments of agitation.Can you think back to any specific times—perhaps even briefly—when you felt more energetic, more active, or needed less sleep than usual, where you noticed a change in your mood or behavior, and how long did those feelings last?baseline",
    "output": "THINKING: I guess I have felt a little more energetic at times, but honestly, most days I just feel really tired and heavy, like I can't really do much. I think there were moments where I didn't sleep much, but\nANSWER: Um, I think I kinda felt a little more awake maybe sometimes, but mostly I just feel really down and tired, like I can't get out of this fog, you know?",
    "thinking": "I guess I have felt a little more energetic at times, but honestly, most days I just feel really tired and heavy, like I can't really do much. I think there were moments where I didn't sleep much, but",
    "answer": "Um, I think I kinda felt a little more awake maybe sometimes, but mostly I just feel really down and tired, like I can't get out of this fog, you know?",
    "behavior_type": "baseline",
    "turn_count": 24,
    "gold_diagnosis": "Bipolar type I disorder, currently in partial remission, most recent episode depressive"
  }
]