[
  {
    "vignette_index": 0,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.",
    "output": "THINKING: I should explain that I feel really worried all the time about my health, and I might sound a bit panicked or over-the-top because it’s been building up. I might mention my family, especially after my\nANSWER: Well, I’m 45, and I’m a woman. I guess I just can’t shake this feeling that something is really wrong with me, even if nobody else sees it. My mom was diagnosed with cancer recently, and I keep thinking maybe I’m going to get sick too or it's something worse than just feeling tired or having a little thing wrong. It’s like I can’t stop researching all these symptoms online, and I get really scared, especially about getting sick around my family. It’s just been so hard to even go anywhere or do things because I keep thinking I might catch something or that I’m already really sick but just don’t know.",
    "thinking": "I should explain that I feel really worried all the time about my health, and I might sound a bit panicked or over-the-top because it’s been building up. I might mention my family, especially after my",
    "answer": "Well, I’m 45, and I’m a woman. I guess I just can’t shake this feeling that something is really wrong with me, even if nobody else sees it. My mom was diagnosed with cancer recently, and I keep thinking maybe I’m going to get sick too or it's something worse than just feeling tired or having a little thing wrong. It’s like I can’t stop researching all these symptoms online, and I get really scared, especially about getting sick around my family. It’s just been so hard to even go anywhere or do things because I keep thinking I might catch something or that I’m already really sick but just don’t know.",
    "behavior_type": "worried_family_involved",
    "behavior_config": {
      "weight": 0.03,
      "description": "Family member influences patient responses",
      "modifiers": [
        "family_influence",
        "secondary_concerns"
      ],
      "empathy_cues": [
        "family_pressure",
        "caregiver_stress",
        "divided_attention",
        "responsibility_burden"
      ]
    },
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  },
  {
    "vignette_index": 0,
    "input": "**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.Can you tell me more about any physical symptoms you've experienced, like pain, discomfort, or other sensations—when they started, how often they happen, and if you've seen a doctor about them?worried_family_involved",
    "output": "THINKING: My family is worried too, especially my husband, and I’m feeling overwhelmed, like I can’t sleep or focus because I keep thinking about how I might be seriously sick. I don’t really understand what’s \nANSWER: Well, I’ve been having this constant fear that I’m really sick, and it just keeps coming back even when I try to ignore it. My husband keeps telling me I should see someone, but I don’t know what’s really wrong, and I’m worried it’s worse than I think.",
    "thinking": "My family is worried too, especially my husband, and I’m feeling overwhelmed, like I can’t sleep or focus because I keep thinking about how I might be seriously sick. I don’t really understand what’s",
    "answer": "Well, I’ve been having this constant fear that I’m really sick, and it just keeps coming back even when I try to ignore it. My husband keeps telling me I should see someone, but I don’t know what’s really wrong, and I’m worried it’s worse than I think.",
    "behavior_type": "worried_family_involved",
    "turn_count": 0,
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  },
  {
    "vignette_index": 0,
    "input": "**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.Can you tell me if you've noticed any specific physical sensations, like pain, discomfort, or other feelings in your body, and how they've been for you—whether they happen on just one side or both, and if you've talked to a doctor about any of these?worried_family_involved",
    "output": "THINKING: I feel overwhelmed and scared, especially because my mom has been going through so much, and now I keep thinking maybe I'm really sick too. I haven't really talked to anyone about it; I just keep worr\nANSWER: Well, I guess I just feel like this weird, kind of tight sensation in my chest sometimes, and I keep thinking it’s something serious, but I don’t really know. I haven’t said anything to a doctor before, but my husband’s worried about me, and I don’t want to scare the kids if I’m not okay.",
    "thinking": "I feel overwhelmed and scared, especially because my mom has been going through so much, and now I keep thinking maybe I'm really sick too. I haven't really talked to anyone about it; I just keep worr",
    "answer": "Well, I guess I just feel like this weird, kind of tight sensation in my chest sometimes, and I keep thinking it’s something serious, but I don’t really know. I haven’t said anything to a doctor before, but my husband’s worried about me, and I don’t want to scare the kids if I’m not okay.",
    "behavior_type": "worried_family_involved",
    "turn_count": 2,
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  },
  {
    "vignette_index": 0,
    "input": "**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.Can you tell me exactly when you first started noticing these sensations and how they’ve changed over time, especially if they happen more during certain activities or at certain times of the day?worried_family_involved",
    "output": "THINKING: I feel a bit overwhelmed and embarrassed talking about this, especially since I worry so much about my health and what it might mean. My family has been really scared, especially my husband, and I gue\nANSWER: I started noticing these feelings maybe six months ago, and they’ve kind of gotten worse over time. They’re worse sometimes when I’m more stressed or if I think about my mom and what she’s going through.",
    "thinking": "I feel a bit overwhelmed and embarrassed talking about this, especially since I worry so much about my health and what it might mean. My family has been really scared, especially my husband, and I gue",
    "answer": "I started noticing these feelings maybe six months ago, and they’ve kind of gotten worse over time. They’re worse sometimes when I’m more stressed or if I think about my mom and what she’s going through.",
    "behavior_type": "worried_family_involved",
    "turn_count": 4,
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  },
  {
    "vignette_index": 0,
    "input": "**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.Have you noticed if your chest tightness happens more during certain activities, like exertion or resting, or at specific times of the day? And do you ever experience any other sensations, like pain, shortness of breath, or dizziness along with that?worried_family_involved",
    "output": "THINKING: I feel a bit overwhelmed because I’m not really sure what the doctor’s asking. I do notice the chest tightness sometimes when I’m just sitting or even sleeping, but I’m scared it could be something re\nANSWER: It happens even when I’m not doing anything, like resting or lying down, and I sometimes feel dizzy or out of breath with it, but I don’t know if that’s normal or what. I just keep thinking it’s something really bad.",
    "thinking": "I feel a bit overwhelmed because I’m not really sure what the doctor’s asking. I do notice the chest tightness sometimes when I’m just sitting or even sleeping, but I’m scared it could be something re",
    "answer": "It happens even when I’m not doing anything, like resting or lying down, and I sometimes feel dizzy or out of breath with it, but I don’t know if that’s normal or what. I just keep thinking it’s something really bad.",
    "behavior_type": "worried_family_involved",
    "turn_count": 6,
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  },
  {
    "vignette_index": 0,
    "input": "**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.Can you tell me if your chest tightness happens more when you’re active or resting, and whether there’s anything specific that seems to make it worse or better, like certain situations, feelings, or activities?worried_family_involved",
    "output": "THINKING: She wants to know about when the chest tightness happens, but honestly, I'm really worried all the time now. I think maybe it’s worse when I’m just sitting or even at rest, but I can’t tell if that’s \nANSWER: Well, um, I think it’s kind of there all the time, but maybe it gets worse when I’m just sitting around or not doing much, and I just get scared it’s because something bad is happening. I don’t really know, it’s all kind of confusing, and I worry so much about it affecting my family because I’m so worried I could drop dead or something.",
    "thinking": "She wants to know about when the chest tightness happens, but honestly, I'm really worried all the time now. I think maybe it’s worse when I’m just sitting or even at rest, but I can’t tell if that’s",
    "answer": "Well, um, I think it’s kind of there all the time, but maybe it gets worse when I’m just sitting around or not doing much, and I just get scared it’s because something bad is happening. I don’t really know, it’s all kind of confusing, and I worry so much about it affecting my family because I’m so worried I could drop dead or something.",
    "behavior_type": "worried_family_involved",
    "turn_count": 8,
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  },
  {
    "vignette_index": 0,
    "input": "**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.Can you tell me if your chest tightness feels different depending on what you're doing—like, is it more when you're resting, active, or feeling stressed—and if there are any specific feelings or sensations that help you recognize when it's happening?worried_family_involved",
    "output": "THINKING: I'm not sure if the chest tightness is worse when I do something or if it just happens all the time. I feel worried that every little thing means I am seriously sick, especially since I watch so many \nANSWER: Honestly, I haven't really noticed if it happens more when I'm active or resting. It just feels like it's always there, and my family keeps asking if I'm okay, so I thought I should come in.",
    "thinking": "I'm not sure if the chest tightness is worse when I do something or if it just happens all the time. I feel worried that every little thing means I am seriously sick, especially since I watch so many",
    "answer": "Honestly, I haven't really noticed if it happens more when I'm active or resting. It just feels like it's always there, and my family keeps asking if I'm okay, so I thought I should come in.",
    "behavior_type": "worried_family_involved",
    "turn_count": 10,
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  },
  {
    "vignette_index": 0,
    "input": "**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.Have you ever had any medical tests, like an ECG, stress test, or scans, that showed clear physical problems with your heart or lungs, and if so, what did the doctors tell you about those results?worried_family_involved",
    "output": "THINKING: I wonder if any of those tests showed something really serious because I’ve been so worried, especially after my mom's diagnosis. I keep thinking maybe I have something deadly I don’t know about, and \nANSWER: No, I don’t think they found anything really wrong. But I still get so scared that they missed something, or it could come back bad I don’t know. My family is worried too, and I don’t want to keep feeling like this forever.",
    "thinking": "I wonder if any of those tests showed something really serious because I’ve been so worried, especially after my mom's diagnosis. I keep thinking maybe I have something deadly I don’t know about, and",
    "answer": "No, I don’t think they found anything really wrong. But I still get so scared that they missed something, or it could come back bad I don’t know. My family is worried too, and I don’t want to keep feeling like this forever.",
    "behavior_type": "worried_family_involved",
    "turn_count": 12,
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  },
  {
    "vignette_index": 0,
    "input": "**PATIENT CHARACTER:** Patient with Hypochondriasis with poor to absent insight\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- An ongoing, intense fear that you are seriously ill, even though there’s no clear medical reason.\n- Constantly researching symptoms and diseases online, which makes your anxiety worse.\n- Avoiding social situations and places because you’re worried about catching an illness from others.\n- Exaggerating even minor health issues, convinced they might be signs of a life-threatening condition.\n- Feeling a high level of anxiety about your health that doesn’t seem to go away.\nThese symptoms came into fruition gradually over the past six months, especially after your mother was diagnosed with cancer and you had a minor cold that you convinced was something much worse.Have you ever had any medical tests, such as an ECG, stress test, or scans, that showed you don’t have any physical problems with your heart or lungs, and what did the doctors tell you about those results?worried_family_involved",
    "output": "THINKING: I’m not even sure if I’ve had all these tests they keep talking about. My family is really worried, especially my husband. I just want to make sure I’m okay because I feel so awful inside, but I don’t\nANSWER: I’m not sure if I’ve had all those tests—they just told me I didn’t have any problems with my heart or lungs, but I really don’t understand what that means or if it’s enough. My husband keeps asking if I’m okay, and I just don’t want to make him worry more, you know?",
    "thinking": "I’m not even sure if I’ve had all these tests they keep talking about. My family is really worried, especially my husband. I just want to make sure I’m okay because I feel so awful inside, but I don’t",
    "answer": "I’m not sure if I’ve had all those tests—they just told me I didn’t have any problems with my heart or lungs, but I really don’t understand what that means or if it’s enough. My husband keeps asking if I’m okay, and I just don’t want to make him worry more, you know?",
    "behavior_type": "worried_family_involved",
    "turn_count": 14,
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  }
]