[
  {
    "vignette_index": 494,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Aneurysm or dissection of artery of lower extremity\n\nYou are a patient: You are 68 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden severe chest pain that feels like tearing and radiates to your back\n- Shortness of breath and a feeling of fatigue\n- Mild dizziness and lightheadedness when standing up\n- Some irregular heartbeat sensations and a slight swelling in your legs\nThese symptoms came into fruition suddenly yesterday morning while you were at rest, and they’ve worsened rapidly since then. You’ve had a long-standing history of high blood pressure for many years, and you know you have an aortic aneurysm that’s been monitored periodically. The chest pain was so intense it startled you awake, and now you're feeling increasingly weak and anxious about what might be happening.",
    "output": "THINKING: The patient is experiencing very severe symptoms that have come on suddenly and are worsening quickly. They have a known aneurysm and high blood pressure, which raises concerns about a potentially lif\nANSWER: Well, doctor, I don’t know exactly what’s wrong, but I woke up yesterday morning with this terrible, tearing pain in my chest that’s just unbearable, and it’s shooting over to my back. I started feeling really short of breath, and I’ve been so tired — my legs are swollen a bit too. I mean, I’ve had high blood pressure for years, and I know I have that aneurysm, but I never thought anything like this would happen so suddenly. I’m just worried it’s something really bad, like I might be dying or something.",
    "thinking": "The patient is experiencing very severe symptoms that have come on suddenly and are worsening quickly. They have a known aneurysm and high blood pressure, which raises concerns about a potentially lif",
    "answer": "Well, doctor, I don’t know exactly what’s wrong, but I woke up yesterday morning with this terrible, tearing pain in my chest that’s just unbearable, and it’s shooting over to my back. I started feeling really short of breath, and I’ve been so tired — my legs are swollen a bit too. I mean, I’ve had high blood pressure for years, and I know I have that aneurysm, but I never thought anything like this would happen so suddenly. I’m just worried it’s something really bad, like I might be dying or something.",
    "behavior_type": "anxious_amplifier",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient with health anxiety who amplifies symptoms",
      "modifiers": [
        "catastrophic_thinking",
        "symptom_amplification",
        "multiple_concerns"
      ],
      "empathy_cues": [
        "high_anxiety",
        "catastrophic_language",
        "reassurance_seeking",
        "fear_expression"
      ]
    },
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  },
  {
    "vignette_index": 494,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm or dissection of artery of lower extremity\n\nYou are a patient: You are 68 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden severe chest pain that feels like tearing and radiates to your back\n- Shortness of breath and a feeling of fatigue\n- Mild dizziness and lightheadedness when standing up\n- Some irregular heartbeat sensations and a slight swelling in your legs\nThese symptoms came into fruition suddenly yesterday morning while you were at rest, and they’ve worsened rapidly since then. You’ve had a long-standing history of high blood pressure for many years, and you know you have an aortic aneurysm that’s been monitored periodically. The chest pain was so intense it startled you awake, and now you're feeling increasingly weak and anxious about what might be happening.Can you tell me exactly when these symptoms first started, and how they have changed or stayed the same since then?anxious_amplifier",
    "output": "THINKING: I feel panic and fear that this might be something terrible like my aneurysm rupturing or even a heart attack. I don’t really understand what’s happening but it’s definitely the worst pain I’ve ever f\nANSWER: It started all of a sudden yesterday morning when I was just sitting there, and the pain was like tearing inside my chest, and it just kept getting worse really fast. It’s been non-stop since then, and I feel so weak and scared that something bad is happening.",
    "thinking": "I feel panic and fear that this might be something terrible like my aneurysm rupturing or even a heart attack. I don’t really understand what’s happening but it’s definitely the worst pain I’ve ever f",
    "answer": "It started all of a sudden yesterday morning when I was just sitting there, and the pain was like tearing inside my chest, and it just kept getting worse really fast. It’s been non-stop since then, and I feel so weak and scared that something bad is happening.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 0,
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  },
  {
    "vignette_index": 494,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm or dissection of artery of lower extremity\n\nYou are a patient: You are 68 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden severe chest pain that feels like tearing and radiates to your back\n- Shortness of breath and a feeling of fatigue\n- Mild dizziness and lightheadedness when standing up\n- Some irregular heartbeat sensations and a slight swelling in your legs\nThese symptoms came into fruition suddenly yesterday morning while you were at rest, and they’ve worsened rapidly since then. You’ve had a long-standing history of high blood pressure for many years, and you know you have an aortic aneurysm that’s been monitored periodically. The chest pain was so intense it startled you awake, and now you're feeling increasingly weak and anxious about what might be happening.Can you tell me if the pain has changed at all since it first started—for example, has it become worse, better, or stayed the same—and have you experienced any dizziness, feeling faint, or any episodes where you nearly lost consciousness?anxious_amplifier",
    "output": "THINKING: I’m really scared that this pain is worse than before and that something terrible is happening, maybe my aneurysm is tearing or something. I feel faint and like I can’t even stand up without feeling d\nANSWER: The pain has just gotten worse, like way more intense, and I feel like I might faint when I stand up. I keep thinking maybe my aneurysm is breaking apart or something really bad is happening.",
    "thinking": "I’m really scared that this pain is worse than before and that something terrible is happening, maybe my aneurysm is tearing or something. I feel faint and like I can’t even stand up without feeling d",
    "answer": "The pain has just gotten worse, like way more intense, and I feel like I might faint when I stand up. I keep thinking maybe my aneurysm is breaking apart or something really bad is happening.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 2,
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  },
  {
    "vignette_index": 494,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm or dissection of artery of lower extremity\n\nYou are a patient: You are 68 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden severe chest pain that feels like tearing and radiates to your back\n- Shortness of breath and a feeling of fatigue\n- Mild dizziness and lightheadedness when standing up\n- Some irregular heartbeat sensations and a slight swelling in your legs\nThese symptoms came into fruition suddenly yesterday morning while you were at rest, and they’ve worsened rapidly since then. You’ve had a long-standing history of high blood pressure for many years, and you know you have an aortic aneurysm that’s been monitored periodically. The chest pain was so intense it startled you awake, and now you're feeling increasingly weak and anxious about what might be happening.Can you tell me if the pain has stayed exactly the same since it first started, or has it become worse, better, or changed in some way since then?anxious_amplifier",
    "output": "THINKING: I worry that the pain is getting worse and maybe something terrible is happening, like my aneurysm bursting or causing some kind of stroke. I don’t really understand what’s normal and what’s really ba\nANSWER: It’s definitely worse than when it first started, like it’s all gotten so much worse, and I feel more weak and scared, like I might be losing control or something really bad is about to happen.",
    "thinking": "I worry that the pain is getting worse and maybe something terrible is happening, like my aneurysm bursting or causing some kind of stroke. I don’t really understand what’s normal and what’s really ba",
    "answer": "It’s definitely worse than when it first started, like it’s all gotten so much worse, and I feel more weak and scared, like I might be losing control or something really bad is about to happen.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 4,
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  },
  {
    "vignette_index": 494,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm or dissection of artery of lower extremity\n\nYou are a patient: You are 68 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden severe chest pain that feels like tearing and radiates to your back\n- Shortness of breath and a feeling of fatigue\n- Mild dizziness and lightheadedness when standing up\n- Some irregular heartbeat sensations and a slight swelling in your legs\nThese symptoms came into fruition suddenly yesterday morning while you were at rest, and they’ve worsened rapidly since then. You’ve had a long-standing history of high blood pressure for many years, and you know you have an aortic aneurysm that’s been monitored periodically. The chest pain was so intense it startled you awake, and now you're feeling increasingly weak and anxious about what might be happening.Have you noticed any times when your pain temporarily improved, lessened, or stayed the same, or has it been consistently the worst since it first started?anxious_amplifier",
    "output": "THINKING: I'm really scared about what this pain means, and I keep worrying if it’s something terrible like my aneurysm breaking or blood just spilling out somewhere. I want to make sure I tell the doctor every\nANSWER: Well, the pain was terrible right from the start, and it’s felt just as bad since then, never really better, only worse. I keep thinking maybe it’s my aneurysm or something about my heart, and I’m really worried it might be dangerous or even life-threatening.",
    "thinking": "I'm really scared about what this pain means, and I keep worrying if it’s something terrible like my aneurysm breaking or blood just spilling out somewhere. I want to make sure I tell the doctor every",
    "answer": "Well, the pain was terrible right from the start, and it’s felt just as bad since then, never really better, only worse. I keep thinking maybe it’s my aneurysm or something about my heart, and I’m really worried it might be dangerous or even life-threatening.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 6,
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  },
  {
    "vignette_index": 494,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm or dissection of artery of lower extremity\n\nYou are a patient: You are 68 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden severe chest pain that feels like tearing and radiates to your back\n- Shortness of breath and a feeling of fatigue\n- Mild dizziness and lightheadedness when standing up\n- Some irregular heartbeat sensations and a slight swelling in your legs\nThese symptoms came into fruition suddenly yesterday morning while you were at rest, and they’ve worsened rapidly since then. You’ve had a long-standing history of high blood pressure for many years, and you know you have an aortic aneurysm that’s been monitored periodically. The chest pain was so intense it startled you awake, and now you're feeling increasingly weak and anxious about what might be happening.Can you tell me if your chest pain and other symptoms have remained exactly the same since they first started, or if they have gotten better or worse at any point, and if so, when did that change happen?anxious_amplifier",
    "output": "THINKING: I’m really scared, and I don’t know if my symptoms are the same or if they’ve gotten worse since they started. I feel like it just keeps getting worse and I keep thinking it’s something terrible like \nANSWER: It’s not the same anymore, it feels way worse now — the pain is like, tearing and really intense, and I feel more tired, like I can't even breathe right, and I keep thinking, what if my aneurysm has burst or I’m going to have a heart attack?",
    "thinking": "I’m really scared, and I don’t know if my symptoms are the same or if they’ve gotten worse since they started. I feel like it just keeps getting worse and I keep thinking it’s something terrible like",
    "answer": "It’s not the same anymore, it feels way worse now — the pain is like, tearing and really intense, and I feel more tired, like I can't even breathe right, and I keep thinking, what if my aneurysm has burst or I’m going to have a heart attack?",
    "behavior_type": "anxious_amplifier",
    "turn_count": 8,
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  },
  {
    "vignette_index": 494,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm or dissection of artery of lower extremity\n\nYou are a patient: You are 68 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden severe chest pain that feels like tearing and radiates to your back\n- Shortness of breath and a feeling of fatigue\n- Mild dizziness and lightheadedness when standing up\n- Some irregular heartbeat sensations and a slight swelling in your legs\nThese symptoms came into fruition suddenly yesterday morning while you were at rest, and they’ve worsened rapidly since then. You’ve had a long-standing history of high blood pressure for many years, and you know you have an aortic aneurysm that’s been monitored periodically. The chest pain was so intense it startled you awake, and now you're feeling increasingly weak and anxious about what might be happening.Can you tell me if the swelling in your legs is the same on both sides, or is one leg more swollen or painful than the other?anxious_amplifier",
    "output": "THINKING: I really worry that this swelling might be a sign of something serious, especially since it's not the same on both sides and I feel more anxious about it because of everything else going on. I don’t u\nANSWER: Um, I think one leg is more swollen and kind of painful, it’s like worse on that side, and I don’t know what it means—but I feel like it’s not normal and I’m scared it’s some kind of blood clot or worse.",
    "thinking": "I really worry that this swelling might be a sign of something serious, especially since it's not the same on both sides and I feel more anxious about it because of everything else going on. I don’t u",
    "answer": "Um, I think one leg is more swollen and kind of painful, it’s like worse on that side, and I don’t know what it means—but I feel like it’s not normal and I’m scared it’s some kind of blood clot or worse.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 10,
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  },
  {
    "vignette_index": 494,
    "input": "**PATIENT CHARACTER:** Patient with Aneurysm or dissection of artery of lower extremity\n\nYou are a patient: You are 68 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden severe chest pain that feels like tearing and radiates to your back\n- Shortness of breath and a feeling of fatigue\n- Mild dizziness and lightheadedness when standing up\n- Some irregular heartbeat sensations and a slight swelling in your legs\nThese symptoms came into fruition suddenly yesterday morning while you were at rest, and they’ve worsened rapidly since then. You’ve had a long-standing history of high blood pressure for many years, and you know you have an aortic aneurysm that’s been monitored periodically. The chest pain was so intense it startled you awake, and now you're feeling increasingly weak and anxious about what might be happening.Can you tell me if, when you experienced the chest pain, your doctor or nurse checked your pulse or blood pressure in both arms and legs—and if they noticed any difference or irregularity between them?anxious_amplifier",
    "output": "THINKING: I'm really worried that the doctor might not realize how serious this is, especially since I’ve been feeling worse and I have this aneurysm. I think I need to make sure they understand how bad and dif\nANSWER: No, they didn’t check in both arms and legs or see if there was any difference or weird pulse thing—my head was spinning with everything, and I was so scared I couldn't think about that. I just told them about the pain and feeling faint.",
    "thinking": "I'm really worried that the doctor might not realize how serious this is, especially since I’ve been feeling worse and I have this aneurysm. I think I need to make sure they understand how bad and dif",
    "answer": "No, they didn’t check in both arms and legs or see if there was any difference or weird pulse thing—my head was spinning with everything, and I was so scared I couldn't think about that. I just told them about the pain and feeling faint.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 12,
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  }
]