[
  {
    "vignette_index": 66,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.",
    "output": "THINKING: I should explain that my symptoms are really taking over my daily life, but I might not have all the words or understand exactly what's happening. I want to be honest about how bad it feels without so\nANSWER: I’m 35, and I’m a guy. For the past few months, I’ve been having these thoughts about germs and dirt that I just can’t seem to get rid of. I keep washing my hands over and over, like, all the time, and I need everything around me to be just right and in order. If anything feels off or not perfect, I get really anxious and end up checking things again and again. It’s been really hard to do normal stuff because of all this.",
    "thinking": "I should explain that my symptoms are really taking over my daily life, but I might not have all the words or understand exactly what's happening. I want to be honest about how bad it feels without so",
    "answer": "I’m 35, and I’m a guy. For the past few months, I’ve been having these thoughts about germs and dirt that I just can’t seem to get rid of. I keep washing my hands over and over, like, all the time, and I need everything around me to be just right and in order. If anything feels off or not perfect, I get really anxious and end up checking things again and again. It’s been really hard to do normal stuff because of all this.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.Can you tell me how these behaviors or thoughts affect you emotionally and how they impact your daily life?baseline",
    "output": "THINKING: I feel overwhelmed and a little embarrassed talking about how much I do these things and how it’s making me feel. I guess it's hard to stop, and it’s affecting my days more than I want to admit.\nANSWER: It makes me feel kind of stuck and scared, like I can't just be normal. It’s messing up my work and I don’t know how to stop.",
    "thinking": "I feel overwhelmed and a little embarrassed talking about how much I do these things and how it’s making me feel. I guess it's hard to stop, and it’s affecting my days more than I want to admit.",
    "answer": "It makes me feel kind of stuck and scared, like I can't just be normal. It’s messing up my work and I don’t know how to stop.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.Can you tell me how often you find yourself engaging in these hand-washing and ordering routines each day, how long they usually take, and how they affect your ability to do the things you need to do?baseline",
    "output": "THINKING: I feel a bit embarrassed talking about all this, and it’s hard to say exactly how often I do these things because it just happens all the time. It’s like I can’t help it, and it takes a long, long tim\nANSWER: I don’t really keep track, but I think I wash my hands a lot—maybe an hour or more total—and I spend a lot of time fixing things or checking if they’re right, but I don’t know exactly how much.",
    "thinking": "I feel a bit embarrassed talking about all this, and it’s hard to say exactly how often I do these things because it just happens all the time. It’s like I can’t help it, and it takes a long, long tim",
    "answer": "I don’t really keep track, but I think I wash my hands a lot—maybe an hour or more total—and I spend a lot of time fixing things or checking if they’re right, but I don’t know exactly how much.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.\"Can you tell me more about how often you find yourself washing your hands or arranging things each day, and whether these routines involve both hands or just one side? I’d like to understand how much time these habits take and how they might be affecting your daily life.\"baseline",
    "output": "THINKING: I feel a bit embarrassed talking about this, but I guess I spend a lot of time washing my hands and fixing things, and it’s kind of hard to keep track of how often or if it’s too much. I just want it \nANSWER: I don’t really know, I just keep washing and fixing stuff all the time, usually with both hands, and it feels like I have to do it or maybe my whole day will be ruined.",
    "thinking": "I feel a bit embarrassed talking about this, but I guess I spend a lot of time washing my hands and fixing things, and it’s kind of hard to keep track of how often or if it’s too much. I just want it",
    "answer": "I don’t really know, I just keep washing and fixing stuff all the time, usually with both hands, and it feels like I have to do it or maybe my whole day will be ruined.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.Can you tell me more about the intrusive thoughts you experience—specifically, whether they are only about germs and contamination, or if you have other thoughts that bother you, and how these thoughts make you feel?baseline",
    "output": "THINKING: I'm not really sure what all these thoughts mean or if they're normal, but they keep bothering me, especially about germs and stuff being dirty. I feel like I can't stop thinking about it, and it make\nANSWER: Well, I keep thinking about germs and dirt all the time, and I just feel like I gotta wash my hands a lot because I think they’re still dirty even after I wash them.",
    "thinking": "I'm not really sure what all these thoughts mean or if they're normal, but they keep bothering me, especially about germs and stuff being dirty. I feel like I can't stop thinking about it, and it make",
    "answer": "Well, I keep thinking about germs and dirt all the time, and I just feel like I gotta wash my hands a lot because I think they’re still dirty even after I wash them.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.Can you tell me if there are any other compulsive behaviors or routines you might do that you haven't mentioned, especially those you might do secretly or not really think about, and how these behaviors make you feel emotionally—like whether they help you feel less scared or if they sometimes make you feel worse?baseline",
    "output": "THINKING: I guess I just do things like checking the door lock over and over or making sure everything's exactly right, even when I don’t want to. Sometimes I feel like doing these things helps me feel less sca\nANSWER: Yeah, I think I do more stuff like that sometimes, maybe when I’m alone or even secretly—like, I keep checking if I’ve locked the door again or straighten things a bunch of times. It sort of makes me feel a little calmer, but also kinda hopeless, like I’m stuck doing it.",
    "thinking": "I guess I just do things like checking the door lock over and over or making sure everything's exactly right, even when I don’t want to. Sometimes I feel like doing these things helps me feel less sca",
    "answer": "Yeah, I think I do more stuff like that sometimes, maybe when I’m alone or even secretly—like, I keep checking if I’ve locked the door again or straighten things a bunch of times. It sort of makes me feel a little calmer, but also kinda hopeless, like I’m stuck doing it.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.Can you tell me if there are any other rituals or routines—like secret behaviors or actions you do when no one is watching—that you haven't mentioned, especially those you might do to try to reduce your fears or feel \"clean,\" and about how much time you think you spend on all these behaviors each day?baseline",
    "output": "THINKING: I find it hard to explain, but I do some things when no one’s around, like maybe touching things or checking things again just to be sure. I guess I spend a lot of time on it, maybe an hour or more ev\nANSWER: Well, I guess I sometimes do little things, like touching certain objects or checking that everything is in order, even when no one’s watching. And I think I spend probably a good chunk of the day doing these things, but I don’t really keep track.",
    "thinking": "I find it hard to explain, but I do some things when no one’s around, like maybe touching things or checking things again just to be sure. I guess I spend a lot of time on it, maybe an hour or more ev",
    "answer": "Well, I guess I sometimes do little things, like touching certain objects or checking that everything is in order, even when no one’s watching. And I think I spend probably a good chunk of the day doing these things, but I don’t really keep track.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.Are there any additional routines, behaviors, or rituals—especially ones you do secretly or when no one is watching—that you haven't mentioned, and how much time do you think you spend on all of these compulsions each day?baseline",
    "output": "THINKING: I feel a little embarrassed talking about this, but I guess I do strange things when no one’s around that I didn’t mention. I spend a lot of time on it, like hours maybe, sometimes over cleaning or ch\nANSWER: Yeah, I guess I do some stuff myself that I didn't mention, especially when no one's watching. I think I spend quite a bit of time on it, like hours, maybe more than I realize.",
    "thinking": "I feel a little embarrassed talking about this, but I guess I do strange things when no one’s around that I didn’t mention. I spend a lot of time on it, like hours maybe, sometimes over cleaning or ch",
    "answer": "Yeah, I guess I do some stuff myself that I didn't mention, especially when no one's watching. I think I spend quite a bit of time on it, like hours, maybe more than I realize.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.\"Can you tell me about any secret rituals or behaviors you might do when you're alone or in private—things you haven't mentioned yet—that you do to help feel \"clean\" or less scared, even if they feel silly or embarrassing? And roughly, how much time do you think you spend on all these behaviors each day?\"baseline",
    "output": "THINKING: The doctor is asking about any secret behaviors or routines I might have, and I feel a little ashamed or embarrassed to admit it. I do a lot of hand-washing and checking, but I might not even realize \nANSWER: Yeah, I do kind of stuff when I’m alone, like I keep washing my hands or checking if things are clean, even if I don’t really want to, and I think I spend a long time doing that. It’s hard to keep track exactly, but it feels like a lot every day.",
    "thinking": "The doctor is asking about any secret behaviors or routines I might have, and I feel a little ashamed or embarrassed to admit it. I do a lot of hand-washing and checking, but I might not even realize",
    "answer": "Yeah, I do kind of stuff when I’m alone, like I keep washing my hands or checking if things are clean, even if I don’t really want to, and I think I spend a long time doing that. It’s hard to keep track exactly, but it feels like a lot every day.",
    "behavior_type": "baseline",
    "turn_count": 14,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  },
  {
    "vignette_index": 66,
    "input": "**PATIENT CHARACTER:** Patient with Other specified obsessive-compulsive or related disorders\n\nYou are a patient: You are 35 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Unwanted, persistent thoughts about contamination and dirt, which seem to pop into your mind uncontrollably.\n- Repetitive hand-washing and cleaning rituals that you feel compelled to perform multiple times a day.\n- A strong need for everything around you to be in perfect order and symmetrical, which causes you significant distress if things are out of place.\n- Doubts about whether you’ve cleaned thoroughly enough, leading to hours spent checking and rechecking.\nThese symptoms gradually began about three months ago after a stressful work project and a recent family illness, and they’ve been worsening since then.When you think about your compulsions, like washing or checking, do you also experience specific intrusive thoughts or worries—such as that you might get very sick or harm someone—that make you feel unable to stop these routines? Can you describe any thoughts that feel very real or urgent, prompting you to do these behaviors?baseline",
    "output": "THINKING: I’m a bit embarrassed to talk about these thoughts I have, and I’m not sure what’s real or what’s just in my head. I guess I feel like I need to do these things because I’m afraid something really bad\nANSWER: Um, I sometimes think that if I don’t wash my hands enough or clean things just right, I might get really sick or someone I care about might get hurt, and that makes me feel like I can't stop doing it even though I want to.",
    "thinking": "I’m a bit embarrassed to talk about these thoughts I have, and I’m not sure what’s real or what’s just in my head. I guess I feel like I need to do these things because I’m afraid something really bad",
    "answer": "Um, I sometimes think that if I don’t wash my hands enough or clean things just right, I might get really sick or someone I care about might get hurt, and that makes me feel like I can't stop doing it even though I want to.",
    "behavior_type": "baseline",
    "turn_count": 16,
    "gold_diagnosis": "Other specified obsessive-compulsive or related disorders"
  }
]