[
  {
    "vignette_index": 180,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Cerebral ischaemic stroke due to paradoxical embolism\n\nYou are a patient: You are 52 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden weakness on the right side of your body\n- Chest pain that comes and goes\n- A severe headache that feels like a migraine\n- Coldness in your left hand\n- Brief episodes of abdominal pain and nausea\nThese symptoms came into fruition suddenly yesterday afternoon, starting with the chest pain and headache, followed quickly by weakness on your right side and cold extremities.\nYou have a history of migraines and recently noticed some swelling and tenderness in your left calf, which you ignored at first.\nYou're worried because your symptoms seem serious, especially the weakness and chest pain, and you're concerned about your heart and brain health.\nYou’re feeling anxious and a bit frightened, but trying to stay calm as you seek medical help.",
    "output": "THINKING: The patient has multiple symptoms that seem sudden and serious, especially the weakness, chest pain, and headache. They might be worried about a stroke or another major issue, and their anxiety is sho\nANSWER: I’m 52, and I’ve been feeling really weird since yesterday afternoon. I started with this sharp chest pain and a pounding headache that wouldn’t go away. Then, out of nowhere, I felt weak on the right side of my body, and my left hand felt cold. I also noticed some pain in my stomach area, and I’ve had nausea too. It’s all happened so fast, and honestly, I’m kind of scared about what’s going on.",
    "thinking": "The patient has multiple symptoms that seem sudden and serious, especially the weakness, chest pain, and headache. They might be worried about a stroke or another major issue, and their anxiety is sho",
    "answer": "I’m 52, and I’ve been feeling really weird since yesterday afternoon. I started with this sharp chest pain and a pounding headache that wouldn’t go away. Then, out of nowhere, I felt weak on the right side of my body, and my left hand felt cold. I also noticed some pain in my stomach area, and I’ve had nausea too. It’s all happened so fast, and honestly, I’m kind of scared about what’s going on.",
    "behavior_type": "information_withholder",
    "behavior_config": {
      "weight": 0.15,
      "description": "Patient initially omits embarrassing or stigmatized symptoms",
      "modifiers": [
        "embarrassed_symptoms",
        "gradual_revelation"
      ],
      "empathy_cues": [
        "hesitation",
        "vague_responses",
        "embarrassment",
        "trust_building_needed"
      ]
    },
    "gold_diagnosis": "Cerebral ischaemic stroke due to paradoxical embolism"
  },
  {
    "vignette_index": 180,
    "input": "**PATIENT CHARACTER:** Patient with Cerebral ischaemic stroke due to paradoxical embolism\n\nYou are a patient: You are 52 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden weakness on the right side of your body\n- Chest pain that comes and goes\n- A severe headache that feels like a migraine\n- Coldness in your left hand\n- Brief episodes of abdominal pain and nausea\nThese symptoms came into fruition suddenly yesterday afternoon, starting with the chest pain and headache, followed quickly by weakness on your right side and cold extremities.\nYou have a history of migraines and recently noticed some swelling and tenderness in your left calf, which you ignored at first.\nYou're worried because your symptoms seem serious, especially the weakness and chest pain, and you're concerned about your heart and brain health.\nYou’re feeling anxious and a bit frightened, but trying to stay calm as you seek medical help.Can you tell me more about how your symptoms have been since they started—have they stayed the same, gotten worse, or maybe even gone away at times?information_withholder",
    "output": "THINKING: I'm worried because my symptoms started suddenly and are confusing. I don't really remember everything clearly, but I know I feel worse sometimes and the pain comes back. I hope the doctor understands\nANSWER: Umm, I guess it’s been kinda all over the place. Sometimes it feels a little less, but then others, it comes back worse. I don’t really know.",
    "thinking": "I'm worried because my symptoms started suddenly and are confusing. I don't really remember everything clearly, but I know I feel worse sometimes and the pain comes back. I hope the doctor understands",
    "answer": "Umm, I guess it’s been kinda all over the place. Sometimes it feels a little less, but then others, it comes back worse. I don’t really know.",
    "behavior_type": "information_withholder",
    "turn_count": 0,
    "gold_diagnosis": "Cerebral ischaemic stroke due to paradoxical embolism"
  },
  {
    "vignette_index": 180,
    "input": "**PATIENT CHARACTER:** Patient with Cerebral ischaemic stroke due to paradoxical embolism\n\nYou are a patient: You are 52 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden weakness on the right side of your body\n- Chest pain that comes and goes\n- A severe headache that feels like a migraine\n- Coldness in your left hand\n- Brief episodes of abdominal pain and nausea\nThese symptoms came into fruition suddenly yesterday afternoon, starting with the chest pain and headache, followed quickly by weakness on your right side and cold extremities.\nYou have a history of migraines and recently noticed some swelling and tenderness in your left calf, which you ignored at first.\nYou're worried because your symptoms seem serious, especially the weakness and chest pain, and you're concerned about your heart and brain health.\nYou’re feeling anxious and a bit frightened, but trying to stay calm as you seek medical help.\"Can you tell me more about how your symptoms have been over the past day—are they always there, or do they come and go? And do you notice any other changes, like your speech, vision, or coordination?\"information_withholder",
    "output": "THINKING: I feel nervous explaining my symptoms because I don’t fully understand what’s happening. I want to be clear but also don’t want to alarm the doctor too much. I’m trying to focus on what I can remember\nANSWER: Mostly, the weakness on my right side is there most of the time now, but the pain and headache come and go. I haven’t noticed any change in my speech or vision, but I feel really weird and kind of scared.",
    "thinking": "I feel nervous explaining my symptoms because I don’t fully understand what’s happening. I want to be clear but also don’t want to alarm the doctor too much. I’m trying to focus on what I can remember",
    "answer": "Mostly, the weakness on my right side is there most of the time now, but the pain and headache come and go. I haven’t noticed any change in my speech or vision, but I feel really weird and kind of scared.",
    "behavior_type": "information_withholder",
    "turn_count": 2,
    "gold_diagnosis": "Cerebral ischaemic stroke due to paradoxical embolism"
  },
  {
    "vignette_index": 180,
    "input": "**PATIENT CHARACTER:** Patient with Cerebral ischaemic stroke due to paradoxical embolism\n\nYou are a patient: You are 52 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden weakness on the right side of your body\n- Chest pain that comes and goes\n- A severe headache that feels like a migraine\n- Coldness in your left hand\n- Brief episodes of abdominal pain and nausea\nThese symptoms came into fruition suddenly yesterday afternoon, starting with the chest pain and headache, followed quickly by weakness on your right side and cold extremities.\nYou have a history of migraines and recently noticed some swelling and tenderness in your left calf, which you ignored at first.\nYou're worried because your symptoms seem serious, especially the weakness and chest pain, and you're concerned about your heart and brain health.\nYou’re feeling anxious and a bit frightened, but trying to stay calm as you seek medical help.Can you tell me if your weakness and other symptoms have been the same since they started, or have they been coming and going? And when was the last time you felt completely okay?information_withholder",
    "output": "THINKING: I want to answer honestly, but I also feel nervous about what the doctor might think or ask next. I think I should tell the truth about how the symptoms are changing but keep it simple because I don’t\nANSWER: They’ve sort of been coming and going, I guess. The weakness was worse at first, but now it’s a little better sometimes. I don’t really remember the last time I felt completely okay.",
    "thinking": "I want to answer honestly, but I also feel nervous about what the doctor might think or ask next. I think I should tell the truth about how the symptoms are changing but keep it simple because I don’t",
    "answer": "They’ve sort of been coming and going, I guess. The weakness was worse at first, but now it’s a little better sometimes. I don’t really remember the last time I felt completely okay.",
    "behavior_type": "information_withholder",
    "turn_count": 4,
    "gold_diagnosis": "Cerebral ischaemic stroke due to paradoxical embolism"
  },
  {
    "vignette_index": 180,
    "input": "**PATIENT CHARACTER:** Patient with Cerebral ischaemic stroke due to paradoxical embolism\n\nYou are a patient: You are 52 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden weakness on the right side of your body\n- Chest pain that comes and goes\n- A severe headache that feels like a migraine\n- Coldness in your left hand\n- Brief episodes of abdominal pain and nausea\nThese symptoms came into fruition suddenly yesterday afternoon, starting with the chest pain and headache, followed quickly by weakness on your right side and cold extremities.\nYou have a history of migraines and recently noticed some swelling and tenderness in your left calf, which you ignored at first.\nYou're worried because your symptoms seem serious, especially the weakness and chest pain, and you're concerned about your heart and brain health.\nYou’re feeling anxious and a bit frightened, but trying to stay calm as you seek medical help.\"Can you tell me if you've noticed any changes in your speech, vision, or how you feel when you try to move your arm or leg, even if they seemed to come and go or felt a little different?\"information_withholder",
    "output": "THINKING: I'm really scared about what’s happening, especially the weakness and the chest pain. I don't understand all the questions but I want to answer honestly without sounding stupid or making things worse.\nANSWER: Um, I think I feel a bit different when I try to move my arm and leg, and my vision is kind of blurry sometimes, I guess. It's all just really sudden and confusing.",
    "thinking": "I'm really scared about what’s happening, especially the weakness and the chest pain. I don't understand all the questions but I want to answer honestly without sounding stupid or making things worse.",
    "answer": "Um, I think I feel a bit different when I try to move my arm and leg, and my vision is kind of blurry sometimes, I guess. It's all just really sudden and confusing.",
    "behavior_type": "information_withholder",
    "turn_count": 6,
    "gold_diagnosis": "Cerebral ischaemic stroke due to paradoxical embolism"
  },
  {
    "vignette_index": 180,
    "input": "**PATIENT CHARACTER:** Patient with Cerebral ischaemic stroke due to paradoxical embolism\n\nYou are a patient: You are 52 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden weakness on the right side of your body\n- Chest pain that comes and goes\n- A severe headache that feels like a migraine\n- Coldness in your left hand\n- Brief episodes of abdominal pain and nausea\nThese symptoms came into fruition suddenly yesterday afternoon, starting with the chest pain and headache, followed quickly by weakness on your right side and cold extremities.\nYou have a history of migraines and recently noticed some swelling and tenderness in your left calf, which you ignored at first.\nYou're worried because your symptoms seem serious, especially the weakness and chest pain, and you're concerned about your heart and brain health.\nYou’re feeling anxious and a bit frightened, but trying to stay calm as you seek medical help.Can you tell me exactly how the symptoms have changed or stayed the same hour by hour or day by day since they started — for example, when did you first notice the weakness or vision changes, and how have they been since then?information_withholder",
    "output": "THINKING: I'm feeling really scared about all these symptoms coming on so suddenly. I'm not sure how they all relate or if they're getting worse, but I know I need to tell the doctor something.\nANSWER: It all started yesterday afternoon with the chest pain and that really bad headache, and then the weakness on my right side and the cold feeling in my hand came pretty soon after, but I'm not sure exactly how it changed day by day.",
    "thinking": "I'm feeling really scared about all these symptoms coming on so suddenly. I'm not sure how they all relate or if they're getting worse, but I know I need to tell the doctor something.",
    "answer": "It all started yesterday afternoon with the chest pain and that really bad headache, and then the weakness on my right side and the cold feeling in my hand came pretty soon after, but I'm not sure exactly how it changed day by day.",
    "behavior_type": "information_withholder",
    "turn_count": 8,
    "gold_diagnosis": "Cerebral ischaemic stroke due to paradoxical embolism"
  },
  {
    "vignette_index": 180,
    "input": "**PATIENT CHARACTER:** Patient with Cerebral ischaemic stroke due to paradoxical embolism\n\nYou are a patient: You are 52 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden weakness on the right side of your body\n- Chest pain that comes and goes\n- A severe headache that feels like a migraine\n- Coldness in your left hand\n- Brief episodes of abdominal pain and nausea\nThese symptoms came into fruition suddenly yesterday afternoon, starting with the chest pain and headache, followed quickly by weakness on your right side and cold extremities.\nYou have a history of migraines and recently noticed some swelling and tenderness in your left calf, which you ignored at first.\nYou're worried because your symptoms seem serious, especially the weakness and chest pain, and you're concerned about your heart and brain health.\nYou’re feeling anxious and a bit frightened, but trying to stay calm as you seek medical help.Could you tell me step-by-step exactly when your symptoms first started yesterday and how they've changed or stayed the same since then?information_withholder",
    "output": "THINKING: I'm a bit overwhelmed and unsure about how serious everything is. I want to give the doctor some details but I feel nervous to go into too much depth about everything right away. Maybe if I start with\nANSWER: Well, it all kind of started yesterday afternoon. I began with the chest pain, and then I got this really bad headache, like a migraine I’ve had before but worse. Soon after, I noticed my right side feeling weak, and my left hand was cold. I also had a few times where my stomach hurt and I felt sick, but I’m not sure how long all that lasted exactly.",
    "thinking": "I'm a bit overwhelmed and unsure about how serious everything is. I want to give the doctor some details but I feel nervous to go into too much depth about everything right away. Maybe if I start with",
    "answer": "Well, it all kind of started yesterday afternoon. I began with the chest pain, and then I got this really bad headache, like a migraine I’ve had before but worse. Soon after, I noticed my right side feeling weak, and my left hand was cold. I also had a few times where my stomach hurt and I felt sick, but I’m not sure how long all that lasted exactly.",
    "behavior_type": "information_withholder",
    "turn_count": 10,
    "gold_diagnosis": "Cerebral ischaemic stroke due to paradoxical embolism"
  },
  {
    "vignette_index": 180,
    "input": "**PATIENT CHARACTER:** Patient with Cerebral ischaemic stroke due to paradoxical embolism\n\nYou are a patient: You are 52 years old and your biological gender is male.\nYou are experiencing the following symptoms:\n- Sudden weakness on the right side of your body\n- Chest pain that comes and goes\n- A severe headache that feels like a migraine\n- Coldness in your left hand\n- Brief episodes of abdominal pain and nausea\nThese symptoms came into fruition suddenly yesterday afternoon, starting with the chest pain and headache, followed quickly by weakness on your right side and cold extremities.\nYou have a history of migraines and recently noticed some swelling and tenderness in your left calf, which you ignored at first.\nYou're worried because your symptoms seem serious, especially the weakness and chest pain, and you're concerned about your heart and brain health.\nYou’re feeling anxious and a bit frightened, but trying to stay calm as you seek medical help.Can you tell me, step by step, exactly when your symptoms first started yesterday and how they’ve changed or stayed the same since then, including whether they’ve been consistent or come and go?information_withholder",
    "output": "THINKING: I want to explain what happened, but I’m feeling pretty overwhelmed and worried. I’ve been experiencing a lot all at once and I don’t want to forget anything important, but it’s hard to focus on the t\nANSWER: It all started yesterday afternoon, I think. I remember the chest pain first, and then the headache, and pretty soon after that, I started feeling weak on my right side and colder in my hand. It kind of came and went, the pain and the weakness.",
    "thinking": "I want to explain what happened, but I’m feeling pretty overwhelmed and worried. I’ve been experiencing a lot all at once and I don’t want to forget anything important, but it’s hard to focus on the t",
    "answer": "It all started yesterday afternoon, I think. I remember the chest pain first, and then the headache, and pretty soon after that, I started feeling weak on my right side and colder in my hand. It kind of came and went, the pain and the weakness.",
    "behavior_type": "information_withholder",
    "turn_count": 12,
    "gold_diagnosis": "Cerebral ischaemic stroke due to paradoxical embolism"
  }
]