[
  {
    "vignette_index": 290,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.",
    "output": "THINKING: I need to explain my symptoms clearly but I might get too emotional or nervous. I want to mention my past issues because they could be related, and I also need to express that I’m worried about what’s\nANSWER: Well, I’m 29 and I’m a woman, and these past two weeks I’ve just been feeling worse. It started with some mild discomfort in my lower belly, but then it got a lot worse — mainly on my right side, and sometimes I feel it kinda radiates up or to the back. I’ve been throwing up and feeling really nauseous, and my bleeding has been kinda unpredictable, sometimes heavier than usual. I also have a low-grade fever that’s been hanging around for days. I’ve had pelvic infections before, and I’m worried because I’m also sexually active with different partners, so I don’t know if it’s something serious or if I might have some infection again.",
    "thinking": "I need to explain my symptoms clearly but I might get too emotional or nervous. I want to mention my past issues because they could be related, and I also need to express that I’m worried about what’s",
    "answer": "Well, I’m 29 and I’m a woman, and these past two weeks I’ve just been feeling worse. It started with some mild discomfort in my lower belly, but then it got a lot worse — mainly on my right side, and sometimes I feel it kinda radiates up or to the back. I’ve been throwing up and feeling really nauseous, and my bleeding has been kinda unpredictable, sometimes heavier than usual. I also have a low-grade fever that’s been hanging around for days. I’ve had pelvic infections before, and I’m worried because I’m also sexually active with different partners, so I don’t know if it’s something serious or if I might have some infection again.",
    "behavior_type": "tangential_storyteller",
    "behavior_config": {
      "weight": 0.08,
      "description": "Patient who includes irrelevant details and stories",
      "modifiers": [
        "excessive_details",
        "family_stories",
        "tangential_information"
      ],
      "empathy_cues": [
        "storytelling",
        "context_sharing",
        "social_needs",
        "relationship_focus"
      ]
    },
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.Can you tell me more about your recent sexual activity, including any new partners, condom use, or any chance you might have been exposed to infections?tangential_storyteller",
    "output": "THINKING: I’m feeling really uncomfortable, and I know the doctor asked about my sex life, but honestly, I don’t remember much about recent partners or anything specific like that. I’ve just been really worried\nANSWER: Well, I’ve been kind of busy, honestly. I’ve had sex a few times, but I don’t really remember exactly when, and sometimes we don’t use protection, I guess. My head’s kind of spinning lately, and I really don’t know if I could have caught something or if it’s just my usual stuff, but things have been worse than usual, you know?",
    "thinking": "I’m feeling really uncomfortable, and I know the doctor asked about my sex life, but honestly, I don’t remember much about recent partners or anything specific like that. I’ve just been really worried",
    "answer": "Well, I’ve been kind of busy, honestly. I’ve had sex a few times, but I don’t really remember exactly when, and sometimes we don’t use protection, I guess. My head’s kind of spinning lately, and I really don’t know if I could have caught something or if it’s just my usual stuff, but things have been worse than usual, you know?",
    "behavior_type": "tangential_storyteller",
    "turn_count": 0,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.\"Many people find it helpful to talk openly about recent sexual activity when they're experiencing symptoms like yours—can you tell me about your recent sexual partners, if you’ve used protection, or if there’s anything recent that might have put you at risk?\"tangential_storyteller",
    "output": "THINKING: Okay, the doctor is asking about my sexual activity, but honestly I don’t remember all the details. I’ve been super stressed at work lately, and I was just trying to keep up with everything, but I kno\nANSWER: Well, see, I’ve been pretty busy with work stuff—there was this project that just took over my life for a bit—and I’ve been kinda seeing a couple of people, but honestly, I don’t remember every single time. I’ve used protection sometimes, but not always, and my last partner, well, I think we weren’t super careful because I’ve had these weird symptoms already for like, a week or two, and it’s just been messing with my head.",
    "thinking": "Okay, the doctor is asking about my sexual activity, but honestly I don’t remember all the details. I’ve been super stressed at work lately, and I was just trying to keep up with everything, but I kno",
    "answer": "Well, see, I’ve been pretty busy with work stuff—there was this project that just took over my life for a bit—and I’ve been kinda seeing a couple of people, but honestly, I don’t remember every single time. I’ve used protection sometimes, but not always, and my last partner, well, I think we weren’t super careful because I’ve had these weird symptoms already for like, a week or two, and it’s just been messing with my head.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 2,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.Can you tell me more about your recent sexual activity—such as how many partners you've seen, whether you've used protection, and if you've had any recent concerns about infections or exposure to anyone with symptoms?tangential_storyteller",
    "output": "THINKING: The doctor is asking about my recent sexual activity, and I guess I should answer, but honestly, I don’t really remember all the details because I’ve been so stressed out with work and my family stuff\nANSWER: Um, yeah, I’ve been with a bunch of different people lately, like a few in the last couple of months. We usually don’t use protection because I usually forget or don’t think about it, and I don’t know if I’ve been around anyone who was sick or anything, but I guess it’s possible? My mom had ovarian problems when she was younger, so I get kinda nervous about stuff like that.",
    "thinking": "The doctor is asking about my recent sexual activity, and I guess I should answer, but honestly, I don’t really remember all the details because I’ve been so stressed out with work and my family stuff",
    "answer": "Um, yeah, I’ve been with a bunch of different people lately, like a few in the last couple of months. We usually don’t use protection because I usually forget or don’t think about it, and I don’t know if I’ve been around anyone who was sick or anything, but I guess it’s possible? My mom had ovarian problems when she was younger, so I get kinda nervous about stuff like that.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 4,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.Can you tell me the exact timing of your last sexual activity, how many partners you've had recently, and whether you've used protection during these encounters?tangential_storyteller",
    "output": "THINKING: I’m a bit embarrassed even asking about this, but I suppose it’s important. I’ve been kinda stressed about other stuff too—work has been hectic, and my sister just got diagnosed with something, so my \nANSWER: Um, well, I don’t remember exactly when the last time was I, you know, did anything—I mean, I’ve been super busy with work and stuff, and honestly, I’ve had kind of irregular periods lately, so I haven’t kept perfect track. I’ve had a few partners recently, but I don’t really remember if I used protection every time—sometimes we forget, or it just doesn’t seem like a big deal.",
    "thinking": "I’m a bit embarrassed even asking about this, but I suppose it’s important. I’ve been kinda stressed about other stuff too—work has been hectic, and my sister just got diagnosed with something, so my",
    "answer": "Um, well, I don’t remember exactly when the last time was I, you know, did anything—I mean, I’ve been super busy with work and stuff, and honestly, I’ve had kind of irregular periods lately, so I haven’t kept perfect track. I’ve had a few partners recently, but I don’t really remember if I used protection every time—sometimes we forget, or it just doesn’t seem like a big deal.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 6,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.Can you tell me if you are currently pregnant or if you've taken a pregnancy test recently, and could you clarify when your last sexual activity was, including whether you used any protection during that time?tangential_storyteller",
    "output": "THINKING: I’m not really sure about pregnancy, honestly. I haven't taken a test recently, but I remember my friend at work was saying she thought she might be pregnant and had the same kind of weird bleeding, s\nANSWER: Uh, I don’t really know if I’m pregnant or not. I haven’t done a test lately, but I guess my last kind of “thing” was maybe a couple of weeks ago, and then I started feeling all weird — like, the bleeding is all over the place and I’ve been feeling sick and hot, and I’ve just been worried, I guess.",
    "thinking": "I’m not really sure about pregnancy, honestly. I haven't taken a test recently, but I remember my friend at work was saying she thought she might be pregnant and had the same kind of weird bleeding, s",
    "answer": "Uh, I don’t really know if I’m pregnant or not. I haven’t done a test lately, but I guess my last kind of “thing” was maybe a couple of weeks ago, and then I started feeling all weird — like, the bleeding is all over the place and I’ve been feeling sick and hot, and I’ve just been worried, I guess.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 8,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.Can you tell me exactly when your last sexual activity was, how many partners you've seen recently, and whether you used any protection during those times?tangential_storyteller",
    "output": "THINKING: My mind is a bit fuzzy with everything going on—I've been worried about what this all means, especially since I’ve had infections before. I started to think about the last time I was with someone, but\nANSWER: Oh, um, I think it was maybe two weeks ago, but honestly, I don’t really remember exactly. I’ve been seeing a couple of different guys lately, and we don’t always use protection because I guess I get distracted or just forget sometimes. It’s been kind of a messy couple of weeks with work stress and family drama, so I haven’t been paying much attention to everything, but I’m worried because I’ve had these symptoms for a bit now.",
    "thinking": "My mind is a bit fuzzy with everything going on—I've been worried about what this all means, especially since I’ve had infections before. I started to think about the last time I was with someone, but",
    "answer": "Oh, um, I think it was maybe two weeks ago, but honestly, I don’t really remember exactly. I’ve been seeing a couple of different guys lately, and we don’t always use protection because I guess I get distracted or just forget sometimes. It’s been kind of a messy couple of weeks with work stress and family drama, so I haven’t been paying much attention to everything, but I’m worried because I’ve had these symptoms for a bit now.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 10,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.Can you tell me exactly when your last sexual activity was, how many partners you have seen recently, and whether you used protection, like a condom, during that last encounter?tangential_storyteller",
    "output": "THINKING: I feel a bit embarrassed talking about this stuff, honestly. It's been on my mind because it's just weird, and I don't really remember exactly when I was last with someone — I think it was a couple of\nANSWER: Uh, I think it was about two weeks ago when I last, well, you know, did anything, and I’ve seen a few different people recently — I can’t really remember if I always used protection, to be honest. Things get busy, and sometimes I forget or don’t think about it because I was stressed out from work, and my sister’s been having her own health problems, so it’s just been a lot.",
    "thinking": "I feel a bit embarrassed talking about this stuff, honestly. It's been on my mind because it's just weird, and I don't really remember exactly when I was last with someone — I think it was a couple of",
    "answer": "Uh, I think it was about two weeks ago when I last, well, you know, did anything, and I’ve seen a few different people recently — I can’t really remember if I always used protection, to be honest. Things get busy, and sometimes I forget or don’t think about it because I was stressed out from work, and my sister’s been having her own health problems, so it’s just been a lot.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 12,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.\"Can you tell me if you might be pregnant currently or have taken a pregnancy test recently, and also, can you describe your last sexual activity—when it happened, whether you used protection like a condom, and if you’ve had any worries about pregnancy or infection since then?\"tangential_storyteller",
    "output": "THINKING: I guess I should tell him about my last period and that I haven't really done a pregnancy test from a while ago, but I also forget if I was supposed to or not? I thought about it when I felt kind of s\nANSWER: Well, I don't think I’ve taken a test recently, but I was kind of worried about being pregnant when I started feeling really nauseous and stuff, but honestly, I don’t remember exactly if I did a test after that. My last period was kind of irregular, and I was having sex a couple of weeks ago, but I used protection, I think—my brain gets all mixed up with everything lately.",
    "thinking": "I guess I should tell him about my last period and that I haven't really done a pregnancy test from a while ago, but I also forget if I was supposed to or not? I thought about it when I felt kind of s",
    "answer": "Well, I don't think I’ve taken a test recently, but I was kind of worried about being pregnant when I started feeling really nauseous and stuff, but honestly, I don’t remember exactly if I did a test after that. My last period was kind of irregular, and I was having sex a couple of weeks ago, but I used protection, I think—my brain gets all mixed up with everything lately.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 14,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  },
  {
    "vignette_index": 290,
    "input": "**PATIENT CHARACTER:** Patient with Chronic salpingitis and oophoritis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 29 AND YOUR BIOLOGICAL GENDER IS FEMALE.\nYou are experiencing the following symptoms:\n- Lower abdominal pain on the right side\n- Nausea and vomiting\n- Irregular vaginal bleeding\n- Fever\nTHESE SYMPTOMS CAME INTO FRUITION about two weeks ago, starting with mild discomfort that gradually worsened. The pain is localized in the lower right abdomen and sometimes radiates to the upper abdomen. You’ve noticed that your bleeding is unpredictable, sometimes heavier than usual, and you’ve been feeling quite nauseous, with occasional vomiting. You also developed a low-grade fever that has persisted for several days. You’re worried because you’ve had previous pelvic infections and are sexually active with multiple partners, which makes you concerned about ongoing reproductive health issues.Can you tell me if you've taken a pregnancy test recently or if you think you might be pregnant right now?tangential_storyteller",
    "output": "THINKING: I’m honestly not sure if I’ve taken a pregnancy test recently. I’ve been so overwhelmed with the pain and everything else going on, I forget if I did one or not. Plus, I have a cousin who had similar \nANSWER: Umm, I don’t really remember if I did a test lately. I’ve been so busy, and with the pain and feeling sick all the time, I honestly forget sometimes. Last time I checked, I didn’t think about it much, but I guess I’ve been worried since my last infections and stuff, so I don’t know if I could be pregnant or something.",
    "thinking": "I’m honestly not sure if I’ve taken a pregnancy test recently. I’ve been so overwhelmed with the pain and everything else going on, I forget if I did one or not. Plus, I have a cousin who had similar",
    "answer": "Umm, I don’t really remember if I did a test lately. I’ve been so busy, and with the pain and feeling sick all the time, I honestly forget sometimes. Last time I checked, I didn’t think about it much, but I guess I’ve been worried since my last infections and stuff, so I don’t know if I could be pregnant or something.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 16,
    "gold_diagnosis": "Chronic salpingitis and oophoritis"
  }
]