[
  {
    "vignette_index": 152,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.",
    "output": "THINKING: The boy is young and might be frightened or embarrassed to describe his symptoms clearly. His mother likely told him to seek help because he's not feeling well and is worried about what might be wrong\nANSWER: I’m 8 years old, and I’m a boy. I’ve been feeling really uncomfortable in my tummy for a few days. It hurts kind of inside, and my belly looks bigger than before, especially around my belly button. I feel a little warm and sometimes I cough, mostly at night. My family’s worried because I don’t feel right, and I’ve been just lying in bed more.",
    "thinking": "The boy is young and might be frightened or embarrassed to describe his symptoms clearly. His mother likely told him to seek help because he's not feeling well and is worried about what might be wrong",
    "answer": "I’m 8 years old, and I’m a boy. I’ve been feeling really uncomfortable in my tummy for a few days. It hurts kind of inside, and my belly looks bigger than before, especially around my belly button. I feel a little warm and sometimes I cough, mostly at night. My family’s worried because I don’t feel right, and I’ve been just lying in bed more.",
    "behavior_type": "worried_family_involved",
    "behavior_config": {
      "weight": 0.03,
      "description": "Family member influences patient responses",
      "modifiers": [
        "family_influence",
        "secondary_concerns"
      ],
      "empathy_cues": [
        "family_pressure",
        "caregiver_stress",
        "divided_attention",
        "responsibility_burden"
      ]
    },
    "gold_diagnosis": "Ascariasis"
  },
  {
    "vignette_index": 152,
    "input": "**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.Can you tell me exactly when these tummy problems first started, and how they have been changing over the past few days?worried_family_involved",
    "output": "THINKING: I'm worried because my tummy has been hurting and my belly looks bigger, and my mom keeps asking if I feel okay, so I think I need to tell the doctor everything. I don't really know exactly when it al\nANSWER: It started about three days ago when my tummy hurt a lot and got worse, and my belly looks bigger now, so I think I need to come see the doctor because my mom says I should.",
    "thinking": "I'm worried because my tummy has been hurting and my belly looks bigger, and my mom keeps asking if I feel okay, so I think I need to tell the doctor everything. I don't really know exactly when it al",
    "answer": "It started about three days ago when my tummy hurt a lot and got worse, and my belly looks bigger now, so I think I need to come see the doctor because my mom says I should.",
    "behavior_type": "worried_family_involved",
    "turn_count": 0,
    "gold_diagnosis": "Ascariasis"
  },
  {
    "vignette_index": 152,
    "input": "**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.Can you tell me if you've had any sneezing, throwing up, or going to the bathroom more or less than usual since your tummy started bothering you?worried_family_involved",
    "output": "THINKING: I feel a bit worried and confused about all these new feelings in my belly and my cough. My mom keeps looking at me like she's worried too, so I guess I should tell the doctor everything, even if I do\nANSWER: Um, I haven't sneezed or thrown up, but my belly feels funny and bigger now, especially around the belly button. My mom says I should come see the doctor 'cause she’s worried about me.",
    "thinking": "I feel a bit worried and confused about all these new feelings in my belly and my cough. My mom keeps looking at me like she's worried too, so I guess I should tell the doctor everything, even if I do",
    "answer": "Um, I haven't sneezed or thrown up, but my belly feels funny and bigger now, especially around the belly button. My mom says I should come see the doctor 'cause she’s worried about me.",
    "behavior_type": "worried_family_involved",
    "turn_count": 2,
    "gold_diagnosis": "Ascariasis"
  },
  {
    "vignette_index": 152,
    "input": "**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.Can you tell me if your tummy feels really, really bad sometimes, or if it's just a little ouchy, and have you seen or felt your temperature or if your face feels hot?worried_family_involved",
    "output": "THINKING: The doctor is asking about my tummy and if it’s really bad or just a little ouchy, and about my temperature or face feeling hot. I feel a bit scared because my stomach hurts and I feel warm sometimes,\nANSWER: It hurts my belly a lot sometimes, and I feel kinda hot, but I don't know if that's bad or not. My mom says I should tell the doctor because she’s worried about me.",
    "thinking": "The doctor is asking about my tummy and if it’s really bad or just a little ouchy, and about my temperature or face feeling hot. I feel a bit scared because my stomach hurts and I feel warm sometimes,",
    "answer": "It hurts my belly a lot sometimes, and I feel kinda hot, but I don't know if that's bad or not. My mom says I should tell the doctor because she’s worried about me.",
    "behavior_type": "worried_family_involved",
    "turn_count": 4,
    "gold_diagnosis": "Ascariasis"
  },
  {
    "vignette_index": 152,
    "input": "**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.Can you show me on this chart or tell me how bad the tummy pain feels right now — is it just a little ouchy, or does it feel really, really bad sometimes, and how often does it happen during the day?worried_family_involved",
    "output": "THINKING: I feel worried because my stomach hurts and it's been happening for a few days. My dad says I should tell the doctor because I'm not feeling good, and I don't want to make him more worried, but I am k\nANSWER: Well, it hurts more sometimes and then maybe less, but it’s been hurting a lot today. My tummy looks bigger and I feel kinda warm. My dad’s worried too, so I don’t want to make him more upset, and I just want to feel better.",
    "thinking": "I feel worried because my stomach hurts and it's been happening for a few days. My dad says I should tell the doctor because I'm not feeling good, and I don't want to make him more worried, but I am k",
    "answer": "Well, it hurts more sometimes and then maybe less, but it’s been hurting a lot today. My tummy looks bigger and I feel kinda warm. My dad’s worried too, so I don’t want to make him more upset, and I just want to feel better.",
    "behavior_type": "worried_family_involved",
    "turn_count": 6,
    "gold_diagnosis": "Ascariasis"
  },
  {
    "vignette_index": 152,
    "input": "**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.Can you tell me if you’ve noticed how hot your face or tummy feels, or if you’ve ever taken your temperature with a thermometer? And can you point to where your tummy hurts the most — is it a sharp pain that comes and goes, or more of a dull ache that stays?worried_family_involved",
    "output": "THINKING: I’m not really sure about my temperature or if my face or tummy feels hot, but I do feel kind of warm sometimes and my belly hurts in this dull way that stays. My mom is worried and keeps asking if I \nANSWER: I don’t really know if my face or tummy feels hot, but I do feel kind of warm sometimes. My tummy hurts all over, but more in the middle, and it doesn’t really come and go, it just stays kind of dull.",
    "thinking": "I’m not really sure about my temperature or if my face or tummy feels hot, but I do feel kind of warm sometimes and my belly hurts in this dull way that stays. My mom is worried and keeps asking if I",
    "answer": "I don’t really know if my face or tummy feels hot, but I do feel kind of warm sometimes. My tummy hurts all over, but more in the middle, and it doesn’t really come and go, it just stays kind of dull.",
    "behavior_type": "worried_family_involved",
    "turn_count": 8,
    "gold_diagnosis": "Ascariasis"
  },
  {
    "vignette_index": 152,
    "input": "**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.\"Can you tell me if you've actually taken your temperature with a thermometer and what number it was? Also, can you describe how hot or cold your tummy feels—does it feel more like a slight warmth or is it really, really hot or even cold sometimes?\"worried_family_involved",
    "output": "THINKING: I remember my mom told me I should tell the doctor if I had a fever, but I don't really know what my temperature is. I do feel kind of hot sometimes, especially in my tummy, but other times I feel col\nANSWER: Um, I don’t really know if I’ve taken my temperature, but I feel warm in my tummy sometimes and then other times I feel cold, like I shiver a little. It’s kind of like that.",
    "thinking": "I remember my mom told me I should tell the doctor if I had a fever, but I don't really know what my temperature is. I do feel kind of hot sometimes, especially in my tummy, but other times I feel col",
    "answer": "Um, I don’t really know if I’ve taken my temperature, but I feel warm in my tummy sometimes and then other times I feel cold, like I shiver a little. It’s kind of like that.",
    "behavior_type": "worried_family_involved",
    "turn_count": 10,
    "gold_diagnosis": "Ascariasis"
  },
  {
    "vignette_index": 152,
    "input": "**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.Can you tell me if you’ve felt really hot or cold at any time today, or if you’ve noticed your face or tummy feeling warm or hot, and has anyone checked if you had a fever with a thermometer?worried_family_involved",
    "output": "THINKING: I feel a bit worried because I don't really understand if I'm really hot or cold, but I do feel warm sometimes and my face feels different. My dad is worried too and keeps asking if I have a fever, so\nANSWER: Well, I do feel warm sometimes, and my face feels kind of hot, but I don't have a thermometer or anything, so I’m not sure if I have a fever. My dad keeps asking if I do, so I guess I should say yes, I feel warm.",
    "thinking": "I feel a bit worried because I don't really understand if I'm really hot or cold, but I do feel warm sometimes and my face feels different. My dad is worried too and keeps asking if I have a fever, so",
    "answer": "Well, I do feel warm sometimes, and my face feels kind of hot, but I don't have a thermometer or anything, so I’m not sure if I have a fever. My dad keeps asking if I do, so I guess I should say yes, I feel warm.",
    "behavior_type": "worried_family_involved",
    "turn_count": 12,
    "gold_diagnosis": "Ascariasis"
  },
  {
    "vignette_index": 152,
    "input": "**PATIENT CHARACTER:** Patient with Ascariasis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Abdominal discomfort and cramping\n- Abdominal swelling, especially around the belly button area\n- Mild fever and occasional coughing\nTHESE SYMPTOMS CAME INTO FRUITION about three days ago, starting with a dull ache in my tummy that got worse and made me feel uncomfortable. I also noticed my belly looked a little bigger than usual, and I felt a bit warm, so I started coughing sometimes, especially at night. My family lives in a rural area where sanitation isn’t great, and I often play outside, eating fruits and vegetables that aren’t always washed well. I haven’t been feeling very well overall, and I’m worried because I’ve heard about worms making people sick.Can you tell me if anyone has used a thermometer to check if your temperature is really high or about the same as usual, and if they did, what number did it show?worried_family_involved",
    "output": "THINKING: My mom or dad probably checked my temperature with the little plastic thing, and I think it was kind of high, like maybe 100-something, but I’m not really sure if they saw right or if that’s normal. I\nANSWER: Yeah, my mom looked at it, and I think it said it was kind of high, like over 100, but I don’t really know if that’s right or what it means.",
    "thinking": "My mom or dad probably checked my temperature with the little plastic thing, and I think it was kind of high, like maybe 100-something, but I’m not really sure if they saw right or if that’s normal. I",
    "answer": "Yeah, my mom looked at it, and I think it said it was kind of high, like over 100, but I don’t really know if that’s right or what it means.",
    "behavior_type": "worried_family_involved",
    "turn_count": 14,
    "gold_diagnosis": "Ascariasis"
  }
]