[
  {
    "vignette_index": 193,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.",
    "output": "THINKING: I should tell the doctor that I've been feeling pretty bad for a few days. I want to mention the tick bite because that could be related, but I also don’t want to sound like I’m overreacting. I’ve bee\nANSWER: Well, I’m 45, and I’m a guy. I’ve had a fever that’s been coming and going, and a bad headache, plus some rash on my wrists and ankles. It started a few days ago after I went hiking in the woods, and I think I got bitten by a tick. I’ve just been feeling more tired and pretty sore all over, especially my muscles. I thought it might go away, but now I don't know, it’s worse and the rash is spreading, so I thought I should come in and see if it’s something serious.",
    "thinking": "I should tell the doctor that I've been feeling pretty bad for a few days. I want to mention the tick bite because that could be related, but I also don’t want to sound like I’m overreacting. I’ve bee",
    "answer": "Well, I’m 45, and I’m a guy. I’ve had a fever that’s been coming and going, and a bad headache, plus some rash on my wrists and ankles. It started a few days ago after I went hiking in the woods, and I think I got bitten by a tick. I’ve just been feeling more tired and pretty sore all over, especially my muscles. I thought it might go away, but now I don't know, it’s worse and the rash is spreading, so I thought I should come in and see if it’s something serious.",
    "behavior_type": "stoic_minimizer",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient who downplays symptoms and delays care",
      "modifiers": [
        "symptom_minimization",
        "delayed_care_seeking",
        "tough_attitude"
      ],
      "empathy_cues": [
        "downplaying",
        "reluctance",
        "pride_in_toughness",
        "external_pressure"
      ]
    },
    "gold_diagnosis": "Other specified spotted fever"
  },
  {
    "vignette_index": 193,
    "input": "**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.Can you tell me more about how you're feeling overall—like if you've noticed any stiff joints, new numbness, dizziness, or anything else that feels unusual beyond the fever and rash?stoic_minimizer",
    "output": "THINKING: I want to downplay the symptoms but also admit I’ve been feeling worse. I don't want to seem like I’m overreacting, but I do feel pretty bad now. Maybe the rash spreading is serious, but I’ve had wors\nANSWER: Well, it’s probably nothing, just some kind of rash I got from the hike, but yeah, my muscles hurt a lot now, and I’ve been feeling pretty tired and cold all the time.",
    "thinking": "I want to downplay the symptoms but also admit I’ve been feeling worse. I don't want to seem like I’m overreacting, but I do feel pretty bad now. Maybe the rash spreading is serious, but I’ve had wors",
    "answer": "Well, it’s probably nothing, just some kind of rash I got from the hike, but yeah, my muscles hurt a lot now, and I’ve been feeling pretty tired and cold all the time.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 0,
    "gold_diagnosis": "Other specified spotted fever"
  },
  {
    "vignette_index": 193,
    "input": "**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.Can you tell me if you've noticed any new or unusual feelings like dizziness, numbness, weakness, trouble thinking clearly, or anything that's felt out of the ordinary since your symptoms started?stoic_minimizer",
    "output": "THINKING: I guess I’m pretty tired and confused, but I don’t want to overreact. It’s probably nothing serious, just been dealing with this for a few days. I don’t really notice anything else unusual besides how\nANSWER: Not really, I just feel worse everywhere, but I don’t know if it’s anything serious. I’ve had a headache and the rash, but I think I can handle it.",
    "thinking": "I guess I’m pretty tired and confused, but I don’t want to overreact. It’s probably nothing serious, just been dealing with this for a few days. I don’t really notice anything else unusual besides how",
    "answer": "Not really, I just feel worse everywhere, but I don’t know if it’s anything serious. I’ve had a headache and the rash, but I think I can handle it.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 2,
    "gold_diagnosis": "Other specified spotted fever"
  },
  {
    "vignette_index": 193,
    "input": "**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.Can you tell me if you've noticed any changes in how you're feeling mentally or physically, like feeling more confused, weak, or having trouble moving or with your balance since your symptoms started?stoic_minimizer",
    "output": "THINKING: I feel a bit overwhelmed and worried, but I don't want to overdo it or make a big deal. I’ve just been trying to handle it on my own and hope it gets better, but I guess I should mention how I’m feeli\nANSWER: Well, I’ve been feeling pretty tired and my muscles hurt a lot, but I think I can still kind of function. Nothing really feels off mentally, I don't think. Just this fever and the rash getting worse.",
    "thinking": "I feel a bit overwhelmed and worried, but I don't want to overdo it or make a big deal. I’ve just been trying to handle it on my own and hope it gets better, but I guess I should mention how I’m feeli",
    "answer": "Well, I’ve been feeling pretty tired and my muscles hurt a lot, but I think I can still kind of function. Nothing really feels off mentally, I don't think. Just this fever and the rash getting worse.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 4,
    "gold_diagnosis": "Other specified spotted fever"
  },
  {
    "vignette_index": 193,
    "input": "**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.Have you noticed any changes in your mental clarity, like feeling more confused, having trouble concentrating, or feeling sort of \"fuzzy\" in your head since your symptoms began?stoic_minimizer",
    "output": "THINKING: I'm not sure, honestly. I just feel kinda foggy sometimes, but I don’t want to make a big deal out of it. Maybe it’s nothing, but I’ve noticed I can't focus as well lately.\nANSWER: Yeah, I guess I feel a bit more fuzzy in my head, but I thought maybe it’s just the fever or all this stuff I’ve been dealing with.",
    "thinking": "I'm not sure, honestly. I just feel kinda foggy sometimes, but I don’t want to make a big deal out of it. Maybe it’s nothing, but I’ve noticed I can't focus as well lately.",
    "answer": "Yeah, I guess I feel a bit more fuzzy in my head, but I thought maybe it’s just the fever or all this stuff I’ve been dealing with.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 6,
    "gold_diagnosis": "Other specified spotted fever"
  },
  {
    "vignette_index": 193,
    "input": "**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.Have you noticed any new or worsening issues like numbness, tingling, weakness in your limbs, difficulty moving, or problems with your coordination or balance since your symptoms started?stoic_minimizer",
    "output": "THINKING: I'm not sure if I'm supposed to be worried about feeling weak or if it’s just part of the illness. I usually cope with pain and stuff, so I just want to say everything’s okay but I guess I should tell\nANSWER: Well, I haven't noticed any trouble moving or anything like that, but I do feel more exhausted and kind of off since all this started. Not sure if it's related or not.",
    "thinking": "I'm not sure if I'm supposed to be worried about feeling weak or if it’s just part of the illness. I usually cope with pain and stuff, so I just want to say everything’s okay but I guess I should tell",
    "answer": "Well, I haven't noticed any trouble moving or anything like that, but I do feel more exhausted and kind of off since all this started. Not sure if it's related or not.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 8,
    "gold_diagnosis": "Other specified spotted fever"
  },
  {
    "vignette_index": 193,
    "input": "**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.Have you noticed any subtle problems with your strength, balance, or coordination—like feeling wobbly, difficulty moving parts of your body smoothly, or issues with your fine motor skills—that you've perhaps been hesitant to mention?stoic_minimizer",
    "output": "THINKING: I guess I haven't really noticed any big problems with my movement or balance, and I don't want to make a fuss, but I do feel pretty weak and tired. I just thought it was the flu at first, but it's no\nANSWER: No, I haven't noticed anything like that. I just feel really tired and that's about it. The rash and everything kind of crept up on me, and I don’t know, maybe I should’ve come sooner.",
    "thinking": "I guess I haven't really noticed any big problems with my movement or balance, and I don't want to make a fuss, but I do feel pretty weak and tired. I just thought it was the flu at first, but it's no",
    "answer": "No, I haven't noticed anything like that. I just feel really tired and that's about it. The rash and everything kind of crept up on me, and I don’t know, maybe I should’ve come sooner.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 10,
    "gold_diagnosis": "Other specified spotted fever"
  },
  {
    "vignette_index": 193,
    "input": "**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.Have you noticed if you’ve been feeling wobbly when walking, having trouble keeping your balance, or if your limbs feel weaker or harder to move than they used to, even if just subtly?stoic_minimizer",
    "output": "THINKING: I'm a bit worried but also trying not to make a big deal out of it. The symptoms have been there a few days, and they seem to be getting worse, but I don't want to overreact since I can handle some pa\nANSWER: Uh, I don’t really notice any problems with walking or my limbs feeling weaker or anything, but I’ve been feeling pretty rough overall.",
    "thinking": "I'm a bit worried but also trying not to make a big deal out of it. The symptoms have been there a few days, and they seem to be getting worse, but I don't want to overreact since I can handle some pa",
    "answer": "Uh, I don’t really notice any problems with walking or my limbs feeling weaker or anything, but I’ve been feeling pretty rough overall.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 12,
    "gold_diagnosis": "Other specified spotted fever"
  },
  {
    "vignette_index": 193,
    "input": "**PATIENT CHARACTER:** Patient with Other specified spotted fever\n\nYou are a patient: You are 45 years old and your biological gender is male.\nYou are experiencing the following symptoms: fever, headache, rash, muscle pain, and chills.\nThese symptoms came into fruition gradually over the past three days, starting with a mild fever and headache that worsened, followed by the appearance of a rash on your wrists and ankles.\nYou recently went hiking in wooded areas during the late spring, where you remember getting bitten by a tick.\nYou feel increasingly fatigued and worried about how quickly your condition is worsening, especially since the rash is spreading and your muscles are aching intensely.\"I understand you may not think much about it, but have you noticed any slight problems with your coordination — like feeling a bit wobbly when you walk, having trouble with tasks that require fine movements, or noticing any numbness or tingling that may be hard to describe?\"stoic_minimizer",
    "output": "THINKING: The doctor is asking about coordination and numbness, but I mostly just feel tired and achy all over. I don't think it's anything serious, but I guess I should mention it just in case.\nANSWER: Uh, no, I don’t think I’ve noticed anything like that. Mostly I just feel really tired and my muscles are sore, especially after the rash started showing up. It’s probably nothing.",
    "thinking": "The doctor is asking about coordination and numbness, but I mostly just feel tired and achy all over. I don't think it's anything serious, but I guess I should mention it just in case.",
    "answer": "Uh, no, I don’t think I’ve noticed anything like that. Mostly I just feel really tired and my muscles are sore, especially after the rash started showing up. It’s probably nothing.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 14,
    "gold_diagnosis": "Other specified spotted fever"
  }
]