[
  {
    "vignette_index": 57,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.",
    "output": "THINKING: The patient is likely experiencing a psychiatric or substance-related issue, probably related to recent drug use. They seem confused and overwhelmed, so I need to understand more about their mental st\nANSWER: Um, I guess I just, I don’t know, everything’s been kinda crazy since I, I mean, after the last few days of using. I keep seeing things out of the corner of my eye, like shadows or people or something, and I feel like everyone’s talking about me or watching me — like all the time. My head’s all jumbled, and I can’t really think straight, and I’ve been acting all weird, throwing stuff and not caring about how I look or what I say. It’s all just confusing and kind of scary.",
    "thinking": "The patient is likely experiencing a psychiatric or substance-related issue, probably related to recent drug use. They seem confused and overwhelmed, so I need to understand more about their mental st",
    "answer": "Um, I guess I just, I don’t know, everything’s been kinda crazy since I, I mean, after the last few days of using. I keep seeing things out of the corner of my eye, like shadows or people or something, and I feel like everyone’s talking about me or watching me — like all the time. My head’s all jumbled, and I can’t really think straight, and I’ve been acting all weird, throwing stuff and not caring about how I look or what I say. It’s all just confusing and kind of scary.",
    "behavior_type": "tangential_storyteller",
    "behavior_config": {
      "weight": 0.08,
      "description": "Patient who includes irrelevant details and stories",
      "modifiers": [
        "excessive_details",
        "family_stories",
        "tangential_information"
      ],
      "empathy_cues": [
        "storytelling",
        "context_sharing",
        "social_needs",
        "relationship_focus"
      ]
    },
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  },
  {
    "vignette_index": 57,
    "input": "**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.Can you tell me more about how you've been feeling and what you've been experiencing over the past few weeks—specifically, whether you've noticed these kinds of shadows or feelings of being watched even when you're not using substances, and how these symptoms are affecting your daily life?tangential_storyteller",
    "output": "THINKING: I’m really overwhelmed and honestly confused. I keep seeing stuff out of the corner of my eye, but I’m not sure if it’s just me or the drugs messing with my head. I mean, yesterday, I was just hanging\nANSWER: Yeah, I’ve been seeing shadows and weird figures, especially lately—like out of the corner of my eye or when I’m just sitting here. It’s kind of like I can’t tell what’s real anymore, and I’ve just been feeling really paranoid, like people are talking about me or watching me, even when I know I shouldn’t be thinking that way.",
    "thinking": "I’m really overwhelmed and honestly confused. I keep seeing stuff out of the corner of my eye, but I’m not sure if it’s just me or the drugs messing with my head. I mean, yesterday, I was just hanging",
    "answer": "Yeah, I’ve been seeing shadows and weird figures, especially lately—like out of the corner of my eye or when I’m just sitting here. It’s kind of like I can’t tell what’s real anymore, and I’ve just been feeling really paranoid, like people are talking about me or watching me, even when I know I shouldn’t be thinking that way.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 0,
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  },
  {
    "vignette_index": 57,
    "input": "**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.\"Can you tell me if you've experienced situations like this—seeing shadows or feeling paranoid—before the recent days, or if these are new things for you? Have they ever happened at other times in your life?\"tangential_storyteller",
    "output": "THINKING: I wonder if these things actually happened before or if it’s just because I was up for so long, or maybe because my cousin said he saw weird stuff once when he was really drunk. It’s all kinda fuzzy, \nANSWER: Honestly, I don't think I've ever seen shadows like this or felt paranoid like this before, but I do remember my uncle saying once he used a bunch of pills back in the day and he saw stuff that wasn’t there, so maybe it’s kinda like that? I just really can’t tell what’s real anymore, especially after the past few days.",
    "thinking": "I wonder if these things actually happened before or if it’s just because I was up for so long, or maybe because my cousin said he saw weird stuff once when he was really drunk. It’s all kinda fuzzy,",
    "answer": "Honestly, I don't think I've ever seen shadows like this or felt paranoid like this before, but I do remember my uncle saying once he used a bunch of pills back in the day and he saw stuff that wasn’t there, so maybe it’s kinda like that? I just really can’t tell what’s real anymore, especially after the past few days.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 2,
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  },
  {
    "vignette_index": 57,
    "input": "**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.Can you tell me if you've ever experienced similar feelings or seeing shadows or figures before, even when you weren't using anything, and if so, how those experiences compared to what you're going through now?tangential_storyteller",
    "output": "THINKING: The doctor is trying to find out if I've had anything similar before, but honestly, everything is kind of blurry and overwhelming right now. I don’t really remember if I’ve seen shadows before, but I \nANSWER: Yeah, I think I saw stuff like that once before, like shadows out of the corner of my eye, but it was kind of different then, more fleeting or something. Now, it’s like they’re always there and I feel like everyone’s watching me or talking about me, even though I know that sounds crazy. I haven’t felt like this really, this intense, I guess, since I was a kid or something, but I dunno, things just feel so jumbled now.",
    "thinking": "The doctor is trying to find out if I've had anything similar before, but honestly, everything is kind of blurry and overwhelming right now. I don’t really remember if I’ve seen shadows before, but I",
    "answer": "Yeah, I think I saw stuff like that once before, like shadows out of the corner of my eye, but it was kind of different then, more fleeting or something. Now, it’s like they’re always there and I feel like everyone’s watching me or talking about me, even though I know that sounds crazy. I haven’t felt like this really, this intense, I guess, since I was a kid or something, but I dunno, things just feel so jumbled now.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 4,
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  },
  {
    "vignette_index": 57,
    "input": "**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.Have you used any drugs, alcohol, or medications recently—that is, in the past few days—that might have affected how you're feeling or seeing things?tangential_storyteller",
    "output": "THINKING: I guess he's asking if I took anything that could've made me feel this way, and honestly, I was using meth pretty heavily the past few days. I mean, I tried to stop, but it's like my mind's all over t\nANSWER: Yeah, I guess I was using meth a lot lately, and now I keep seeing these weird shadows and stuff out of the corner of my eye, and I feel like everyone's talking about me or watching me. It's been like this since yesterday, and I can't focus on anything, and I feel totally disorganized and just, I don't know, lost or something.",
    "thinking": "I guess he's asking if I took anything that could've made me feel this way, and honestly, I was using meth pretty heavily the past few days. I mean, I tried to stop, but it's like my mind's all over t",
    "answer": "Yeah, I guess I was using meth a lot lately, and now I keep seeing these weird shadows and stuff out of the corner of my eye, and I feel like everyone's talking about me or watching me. It's been like this since yesterday, and I can't focus on anything, and I feel totally disorganized and just, I don't know, lost or something.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 6,
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  },
  {
    "vignette_index": 57,
    "input": "**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.Have you ever experienced similar kinds of hallucinations or paranoid thoughts at times when you weren't using methamphetamine or any other substances—that is, during periods when you were abstinent or not high—that lasted for a while or caused you significant distress?tangential_storyteller",
    "output": "THINKING: I’m a bit embarrassed to talk about this stuff because I know it sounds crazy, but I have seen shadows around the house before, like, when I was really drunk or stressed out. My cousin once told me he\nANSWER: Yeah, I’ve seen shadows or weird figures out of the corner of my eye before, like, when I was really stressed or tired, but mostly when I was using meth recently, it got worse. It’s kinda scary because I keep thinking people are talking about me or watching me, and I can’t focus on anything for more than a few minutes. It all started really suddenly after I binged for a few days, and it just feels all jumbled up in my head.",
    "thinking": "I’m a bit embarrassed to talk about this stuff because I know it sounds crazy, but I have seen shadows around the house before, like, when I was really drunk or stressed out. My cousin once told me he",
    "answer": "Yeah, I’ve seen shadows or weird figures out of the corner of my eye before, like, when I was really stressed or tired, but mostly when I was using meth recently, it got worse. It’s kinda scary because I keep thinking people are talking about me or watching me, and I can’t focus on anything for more than a few minutes. It all started really suddenly after I binged for a few days, and it just feels all jumbled up in my head.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 8,
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  },
  {
    "vignette_index": 57,
    "input": "**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.Have you ever experienced these kinds of visual hallucinations or paranoid thoughts even when you weren’t using meth or any other substances, like during periods when you were sober or not high?tangential_storyteller",
    "output": "THINKING: I guess I’m a little scared, but also kind of embarrassed because I’ve been doing this stuff for a while, and now it’s really messing with my head. I mean, I’ve had paranoid thoughts before, but I nev\nANSWER: Well, I mean, I’ve had weird thoughts and stuff before, like when I was sober, but nothing like seeing shadows out of the corner of my eye or feeling like people are watching me all the time. That all started yesterday, right after I had been using meth pretty heavily for a few days in a row, and I’m just sort of freaking out because I don’t really know what’s real anymore or if I’m going crazy or if it’s something else.",
    "thinking": "I guess I’m a little scared, but also kind of embarrassed because I’ve been doing this stuff for a while, and now it’s really messing with my head. I mean, I’ve had paranoid thoughts before, but I nev",
    "answer": "Well, I mean, I’ve had weird thoughts and stuff before, like when I was sober, but nothing like seeing shadows out of the corner of my eye or feeling like people are watching me all the time. That all started yesterday, right after I had been using meth pretty heavily for a few days in a row, and I’m just sort of freaking out because I don’t really know what’s real anymore or if I’m going crazy or if it’s something else.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 10,
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  },
  {
    "vignette_index": 57,
    "input": "**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.Have you ever had times when you weren't using any substances—like when you were sober—where you still saw shadows, figures, or felt paranoid, even if just for a little while?tangential_storyteller",
    "output": "THINKING: I’m a bit embarrassed to talk about feeling paranoid, but I guess I’ve had moments before where I’d feel like someone was watching me, but they’d go away after I slept or something. It’s just weird be\nANSWER: Yeah, I think so, but it’s different now. Like, I saw a shadow when I was just sitting there and I didn’t even do anything. Before, maybe I’d see stuff if I was really tired or stressed, but this time it feels even stronger, and I’m really worried because it’s not clearing up.",
    "thinking": "I’m a bit embarrassed to talk about feeling paranoid, but I guess I’ve had moments before where I’d feel like someone was watching me, but they’d go away after I slept or something. It’s just weird be",
    "answer": "Yeah, I think so, but it’s different now. Like, I saw a shadow when I was just sitting there and I didn’t even do anything. Before, maybe I’d see stuff if I was really tired or stressed, but this time it feels even stronger, and I’m really worried because it’s not clearing up.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 12,
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  },
  {
    "vignette_index": 57,
    "input": "**PATIENT CHARACTER:** Patient with Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- I keep seeing strange shadows and figures out of the corner of my eye.\n- I've been feeling paranoid, like people are talking about me or watching me all the time.\n- My thoughts feel jumbled and I can't focus on anything for more than a few minutes.\n- I’ve been acting very disorganized, throwing things around and not really caring about how I look or what I say.\n- I started noticing these hallucinations and paranoia suddenly yesterday, after bingeing on methamphetamine for several days.\nThese symptoms came into fruition abruptly after a few days of heavy drug use, and I feel like I can't tell what's real anymore.Have you ever had episodes in the past where you experienced seeing things or feeling paranoid even when you were not using any drugs or substances, lasting for quite some time and causing you a lot of distress?tangential_storyteller",
    "output": "THINKING: The doctor asked about past episodes, but honestly, I don’t really remember, or maybe I just never paid attention before. I mean, I’ve had stuff like this happen before, especially when I was really m\nANSWER: No, I don’t think so, but like I said, I’ve had moments where I felt weird, especially when I was really high and stuff. This time, though, it’s worse, and I can’t tell if it’s just the drugs or if something’s really wrong with me, and nobody really warned me this could happen.",
    "thinking": "The doctor asked about past episodes, but honestly, I don’t really remember, or maybe I just never paid attention before. I mean, I’ve had stuff like this happen before, especially when I was really m",
    "answer": "No, I don’t think so, but like I said, I’ve had moments where I felt weird, especially when I was really high and stuff. This time, though, it’s worse, and I can’t tell if it’s just the drugs or if something’s really wrong with me, and nobody really warned me this could happen.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 14,
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  }
]