[
  {
    "vignette_index": 168,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Bordetella parapertussis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 12-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A mild cough that started gradually, mainly in the evenings\n- A runny nose that has been persistent for about a week\n- A low-grade fever that comes and goes\n- Fatigue that makes you feel tired even after a full night's sleep\n- Several persistent coughing fits that sometimes leave you gasping for air\nThese symptoms began gradually over the past week, starting with just a runny nose and mild cough, but now the cough has become more persistent and frequent, especially at night. You tend to feel more tired than usual during the day and sometimes feel a little feverish, but it's not very high. You don’t have any significant breathing difficulty, but the coughing fits worry you because they last for several seconds. You are concerned because you’ve been in close contact with classmates who have had similar symptoms recently.",
    "output": "THINKING: I need to explain all my symptoms clearly, even though I feel worried and a little embarrassed. I want to make sure the doctor understands that I'm not feeling right and that I'm really scared about t\nANSWER: I’m 12, and I’m a boy. I’ve been feeling kinda sick for about a week now. I have a runny nose that won’t go away and a cough that’s not just a little, it’s like it’s getting worse, especially at night. Sometimes I cough so bad that I gasp for air for a few seconds, and I feel kind of tired all the time, even after sleeping. I also get a little fever, but it’s not very high, and I just feel really worn out. I’ve been around friends at school who are sick too, so I don’t know if I caught something or... I don’t know, maybe it’s worse than it seems.",
    "thinking": "I need to explain all my symptoms clearly, even though I feel worried and a little embarrassed. I want to make sure the doctor understands that I'm not feeling right and that I'm really scared about t",
    "answer": "I’m 12, and I’m a boy. I’ve been feeling kinda sick for about a week now. I have a runny nose that won’t go away and a cough that’s not just a little, it’s like it’s getting worse, especially at night. Sometimes I cough so bad that I gasp for air for a few seconds, and I feel kind of tired all the time, even after sleeping. I also get a little fever, but it’s not very high, and I just feel really worn out. I’ve been around friends at school who are sick too, so I don’t know if I caught something or... I don’t know, maybe it’s worse than it seems.",
    "behavior_type": "anxious_amplifier",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient with health anxiety who amplifies symptoms",
      "modifiers": [
        "catastrophic_thinking",
        "symptom_amplification",
        "multiple_concerns"
      ],
      "empathy_cues": [
        "high_anxiety",
        "catastrophic_language",
        "reassurance_seeking",
        "fear_expression"
      ]
    },
    "gold_diagnosis": "Bordetella parapertussis"
  },
  {
    "vignette_index": 168,
    "input": "**PATIENT CHARACTER:** Patient with Bordetella parapertussis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 12-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A mild cough that started gradually, mainly in the evenings\n- A runny nose that has been persistent for about a week\n- A low-grade fever that comes and goes\n- Fatigue that makes you feel tired even after a full night's sleep\n- Several persistent coughing fits that sometimes leave you gasping for air\nThese symptoms began gradually over the past week, starting with just a runny nose and mild cough, but now the cough has become more persistent and frequent, especially at night. You tend to feel more tired than usual during the day and sometimes feel a little feverish, but it's not very high. You don’t have any significant breathing difficulty, but the coughing fits worry you because they last for several seconds. You are concerned because you’ve been in close contact with classmates who have had similar symptoms recently.Can you tell me more about what your cough is like during the day—how often you cough, whether it's dry or produces anything, and if there are specific times or things that make it better or worse?anxious_amplifier",
    "output": "THINKING: I'm really worried my cough is worse than I thought, especially the fits that make it hard to breathe, and I keep thinking it might be something really bad like whooping cough or something. I just wan\nANSWER: Well, during the day, I kinda cough a lot, especially in the evening, and it sometimes makes me gasp for air after the fits, and I don’t know if it’s supposed to do that or if it’s really bad.",
    "thinking": "I'm really worried my cough is worse than I thought, especially the fits that make it hard to breathe, and I keep thinking it might be something really bad like whooping cough or something. I just wan",
    "answer": "Well, during the day, I kinda cough a lot, especially in the evening, and it sometimes makes me gasp for air after the fits, and I don’t know if it’s supposed to do that or if it’s really bad.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 0,
    "gold_diagnosis": "Bordetella parapertussis"
  },
  {
    "vignette_index": 168,
    "input": "**PATIENT CHARACTER:** Patient with Bordetella parapertussis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 12-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A mild cough that started gradually, mainly in the evenings\n- A runny nose that has been persistent for about a week\n- A low-grade fever that comes and goes\n- Fatigue that makes you feel tired even after a full night's sleep\n- Several persistent coughing fits that sometimes leave you gasping for air\nThese symptoms began gradually over the past week, starting with just a runny nose and mild cough, but now the cough has become more persistent and frequent, especially at night. You tend to feel more tired than usual during the day and sometimes feel a little feverish, but it's not very high. You don’t have any significant breathing difficulty, but the coughing fits worry you because they last for several seconds. You are concerned because you’ve been in close contact with classmates who have had similar symptoms recently.Can you tell me exactly how often you cough during the day and night, what your cough sounds like—dry or mucus-producing—and if anything, like exercise, have you noticed makes it worse or better?anxious_amplifier",
    "output": "THINKING: I feel kind of worried and overwhelmed because my cough is really bad sometimes, like it just keeps going and I can't catch my breath, and I keep thinking what if something really terrible is wrong wi\nANSWER: Well, my cough is kind of like a weird sound, not dry exactly, but like I keep coughing a lot, especially at night, and it sometimes makes me gasp for air. It’s worse after playing or running around, but it’s pretty much the same most of the time now.",
    "thinking": "I feel kind of worried and overwhelmed because my cough is really bad sometimes, like it just keeps going and I can't catch my breath, and I keep thinking what if something really terrible is wrong wi",
    "answer": "Well, my cough is kind of like a weird sound, not dry exactly, but like I keep coughing a lot, especially at night, and it sometimes makes me gasp for air. It’s worse after playing or running around, but it’s pretty much the same most of the time now.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 2,
    "gold_diagnosis": "Bordetella parapertussis"
  },
  {
    "vignette_index": 168,
    "input": "**PATIENT CHARACTER:** Patient with Bordetella parapertussis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 12-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A mild cough that started gradually, mainly in the evenings\n- A runny nose that has been persistent for about a week\n- A low-grade fever that comes and goes\n- Fatigue that makes you feel tired even after a full night's sleep\n- Several persistent coughing fits that sometimes leave you gasping for air\nThese symptoms began gradually over the past week, starting with just a runny nose and mild cough, but now the cough has become more persistent and frequent, especially at night. You tend to feel more tired than usual during the day and sometimes feel a little feverish, but it's not very high. You don’t have any significant breathing difficulty, but the coughing fits worry you because they last for several seconds. You are concerned because you’ve been in close contact with classmates who have had similar symptoms recently.Can you tell me how many times you usually cough during the day and at night, and whether there are any moments when the coughing stops or gets better—that is, can you notice any patterns or specific times when it’s different?anxious_amplifier",
    "output": "THINKING: I'm worried about how often I cough—it's way more than before, and I feel like I can't breathe sometimes during the fits. I don’t know if it’s worse at night on purpose or if it just happens then beca\nANSWER: I think I cough a lot, especially at night, and sometimes I feel like I can’t catch my breath during the coughing fits, and I don’t really see a pattern, it just kind of happens all the time.",
    "thinking": "I'm worried about how often I cough—it's way more than before, and I feel like I can't breathe sometimes during the fits. I don’t know if it’s worse at night on purpose or if it just happens then beca",
    "answer": "I think I cough a lot, especially at night, and sometimes I feel like I can’t catch my breath during the coughing fits, and I don’t really see a pattern, it just kind of happens all the time.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 4,
    "gold_diagnosis": "Bordetella parapertussis"
  },
  {
    "vignette_index": 168,
    "input": "**PATIENT CHARACTER:** Patient with Bordetella parapertussis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 12-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A mild cough that started gradually, mainly in the evenings\n- A runny nose that has been persistent for about a week\n- A low-grade fever that comes and goes\n- Fatigue that makes you feel tired even after a full night's sleep\n- Several persistent coughing fits that sometimes leave you gasping for air\nThese symptoms began gradually over the past week, starting with just a runny nose and mild cough, but now the cough has become more persistent and frequent, especially at night. You tend to feel more tired than usual during the day and sometimes feel a little feverish, but it's not very high. You don’t have any significant breathing difficulty, but the coughing fits worry you because they last for several seconds. You are concerned because you’ve been in close contact with classmates who have had similar symptoms recently.Can you tell me exactly how many times you usually cough during the day and at night, and describe what your cough sounds like—does it feel dry, or do you think you're coughing up mucus—and are there particular things, like certain activities or times of day, that make your cough better or worse?anxious_amplifier",
    "output": "THINKING: I’m really worried that my cough might be something serious. It’s been worse at night and sometimes I feel like I can’t breathe right, which scares me a lot. I don’t know if it’s just a cold or if it \nANSWER: It’s like a cough that just keeps happening — especially when I’m lying down, and it sounds like a dry cough, but sometimes I feel like I’m coughing up stuff even though I don’t see anything. It’s worse at night and sometimes I have these crazy coughing fits that make me gasp for air, and I don’t know what’s wrong but it feels terrible.",
    "thinking": "I’m really worried that my cough might be something serious. It’s been worse at night and sometimes I feel like I can’t breathe right, which scares me a lot. I don’t know if it’s just a cold or if it",
    "answer": "It’s like a cough that just keeps happening — especially when I’m lying down, and it sounds like a dry cough, but sometimes I feel like I’m coughing up stuff even though I don’t see anything. It’s worse at night and sometimes I have these crazy coughing fits that make me gasp for air, and I don’t know what’s wrong but it feels terrible.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 6,
    "gold_diagnosis": "Bordetella parapertussis"
  },
  {
    "vignette_index": 168,
    "input": "**PATIENT CHARACTER:** Patient with Bordetella parapertussis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 12-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A mild cough that started gradually, mainly in the evenings\n- A runny nose that has been persistent for about a week\n- A low-grade fever that comes and goes\n- Fatigue that makes you feel tired even after a full night's sleep\n- Several persistent coughing fits that sometimes leave you gasping for air\nThese symptoms began gradually over the past week, starting with just a runny nose and mild cough, but now the cough has become more persistent and frequent, especially at night. You tend to feel more tired than usual during the day and sometimes feel a little feverish, but it's not very high. You don’t have any significant breathing difficulty, but the coughing fits worry you because they last for several seconds. You are concerned because you’ve been in close contact with classmates who have had similar symptoms recently.Can you tell me if your cough ever sounds like you're coughing up mucus or phlegm, and do you notice any changes in the way it sounds—like if it’s dry or more wet—and have you seen or felt any mucus or other things when you cough?anxious_amplifier",
    "output": "THINKING: I feel worried about whether my cough could be something worse, like maybe I'm coughing up stuff that I can't see or feel, and I don't really understand what all these sounds mean. I just know it’s be\nANSWER: Um, I don’t really feel like I’m coughing up anything good, sometimes it sounds wet but I don’t see any mucus, and other times it just feels dry but the cough still won’t stop. Like, it changes but it’s all pretty bad and scary.",
    "thinking": "I feel worried about whether my cough could be something worse, like maybe I'm coughing up stuff that I can't see or feel, and I don't really understand what all these sounds mean. I just know it’s be",
    "answer": "Um, I don’t really feel like I’m coughing up anything good, sometimes it sounds wet but I don’t see any mucus, and other times it just feels dry but the cough still won’t stop. Like, it changes but it’s all pretty bad and scary.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 8,
    "gold_diagnosis": "Bordetella parapertussis"
  },
  {
    "vignette_index": 168,
    "input": "**PATIENT CHARACTER:** Patient with Bordetella parapertussis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 12-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A mild cough that started gradually, mainly in the evenings\n- A runny nose that has been persistent for about a week\n- A low-grade fever that comes and goes\n- Fatigue that makes you feel tired even after a full night's sleep\n- Several persistent coughing fits that sometimes leave you gasping for air\nThese symptoms began gradually over the past week, starting with just a runny nose and mild cough, but now the cough has become more persistent and frequent, especially at night. You tend to feel more tired than usual during the day and sometimes feel a little feverish, but it's not very high. You don’t have any significant breathing difficulty, but the coughing fits worry you because they last for several seconds. You are concerned because you’ve been in close contact with classmates who have had similar symptoms recently.Can you tell me if, when you cough, you notice kind of thick mucus or phlegm coming up, or does your cough sound more like it’s just dry and scratchy—like without any mucus—so I can understand what your cough feels like from your side?anxious_amplifier",
    "output": "THINKING: I worry that my cough might be something really bad, maybe like whooping cough or something, especially because I have these coughing fits and I feel really tired all the time. I don’t really know wha\nANSWER: Um, I think my cough is more like just dry and scratchy, but sometimes I almost can’t stop and it makes me gasp, so I don’t know if there’s mucus or not. It just feels terrible when I cough a lot.",
    "thinking": "I worry that my cough might be something really bad, maybe like whooping cough or something, especially because I have these coughing fits and I feel really tired all the time. I don’t really know wha",
    "answer": "Um, I think my cough is more like just dry and scratchy, but sometimes I almost can’t stop and it makes me gasp, so I don’t know if there’s mucus or not. It just feels terrible when I cough a lot.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 10,
    "gold_diagnosis": "Bordetella parapertussis"
  },
  {
    "vignette_index": 168,
    "input": "**PATIENT CHARACTER:** Patient with Bordetella parapertussis\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 12-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- A mild cough that started gradually, mainly in the evenings\n- A runny nose that has been persistent for about a week\n- A low-grade fever that comes and goes\n- Fatigue that makes you feel tired even after a full night's sleep\n- Several persistent coughing fits that sometimes leave you gasping for air\nThese symptoms began gradually over the past week, starting with just a runny nose and mild cough, but now the cough has become more persistent and frequent, especially at night. You tend to feel more tired than usual during the day and sometimes feel a little feverish, but it's not very high. You don’t have any significant breathing difficulty, but the coughing fits worry you because they last for several seconds. You are concerned because you’ve been in close contact with classmates who have had similar symptoms recently.Have you noticed if your breathing suddenly gets better after you use an inhaler or breathe in some medicine, or does your cough sometimes get worse during certain times, like at night or after exercise, which might suggest your airways are more closed off than usual?anxious_amplifier",
    "output": "THINKING: I feel worried because I don't know if the medicine is helping or not. Sometimes I think my breathing gets worse after I cough or at night, and I really don’t want it to get worse or for something bad\nANSWER: Uh, sometimes I feel like my breathing gets worse after I cough, especially at night or if I run around a little, and I don’t know if the inhaler is really helping or if it’s just gonna keep getting worse.",
    "thinking": "I feel worried because I don't know if the medicine is helping or not. Sometimes I think my breathing gets worse after I cough or at night, and I really don’t want it to get worse or for something bad",
    "answer": "Uh, sometimes I feel like my breathing gets worse after I cough, especially at night or if I run around a little, and I don’t know if the inhaler is really helping or if it’s just gonna keep getting worse.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 12,
    "gold_diagnosis": "Bordetella parapertussis"
  }
]