[
  {
    "vignette_index": 134,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.",
    "output": "THINKING: The doctor is asking why I’ve decided to come in now. I probably should mention my symptoms but don’t want to overreact or seem like I’m making a big deal out of it. I’ve been dealing with this for a \nANSWER: Well, I’m 45 and a woman. I’ve had this kind of dull ache and a bit of blurry vision in my right eye for, I guess, about two weeks now. It’s not terrible, but it’s enough that I thought maybe I should get it checked. I had a little accident with my eye a while back, and I had some surgery in my other eye a couple of years ago, so I was worried it might be related to that or something. It’s just been feeling a bit gritty and the blurriness bothers me when I try to read or look at screens. Not sure if it’s serious or what, but I thought I should come in and ask someone about it.",
    "thinking": "The doctor is asking why I’ve decided to come in now. I probably should mention my symptoms but don’t want to overreact or seem like I’m making a big deal out of it. I’ve been dealing with this for a",
    "answer": "Well, I’m 45 and a woman. I’ve had this kind of dull ache and a bit of blurry vision in my right eye for, I guess, about two weeks now. It’s not terrible, but it’s enough that I thought maybe I should get it checked. I had a little accident with my eye a while back, and I had some surgery in my other eye a couple of years ago, so I was worried it might be related to that or something. It’s just been feeling a bit gritty and the blurriness bothers me when I try to read or look at screens. Not sure if it’s serious or what, but I thought I should come in and ask someone about it.",
    "behavior_type": "stoic_minimizer",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient who downplays symptoms and delays care",
      "modifiers": [
        "symptom_minimization",
        "delayed_care_seeking",
        "tough_attitude"
      ],
      "empathy_cues": [
        "downplaying",
        "reluctance",
        "pride_in_toughness",
        "external_pressure"
      ]
    },
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.\"Can you tell me if your vision has ever suddenly gotten worse or if you've noticed any flashes, floaters, or spots along with the blurry vision? How do you really feel your eye is doing overall?\"stoic_minimizer",
    "output": "THINKING: I don't want to make a big deal out of it, but I guess my vision isn't as clear as before. I’ve had some discomfort and minor flashes here and there, but I just thought it was nothing serious.\nANSWER: Honestly, my vision’s a little blurry, and I’ve been feeling a sort of ache and grit in that eye, but I don’t really notice anything like flashes or spots all the time. It’s not that bad, I guess, but I thought I should check just in case.",
    "thinking": "I don't want to make a big deal out of it, but I guess my vision isn't as clear as before. I’ve had some discomfort and minor flashes here and there, but I just thought it was nothing serious.",
    "answer": "Honestly, my vision’s a little blurry, and I’ve been feeling a sort of ache and grit in that eye, but I don’t really notice anything like flashes or spots all the time. It’s not that bad, I guess, but I thought I should check just in case.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 0,
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.Can you tell me if you've noticed any sudden flashes of light, floaters, or a curtain-like shadow in your vision, even if you haven't mentioned them before?stoic_minimizer",
    "output": "THINKING: The doctor is asking about specific visual symptoms, but I’m not sure if I’ve experienced any of those exactly, or if what I notice counts. I don’t want to overreact, but maybe I should mention someth\nANSWER: Honestly, I don’t think I’ve seen any flashes or curtains or anything like that. It’s mostly just some blurriness and a mild ache, but I’ve had that for a little while now.",
    "thinking": "The doctor is asking about specific visual symptoms, but I’m not sure if I’ve experienced any of those exactly, or if what I notice counts. I don’t want to overreact, but maybe I should mention someth",
    "answer": "Honestly, I don’t think I’ve seen any flashes or curtains or anything like that. It’s mostly just some blurriness and a mild ache, but I’ve had that for a little while now.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 2,
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.Have you noticed any sudden flashes of light, moving specks (floaters), or a curtain or shadow in your vision at any point, even if you didn’t think they were important?stoic_minimizer",
    "output": "THINKING: The doctor is asking about visual disturbances like flashes or shadows, which could be serious, but I don’t want to make a big deal. I’ve been dealing with some blurry vision and achiness, but I’m not\nANSWER: I don’t think so, I haven’t really seen anything like flashes or shadows, just some blurry bits when I look at screens and my eye feels kinda gritty. It’s probably nothing, I’ve had some discomfort for a while now.",
    "thinking": "The doctor is asking about visual disturbances like flashes or shadows, which could be serious, but I don’t want to make a big deal. I’ve been dealing with some blurry vision and achiness, but I’m not",
    "answer": "I don’t think so, I haven’t really seen anything like flashes or shadows, just some blurry bits when I look at screens and my eye feels kinda gritty. It’s probably nothing, I’ve had some discomfort for a while now.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 4,
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.Have you ever noticed brief flashes of light, moving shadows, or a curtain-like effect in your vision, even if they seem minor or come and go?stoic_minimizer",
    "output": "THINKING: I think the doctor is asking about something that might be more serious, but honestly, I haven't really noticed anything like that. Maybe I just haven't paid enough attention, or I don’t want to make \nANSWER: Oh, I don't think so. I mean, I haven't really seen flashes or shadows or anything like that, so I don’t know if it’s a big deal.",
    "thinking": "I think the doctor is asking about something that might be more serious, but honestly, I haven't really noticed anything like that. Maybe I just haven't paid enough attention, or I don’t want to make",
    "answer": "Oh, I don't think so. I mean, I haven't really seen flashes or shadows or anything like that, so I don’t know if it’s a big deal.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 6,
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.Have you noticed any sudden flashes of light, moving specks (floaters), or a curtain-like shadow in your vision at any point, even if you didn’t think they were important?stoic_minimizer",
    "output": "THINKING: I don’t want to overthink it, but I’ve noticed some flickering and a little shadow thing sometimes, so I guess I should mention it, even if I think it’s probably nothing. I just don’t want to make a b\nANSWER: Yeah, I think I did see some flashes of light and a shadow or curtain thing once, but I don’t know if it’s a big deal or not. It kind of came and went.",
    "thinking": "I don’t want to overthink it, but I’ve noticed some flickering and a little shadow thing sometimes, so I guess I should mention it, even if I think it’s probably nothing. I just don’t want to make a b",
    "answer": "Yeah, I think I did see some flashes of light and a shadow or curtain thing once, but I don’t know if it’s a big deal or not. It kind of came and went.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 8,
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.Can you tell me if the flashes or shadows you've seen change or move when you move your eyes or head, and whether they tend to come and go quickly or stay in the same place?stoic_minimizer",
    "output": "THINKING: I’m honestly not sure if it moves or just stays there. It kind of comes and goes, but I’ve noticed it more when I look in certain ways. I don’t want to make a big deal out of it, but I figured I shoul\nANSWER: They kind of come and go, and I guess they don't really move much when I look around, but I’m not really sure. They just seem to be there sometimes.",
    "thinking": "I’m honestly not sure if it moves or just stays there. It kind of comes and goes, but I’ve noticed it more when I look in certain ways. I don’t want to make a big deal out of it, but I figured I shoul",
    "answer": "They kind of come and go, and I guess they don't really move much when I look around, but I’m not really sure. They just seem to be there sometimes.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 10,
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.Can you tell me if the flashes of light, shadows, or other visual experiences you've noticed tend to happen frequently or last for longer periods, even if you didn't mention this before, and whether they seem to be getting worse or more persistent over time?stoic_minimizer",
    "output": "THINKING: I don’t want to seem like I’m overly worried or make a big fuss. I’ve been dealing with this for a little while and it’s not that bad, but I guess I should mention it since it’s been getting a bit wor\nANSWER: Well, I’ve noticed the flashes of light and shadows sometimes, but it’s not all the time. They haven’t really lasted longer or gotten super bad, maybe a little more often, I guess, but I’ve been putting this off because I thought it would just go away.",
    "thinking": "I don’t want to seem like I’m overly worried or make a big fuss. I’ve been dealing with this for a little while and it’s not that bad, but I guess I should mention it since it’s been getting a bit wor",
    "answer": "Well, I’ve noticed the flashes of light and shadows sometimes, but it’s not all the time. They haven’t really lasted longer or gotten super bad, maybe a little more often, I guess, but I’ve been putting this off because I thought it would just go away.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 12,
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.Can you describe whether the flashes of light, shadows, or floaters you've noticed lately are persistent, come and go, or seem to be getting worse over time, even if you didn't mention this before?stoic_minimizer",
    "output": "THINKING: I don't want to overreact or make a big deal out of this. It’s been bothering me gradually, but I figure it’s probably nothing serious or it’ll go away on its own. Still, I guess I should mention it s\nANSWER: Um, the flashes and shadows or floaters, I’ve noticed they come and go, but I don’t think they’ve been getting worse fast or anything. It’s just a little there sometimes.",
    "thinking": "I don't want to overreact or make a big deal out of this. It’s been bothering me gradually, but I figure it’s probably nothing serious or it’ll go away on its own. Still, I guess I should mention it s",
    "answer": "Um, the flashes and shadows or floaters, I’ve noticed they come and go, but I don’t think they’ve been getting worse fast or anything. It’s just a little there sometimes.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 14,
    "gold_diagnosis": "Sympathetic uveitis"
  },
  {
    "vignette_index": 134,
    "input": "**PATIENT CHARACTER:** Patient with Sympathetic uveitis\n\nYou are a patient: You are 45 years old and your biological gender is female.\nYou are experiencing the following symptoms:\n- Mild discomfort in your right eye, feeling a bit achy and gritty\n- Slight visual blurring, especially when trying to read or look at screens\n- Presence of small keratitic precipitates on the cornea, noticed during a recent eye exam\n- Minimal redness around the eye, but no significant swelling or discharge\nThese symptoms came into fruition gradually over the past two weeks, starting with just a dull ache and mild blurriness, which has slowly worsened. You have a history of ocular trauma from a minor car accident about six months ago, and you underwent intraocular surgery in your left eye two years ago. You’re concerned because you’ve read that inflammation can sometimes be delayed after injury or surgery, and you're worried about whether this will affect your vision long-term.Have you noticed if your vision suddenly worsens, especially if you see a large dark shadow or curtain blocking part of your field of view, or if flashes and floaters suddenly become more intense or persistent?stoic_minimizer",
    "output": "THINKING: The doctor is asking about sudden changes or flashes which I haven't really noticed. I mostly just have this dull ache and some blurry stuff, so I don't want to make a big deal out of it, but I guess \nANSWER: No, I haven't seen any big shadows or flashes or anything like that. Just the slight blurring and feeling a bit achy, but nothing sudden or super noticeable like that.",
    "thinking": "The doctor is asking about sudden changes or flashes which I haven't really noticed. I mostly just have this dull ache and some blurry stuff, so I don't want to make a big deal out of it, but I guess",
    "answer": "No, I haven't seen any big shadows or flashes or anything like that. Just the slight blurring and feeling a bit achy, but nothing sudden or super noticeable like that.",
    "behavior_type": "stoic_minimizer",
    "turn_count": 16,
    "gold_diagnosis": "Sympathetic uveitis"
  }
]