[
  {
    "vignette_index": 200,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Volatile inhalant-induced delirium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 68 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Alteration of attention and consciousness\n- Cognitive impairment, including confusion and forgetfulness\n- Reduced ability to focus or shift attention\n- Psychomotor disturbances, such as pacing back and forth and restlessness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I accidentally inhaled some spray I found in my garage, thinking it was just a cleaning product. Since then, I’ve felt very confused, unable to concentrate on anything, and I keep pacing around the room without really knowing why. I also feel a bit drowsy but sometimes get hyperactive for no reason. It’s happening pretty quickly, and I’m worried because I don’t feel like myself at all.",
    "output": "THINKING: I'm going to explain what happened clearly and honestly, mentioning how sudden it was and how strange I feel. I should emphasize that I don't understand what's happening and that it's worrying me.\nANSWER: Well, doctor, I’m 68, and I’m a man. Yesterday, I was just in my garage, looking for something, and I saw this spray can, which I thought was just a cleaner. Turns out, I think I might have inhaled some of it by mistake because I started feeling all weird—like I couldn’t really focus or remember things, and I kept pacing around like I was jittery or something. It all came on suddenly, and I’ve never felt like this before, so I guess I just came because I don’t know what’s happening to me.",
    "thinking": "I'm going to explain what happened clearly and honestly, mentioning how sudden it was and how strange I feel. I should emphasize that I don't understand what's happening and that it's worrying me.",
    "answer": "Well, doctor, I’m 68, and I’m a man. Yesterday, I was just in my garage, looking for something, and I saw this spray can, which I thought was just a cleaner. Turns out, I think I might have inhaled some of it by mistake because I started feeling all weird—like I couldn’t really focus or remember things, and I kept pacing around like I was jittery or something. It all came on suddenly, and I’ve never felt like this before, so I guess I just came because I don’t know what’s happening to me.",
    "behavior_type": "tangential_storyteller",
    "behavior_config": {
      "weight": 0.08,
      "description": "Patient who includes irrelevant details and stories",
      "modifiers": [
        "excessive_details",
        "family_stories",
        "tangential_information"
      ],
      "empathy_cues": [
        "storytelling",
        "context_sharing",
        "social_needs",
        "relationship_focus"
      ]
    },
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  },
  {
    "vignette_index": 200,
    "input": "**PATIENT CHARACTER:** Patient with Volatile inhalant-induced delirium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 68 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Alteration of attention and consciousness\n- Cognitive impairment, including confusion and forgetfulness\n- Reduced ability to focus or shift attention\n- Psychomotor disturbances, such as pacing back and forth and restlessness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I accidentally inhaled some spray I found in my garage, thinking it was just a cleaning product. Since then, I’ve felt very confused, unable to concentrate on anything, and I keep pacing around the room without really knowing why. I also feel a bit drowsy but sometimes get hyperactive for no reason. It’s happening pretty quickly, and I’m worried because I don’t feel like myself at all.Can you tell me if these feelings of being \"weird\" and the memory or focus difficulties are still happening now, or have they improved or gone away since the incident?tangential_storyteller",
    "output": "THINKING: I'm not really sure if it's better or worse now, I guess it still feels pretty weird, like my mind's all foggy. I mean, I was trying to fix the leaky faucet in the laundry room earlier, but I kept los\nANSWER: No, I don't think it's gone away, really. It’s kinda the same, I think. I was just sitting here for a bit and suddenly started feeling all jittery and kinda spaced out again. My wife said I looked like I was somewhere else, but I don't remember leaving the room.",
    "thinking": "I'm not really sure if it's better or worse now, I guess it still feels pretty weird, like my mind's all foggy. I mean, I was trying to fix the leaky faucet in the laundry room earlier, but I kept los",
    "answer": "No, I don't think it's gone away, really. It’s kinda the same, I think. I was just sitting here for a bit and suddenly started feeling all jittery and kinda spaced out again. My wife said I looked like I was somewhere else, but I don't remember leaving the room.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 0,
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  },
  {
    "vignette_index": 200,
    "input": "**PATIENT CHARACTER:** Patient with Volatile inhalant-induced delirium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 68 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Alteration of attention and consciousness\n- Cognitive impairment, including confusion and forgetfulness\n- Reduced ability to focus or shift attention\n- Psychomotor disturbances, such as pacing back and forth and restlessness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I accidentally inhaled some spray I found in my garage, thinking it was just a cleaning product. Since then, I’ve felt very confused, unable to concentrate on anything, and I keep pacing around the room without really knowing why. I also feel a bit drowsy but sometimes get hyperactive for no reason. It’s happening pretty quickly, and I’m worried because I don’t feel like myself at all.Can you tell me more about how you're feeling now—are you still having these feelings of being \"weird\" or trouble focusing, and how do they compare to how you felt right after the inhalation?tangential_storyteller",
    "output": "THINKING: I'm trying to remember how I felt right after inhaling the spray, but it's all jumbled in my head. I keep thinking about my late wife’s cousin who had similar episodes after medication, and that’s mak\nANSWER: Well, I don’t know, really. Right after I did it, I felt kinda dizzy and foggy, but then it got worse, and now I can’t seem to focus or remember stuff. It’s like I’m in a fog, and I keep pacing around because I don’t know what to do, and I’m worried it’s not gonna go away.",
    "thinking": "I'm trying to remember how I felt right after inhaling the spray, but it's all jumbled in my head. I keep thinking about my late wife’s cousin who had similar episodes after medication, and that’s mak",
    "answer": "Well, I don’t know, really. Right after I did it, I felt kinda dizzy and foggy, but then it got worse, and now I can’t seem to focus or remember stuff. It’s like I’m in a fog, and I keep pacing around because I don’t know what to do, and I’m worried it’s not gonna go away.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 2,
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  },
  {
    "vignette_index": 200,
    "input": "**PATIENT CHARACTER:** Patient with Volatile inhalant-induced delirium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 68 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Alteration of attention and consciousness\n- Cognitive impairment, including confusion and forgetfulness\n- Reduced ability to focus or shift attention\n- Psychomotor disturbances, such as pacing back and forth and restlessness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I accidentally inhaled some spray I found in my garage, thinking it was just a cleaning product. Since then, I’ve felt very confused, unable to concentrate on anything, and I keep pacing around the room without really knowing why. I also feel a bit drowsy but sometimes get hyperactive for no reason. It’s happening pretty quickly, and I’m worried because I don’t feel like myself at all.Can you tell me exactly when these feelings of being \"weird\" or having trouble focusing first started, and how they've changed or stayed the same since that time?tangential_storyteller",
    "output": "THINKING: I want to tell him the truth but also might waffle a bit because honestly I don’t really remember exactly and my head’s been all over the place since this happened. I keep thinking about how my wife k\nANSWER: Well, it’s hard to say exactly, but I think it started yesterday when I was in the garage and I was trying to get some garden tools, and I saw that spray can, which I thought was some kind of cleaner. I guess that’s when it all began, but I’ve been so scattered ever since, I don’t remember if it’s gotten worse or if it’s just the same.",
    "thinking": "I want to tell him the truth but also might waffle a bit because honestly I don’t really remember exactly and my head’s been all over the place since this happened. I keep thinking about how my wife k",
    "answer": "Well, it’s hard to say exactly, but I think it started yesterday when I was in the garage and I was trying to get some garden tools, and I saw that spray can, which I thought was some kind of cleaner. I guess that’s when it all began, but I’ve been so scattered ever since, I don’t remember if it’s gotten worse or if it’s just the same.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 4,
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  },
  {
    "vignette_index": 200,
    "input": "**PATIENT CHARACTER:** Patient with Volatile inhalant-induced delirium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 68 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Alteration of attention and consciousness\n- Cognitive impairment, including confusion and forgetfulness\n- Reduced ability to focus or shift attention\n- Psychomotor disturbances, such as pacing back and forth and restlessness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I accidentally inhaled some spray I found in my garage, thinking it was just a cleaning product. Since then, I’ve felt very confused, unable to concentrate on anything, and I keep pacing around the room without really knowing why. I also feel a bit drowsy but sometimes get hyperactive for no reason. It’s happening pretty quickly, and I’m worried because I don’t feel like myself at all.Can you tell me if you've experienced any physical symptoms like dizziness, weakness, or disorientation since the incident, and how these have changed over time—whether they’ve stayed the same, gotten better, or worse?tangential_storyteller",
    "output": "THINKING: This just happened yesterday, and honestly, I feel like I’ve been losing my mind a little. It’s not like I’m used to being this restless or forgetful, and I keep thinking about my brother—he had some \nANSWER: Well, I think the symptoms are the same because I haven’t felt any different today—it’s like, I start pacing and then I forget what I was doing or what I was supposed to be thinking about. I guess I feel a bit more tired now, but I still can’t focus or stop moving, so it’s kinda all jumbled up in my head.",
    "thinking": "This just happened yesterday, and honestly, I feel like I’ve been losing my mind a little. It’s not like I’m used to being this restless or forgetful, and I keep thinking about my brother—he had some",
    "answer": "Well, I think the symptoms are the same because I haven’t felt any different today—it’s like, I start pacing and then I forget what I was doing or what I was supposed to be thinking about. I guess I feel a bit more tired now, but I still can’t focus or stop moving, so it’s kinda all jumbled up in my head.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 6,
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  },
  {
    "vignette_index": 200,
    "input": "**PATIENT CHARACTER:** Patient with Volatile inhalant-induced delirium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 68 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Alteration of attention and consciousness\n- Cognitive impairment, including confusion and forgetfulness\n- Reduced ability to focus or shift attention\n- Psychomotor disturbances, such as pacing back and forth and restlessness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I accidentally inhaled some spray I found in my garage, thinking it was just a cleaning product. Since then, I’ve felt very confused, unable to concentrate on anything, and I keep pacing around the room without really knowing why. I also feel a bit drowsy but sometimes get hyperactive for no reason. It’s happening pretty quickly, and I’m worried because I don’t feel like myself at all.Did you notice any physical symptoms during or after the inhalation, like feeling dizzy, weak, or disoriented—things that made you feel like your body wasn’t working quite right?tangential_storyteller",
    "output": "THINKING: I’m trying to remember if I felt anything strange right after I took in that spray, but honestly, I was rushing around, fixing the grill outside because my grandson was supposed to come over, and I ju\nANSWER: Well, yeah, I do think I felt kinda dizzy when it first started, but honestly, I was so busy outside thinking about the yard and my grandson coming in an hour, I didn’t really pay close attention. I just remember feeling real foggy and like I couldn’t sit still, and I kept pacing back and forth, like I was wired but also tired at the same time.",
    "thinking": "I’m trying to remember if I felt anything strange right after I took in that spray, but honestly, I was rushing around, fixing the grill outside because my grandson was supposed to come over, and I ju",
    "answer": "Well, yeah, I do think I felt kinda dizzy when it first started, but honestly, I was so busy outside thinking about the yard and my grandson coming in an hour, I didn’t really pay close attention. I just remember feeling real foggy and like I couldn’t sit still, and I kept pacing back and forth, like I was wired but also tired at the same time.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 8,
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  },
  {
    "vignette_index": 200,
    "input": "**PATIENT CHARACTER:** Patient with Volatile inhalant-induced delirium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 68 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Alteration of attention and consciousness\n- Cognitive impairment, including confusion and forgetfulness\n- Reduced ability to focus or shift attention\n- Psychomotor disturbances, such as pacing back and forth and restlessness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I accidentally inhaled some spray I found in my garage, thinking it was just a cleaning product. Since then, I’ve felt very confused, unable to concentrate on anything, and I keep pacing around the room without really knowing why. I also feel a bit drowsy but sometimes get hyperactive for no reason. It’s happening pretty quickly, and I’m worried because I don’t feel like myself at all.Can you tell me if, at the time you inhaled the spray can or shortly afterward, you experienced any specific physical symptoms like feeling dizzy, weak, disoriented, or like your body wasn’t quite working right?tangential_storyteller",
    "output": "THINKING: I wonder if something I inhaled really did this because I did feel really strange afterward, like I couldn't think straight or focus. But I was also thinking about my grandson's wedding last weekend, \nANSWER: Well, when I took a sniff of that spray in the garage, I did start feeling kind of weird right after, like my head was foggy or something, and I couldn't focus on anything. Then I kept pacing around because I didn't know what was wrong, and sometimes I just felt all jumpy, even though I was tired too.",
    "thinking": "I wonder if something I inhaled really did this because I did feel really strange afterward, like I couldn't think straight or focus. But I was also thinking about my grandson's wedding last weekend,",
    "answer": "Well, when I took a sniff of that spray in the garage, I did start feeling kind of weird right after, like my head was foggy or something, and I couldn't focus on anything. Then I kept pacing around because I didn't know what was wrong, and sometimes I just felt all jumpy, even though I was tired too.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 10,
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  },
  {
    "vignette_index": 200,
    "input": "**PATIENT CHARACTER:** Patient with Volatile inhalant-induced delirium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 68 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Alteration of attention and consciousness\n- Cognitive impairment, including confusion and forgetfulness\n- Reduced ability to focus or shift attention\n- Psychomotor disturbances, such as pacing back and forth and restlessness\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I accidentally inhaled some spray I found in my garage, thinking it was just a cleaning product. Since then, I’ve felt very confused, unable to concentrate on anything, and I keep pacing around the room without really knowing why. I also feel a bit drowsy but sometimes get hyperactive for no reason. It’s happening pretty quickly, and I’m worried because I don’t feel like myself at all.Have you noticed any weakness in your arms or legs, difficulty walking steadily, or any seizure-like movements since the incident?tangential_storyteller",
    "output": "THINKING: I’m trying to remember if I’ve felt anything like this before or if anyone else in the family had some weird episodes. I mean, my brother once fainted after working with paint fumes, but this is diffe\nANSWER: Well, I don’t think I’ve noticed any weakness in my arms or legs or anything like that, but I do get very confused and lost my train of thought easily. I’ve just been pacing around like an old restless dog, and I can’t seem to focus on anything, but I don’t really remember if I was doing anything weird before it started.",
    "thinking": "I’m trying to remember if I’ve felt anything like this before or if anyone else in the family had some weird episodes. I mean, my brother once fainted after working with paint fumes, but this is diffe",
    "answer": "Well, I don’t think I’ve noticed any weakness in my arms or legs or anything like that, but I do get very confused and lost my train of thought easily. I’ve just been pacing around like an old restless dog, and I can’t seem to focus on anything, but I don’t really remember if I was doing anything weird before it started.",
    "behavior_type": "tangential_storyteller",
    "turn_count": 12,
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  }
]