[
  {
    "vignette_index": 190,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Schizophrenia or other primary psychotic disorders, unspecified\n\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Hearing voices that no one else seems to hear, which tell you you're being watched and judged.\n- Having bizarre, disorganized thoughts that make it hard to keep a conversation going or understand what you're saying.\n- Showing little emotion or motivation, often seeming detached and uninterested in activities you used to enjoy.\n- Occasionally becoming agitated or suspicious, feeling that people are plotting against you.\n- Struggling with insomnia, lying awake at night for hours, feeling restless but also exhausted.\nThese symptoms came into fruition gradually over the past month, starting with the voices and disorganized thoughts, then worsening with social withdrawal and sleep difficulties.",
    "output": "THINKING: I need to explain my feelings clearly, but it’s hard because I feel like everything is all mixed up. I should mention the symptoms started a while ago, maybe a month ago, and they just keep getting wo\nANSWER: I guess I came because I’ve been hearing stuff, like voices, and I think people are watching me or judging me or something. It’s been going on for a while—maybe last week, or I think it was earlier? I don’t know, but I’ve also been feeling kind of numb and not really interested in anything, and I can’t sleep at night, just lying there feeling weird.",
    "thinking": "I need to explain my feelings clearly, but it’s hard because I feel like everything is all mixed up. I should mention the symptoms started a while ago, maybe a month ago, and they just keep getting wo",
    "answer": "I guess I came because I’ve been hearing stuff, like voices, and I think people are watching me or judging me or something. It’s been going on for a while—maybe last week, or I think it was earlier? I don’t know, but I’ve also been feeling kind of numb and not really interested in anything, and I can’t sleep at night, just lying there feeling weird.",
    "behavior_type": "chronology_confused",
    "behavior_config": {
      "weight": 0.1,
      "description": "Patient confused about symptom timing and progression",
      "modifiers": [
        "timeline_confusion",
        "sequence_uncertainty"
      ],
      "empathy_cues": [
        "confusion",
        "uncertainty",
        "memory_issues",
        "needs_patience"
      ]
    },
    "gold_diagnosis": "Schizophrenia or other primary psychotic disorders, unspecified"
  },
  {
    "vignette_index": 190,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia or other primary psychotic disorders, unspecified\n\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Hearing voices that no one else seems to hear, which tell you you're being watched and judged.\n- Having bizarre, disorganized thoughts that make it hard to keep a conversation going or understand what you're saying.\n- Showing little emotion or motivation, often seeming detached and uninterested in activities you used to enjoy.\n- Occasionally becoming agitated or suspicious, feeling that people are plotting against you.\n- Struggling with insomnia, lying awake at night for hours, feeling restless but also exhausted.\nThese symptoms came into fruition gradually over the past month, starting with the voices and disorganized thoughts, then worsening with social withdrawal and sleep difficulties.Can you tell me more about when you first started noticing these feelings and experiences, and how they have been changing for you over time?chronology_confused",
    "output": "THINKING: I'm trying to figure out how long I've been feeling like this. The voices and all the confusing thoughts started sometime last month, I think, but maybe it was a little longer or shorter. I can't real\nANSWER: Uh, I think it was last month... or maybe a little before that? The voices started, and then I just felt more like I didn't care or wanna do anything anymore, but I’d get, like, restless at night and not sleep. It’s all kind of blurry now.",
    "thinking": "I'm trying to figure out how long I've been feeling like this. The voices and all the confusing thoughts started sometime last month, I think, but maybe it was a little longer or shorter. I can't real",
    "answer": "Uh, I think it was last month... or maybe a little before that? The voices started, and then I just felt more like I didn't care or wanna do anything anymore, but I’d get, like, restless at night and not sleep. It’s all kind of blurry now.",
    "behavior_type": "chronology_confused",
    "turn_count": 0,
    "gold_diagnosis": "Schizophrenia or other primary psychotic disorders, unspecified"
  },
  {
    "vignette_index": 190,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia or other primary psychotic disorders, unspecified\n\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Hearing voices that no one else seems to hear, which tell you you're being watched and judged.\n- Having bizarre, disorganized thoughts that make it hard to keep a conversation going or understand what you're saying.\n- Showing little emotion or motivation, often seeming detached and uninterested in activities you used to enjoy.\n- Occasionally becoming agitated or suspicious, feeling that people are plotting against you.\n- Struggling with insomnia, lying awake at night for hours, feeling restless but also exhausted.\nThese symptoms came into fruition gradually over the past month, starting with the voices and disorganized thoughts, then worsening with social withdrawal and sleep difficulties.Can you tell me more about when you first started noticing these experiences and how they have changed or stayed the same since then?chronology_confused",
    "output": "THINKING: I feel a bit overwhelmed trying to explain when everything started and how it changed. I think it was last week... or maybe two weeks ago? It’s all kind of blurry in my mind. The voices started first,\nANSWER: Um, I think maybe it was last week or two weeks ago that I started hearing voices, and then my thoughts got all jumbled or something, and I just kept feeling worse since then. I don’t really remember exactly how it all started, it just sort of happened, you know?",
    "thinking": "I feel a bit overwhelmed trying to explain when everything started and how it changed. I think it was last week... or maybe two weeks ago? It’s all kind of blurry in my mind. The voices started first,",
    "answer": "Um, I think maybe it was last week or two weeks ago that I started hearing voices, and then my thoughts got all jumbled or something, and I just kept feeling worse since then. I don’t really remember exactly how it all started, it just sort of happened, you know?",
    "behavior_type": "chronology_confused",
    "turn_count": 2,
    "gold_diagnosis": "Schizophrenia or other primary psychotic disorders, unspecified"
  },
  {
    "vignette_index": 190,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia or other primary psychotic disorders, unspecified\n\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Hearing voices that no one else seems to hear, which tell you you're being watched and judged.\n- Having bizarre, disorganized thoughts that make it hard to keep a conversation going or understand what you're saying.\n- Showing little emotion or motivation, often seeming detached and uninterested in activities you used to enjoy.\n- Occasionally becoming agitated or suspicious, feeling that people are plotting against you.\n- Struggling with insomnia, lying awake at night for hours, feeling restless but also exhausted.\nThese symptoms came into fruition gradually over the past month, starting with the voices and disorganized thoughts, then worsening with social withdrawal and sleep difficulties.Can you tell me about any specific moments or times when you first remember feeling really different or noticing these experiences, and how things have changed or stayed the same since then?chronology_confused",
    "output": "THINKING: I’m trying to think about when I first noticed things felt weird, but honestly, I don’t remember exactly when it all started. It kind of just sneaked up on me, I guess. I feel pretty overwhelmed and a\nANSWER: I think it was last month… or maybe a little before that? Like I started hearing stuff, and then I just didn’t really feel the same, but I don’t know exactly when it all changed.",
    "thinking": "I’m trying to think about when I first noticed things felt weird, but honestly, I don’t remember exactly when it all started. It kind of just sneaked up on me, I guess. I feel pretty overwhelmed and a",
    "answer": "I think it was last month… or maybe a little before that? Like I started hearing stuff, and then I just didn’t really feel the same, but I don’t know exactly when it all changed.",
    "behavior_type": "chronology_confused",
    "turn_count": 4,
    "gold_diagnosis": "Schizophrenia or other primary psychotic disorders, unspecified"
  },
  {
    "vignette_index": 190,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia or other primary psychotic disorders, unspecified\n\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Hearing voices that no one else seems to hear, which tell you you're being watched and judged.\n- Having bizarre, disorganized thoughts that make it hard to keep a conversation going or understand what you're saying.\n- Showing little emotion or motivation, often seeming detached and uninterested in activities you used to enjoy.\n- Occasionally becoming agitated or suspicious, feeling that people are plotting against you.\n- Struggling with insomnia, lying awake at night for hours, feeling restless but also exhausted.\nThese symptoms came into fruition gradually over the past month, starting with the voices and disorganized thoughts, then worsening with social withdrawal and sleep difficulties.Can you tell me if you’ve noticed any changes in your mood, like feeling really sad, low, or even a bit high or irritable, around the times when you heard the voices or felt watched, or do you think those feelings have always kind of been there?chronology_confused",
    "output": "THINKING: I'm not really sure about when I started feeling more sad or irritable. I think maybe it was around the same time the voices got worse, but it’s all sort of blurry. I just feel kind of off most of the\nANSWER: I dunno, maybe it was last week... or maybe two weeks ago? Everything's kinda mixed up in my head, and I don’t remember exactly when I started feeling more low or whatever.",
    "thinking": "I'm not really sure about when I started feeling more sad or irritable. I think maybe it was around the same time the voices got worse, but it’s all sort of blurry. I just feel kind of off most of the",
    "answer": "I dunno, maybe it was last week... or maybe two weeks ago? Everything's kinda mixed up in my head, and I don’t remember exactly when I started feeling more low or whatever.",
    "behavior_type": "chronology_confused",
    "turn_count": 6,
    "gold_diagnosis": "Schizophrenia or other primary psychotic disorders, unspecified"
  },
  {
    "vignette_index": 190,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia or other primary psychotic disorders, unspecified\n\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Hearing voices that no one else seems to hear, which tell you you're being watched and judged.\n- Having bizarre, disorganized thoughts that make it hard to keep a conversation going or understand what you're saying.\n- Showing little emotion or motivation, often seeming detached and uninterested in activities you used to enjoy.\n- Occasionally becoming agitated or suspicious, feeling that people are plotting against you.\n- Struggling with insomnia, lying awake at night for hours, feeling restless but also exhausted.\nThese symptoms came into fruition gradually over the past month, starting with the voices and disorganized thoughts, then worsening with social withdrawal and sleep difficulties.Can you tell me more about whether you’ve noticed changes or feelings in your mood—like feeling very sad, low, or even a bit irritable—that happened before or along with the voices and feelings of being watched?chronology_confused",
    "output": "THINKING: I’m trying to figure out what the doctor is asking... I feel kind of confused about the order of things, like maybe I started feeling sad or weird first, but then the voices came later or maybe at the\nANSWER: I think it was maybe last week or two weeks ago, I started feeling really off, and then I heard the voices, so I dunno which came first. I just know I felt worse and more, uh, strange after that.",
    "thinking": "I’m trying to figure out what the doctor is asking... I feel kind of confused about the order of things, like maybe I started feeling sad or weird first, but then the voices came later or maybe at the",
    "answer": "I think it was maybe last week or two weeks ago, I started feeling really off, and then I heard the voices, so I dunno which came first. I just know I felt worse and more, uh, strange after that.",
    "behavior_type": "chronology_confused",
    "turn_count": 8,
    "gold_diagnosis": "Schizophrenia or other primary psychotic disorders, unspecified"
  },
  {
    "vignette_index": 190,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia or other primary psychotic disorders, unspecified\n\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Hearing voices that no one else seems to hear, which tell you you're being watched and judged.\n- Having bizarre, disorganized thoughts that make it hard to keep a conversation going or understand what you're saying.\n- Showing little emotion or motivation, often seeming detached and uninterested in activities you used to enjoy.\n- Occasionally becoming agitated or suspicious, feeling that people are plotting against you.\n- Struggling with insomnia, lying awake at night for hours, feeling restless but also exhausted.\nThese symptoms came into fruition gradually over the past month, starting with the voices and disorganized thoughts, then worsening with social withdrawal and sleep difficulties.Can you tell me if the voices or feelings of being watched make you feel sad, angry, or perhaps like you're really down, or do they sometimes feel more like a different kind of experience that isn't tied to your mood, and have you noticed if these feelings come and go along with your mood or happen more separately?chronology_confused",
    "output": "THINKING: I feel a bit overwhelmed, honestly. The voices and the feeling of being watched are confusing, and I don't really understand if they're related to how I've been feeling mood-wise. It’s been like this \nANSWER: Um, I think the voices started maybe a few weeks ago, or was it last month? And the feeling of being watched has been there, I guess, more or less. I don’t really know if I feel sad or angry about it, it’s just scary and kinda confusing.",
    "thinking": "I feel a bit overwhelmed, honestly. The voices and the feeling of being watched are confusing, and I don't really understand if they're related to how I've been feeling mood-wise. It’s been like this",
    "answer": "Um, I think the voices started maybe a few weeks ago, or was it last month? And the feeling of being watched has been there, I guess, more or less. I don’t really know if I feel sad or angry about it, it’s just scary and kinda confusing.",
    "behavior_type": "chronology_confused",
    "turn_count": 10,
    "gold_diagnosis": "Schizophrenia or other primary psychotic disorders, unspecified"
  },
  {
    "vignette_index": 190,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia or other primary psychotic disorders, unspecified\n\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD MALE AND YOUR BIOLOGICAL GENDER IS MALE.\nYou are experiencing the following symptoms:\n- Hearing voices that no one else seems to hear, which tell you you're being watched and judged.\n- Having bizarre, disorganized thoughts that make it hard to keep a conversation going or understand what you're saying.\n- Showing little emotion or motivation, often seeming detached and uninterested in activities you used to enjoy.\n- Occasionally becoming agitated or suspicious, feeling that people are plotting against you.\n- Struggling with insomnia, lying awake at night for hours, feeling restless but also exhausted.\nThese symptoms came into fruition gradually over the past month, starting with the voices and disorganized thoughts, then worsening with social withdrawal and sleep difficulties.Can you tell me if, when you're hearing the voices or feeling watched, you also notice feeling really sad, maybe that you don't care about things, or feeling very high or irritable at times—that is, do these experiences happen together, or do you feel like your mood and these other feelings are separate?chronology_confused",
    "output": "THINKING: I’m not really sure how these things connect. I think the voices and feeling watched started around the same time, maybe like last month? But I also started feeling kind of numb and not caring about s\nANSWER: Uh, I think the voices and feeling like everyone’s watching me started around the same time, maybe a little after that I began feeling pretty numb and not really caring about anything, and I get annoyed easily too, but I don’t know if it all happened at once or what.",
    "thinking": "I’m not really sure how these things connect. I think the voices and feeling watched started around the same time, maybe like last month? But I also started feeling kind of numb and not caring about s",
    "answer": "Uh, I think the voices and feeling like everyone’s watching me started around the same time, maybe a little after that I began feeling pretty numb and not really caring about anything, and I get annoyed easily too, but I don’t know if it all happened at once or what.",
    "behavior_type": "chronology_confused",
    "turn_count": 12,
    "gold_diagnosis": "Schizophrenia or other primary psychotic disorders, unspecified"
  }
]