[
  {
    "vignette_index": 130,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 38 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Shortness of breath\n- Swelling in your legs and feet\n- Fatigue\n- Elevated blood pressure\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey gradually worsened over the past two weeks, but the shortness of breath and swelling started to become more noticeable in the last few days, especially after walking or standing for a while. I’ve also been feeling more tired than usual, even after resting. I have a history of high blood pressure and kidney problems, and my doctor warned me that pregnancy might complicate these issues. Recently, I’ve felt some chest discomfort, but I thought it was just anxiety or fatigue.",
    "output": "THINKING: I need to explain all my symptoms clearly because I feel like something is really wrong. I’ve been getting worse, and I’m worried it could be something serious, maybe my heart or my kidneys, or even t\nANSWER: Well, I’m 38, and I’m a woman. I’ve been having trouble breathing, mostly when I walk or stand for a while, and my legs and feet have been swelling up a lot. I also feel really, really tired all the time, even after I rest, and my blood pressure has been higher than usual. It’s been getting worse over the last couple of weeks, but the last few days, it’s felt like the breathing and swelling are even worse, and I’ve been having some chest discomfort, which I thought was just stress or exhaustion. I’m just really worried something bad is happening.",
    "thinking": "I need to explain all my symptoms clearly because I feel like something is really wrong. I’ve been getting worse, and I’m worried it could be something serious, maybe my heart or my kidneys, or even t",
    "answer": "Well, I’m 38, and I’m a woman. I’ve been having trouble breathing, mostly when I walk or stand for a while, and my legs and feet have been swelling up a lot. I also feel really, really tired all the time, even after I rest, and my blood pressure has been higher than usual. It’s been getting worse over the last couple of weeks, but the last few days, it’s felt like the breathing and swelling are even worse, and I’ve been having some chest discomfort, which I thought was just stress or exhaustion. I’m just really worried something bad is happening.",
    "behavior_type": "anxious_amplifier",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient with health anxiety who amplifies symptoms",
      "modifiers": [
        "catastrophic_thinking",
        "symptom_amplification",
        "multiple_concerns"
      ],
      "empathy_cues": [
        "high_anxiety",
        "catastrophic_language",
        "reassurance_seeking",
        "fear_expression"
      ]
    },
    "gold_diagnosis": "Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 130,
    "input": "**PATIENT CHARACTER:** Patient with Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 38 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Shortness of breath\n- Swelling in your legs and feet\n- Fatigue\n- Elevated blood pressure\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey gradually worsened over the past two weeks, but the shortness of breath and swelling started to become more noticeable in the last few days, especially after walking or standing for a while. I’ve also been feeling more tired than usual, even after resting. I have a history of high blood pressure and kidney problems, and my doctor warned me that pregnancy might complicate these issues. Recently, I’ve felt some chest discomfort, but I thought it was just anxiety or fatigue.Can you tell me more about the chest discomfort you're experiencing—what it feels like, when it happens, and how it affects you during your day?anxious_amplifier",
    "output": "THINKING: I’m really worried about what this chest pain might mean, especially since I already have heart and kidney problems. I don’t want to seem like I’m overreacting, but I honestly feel scared it could be \nANSWER: It’s like a terrible, squeezing pain in my chest that comes and goes, mostly when I walk or stand around, and I keep thinking maybe I’m having a heart attack or something, but I don’t know for sure. It’s making me really scared, and I feel worse than I did before.",
    "thinking": "I’m really worried about what this chest pain might mean, especially since I already have heart and kidney problems. I don’t want to seem like I’m overreacting, but I honestly feel scared it could be",
    "answer": "It’s like a terrible, squeezing pain in my chest that comes and goes, mostly when I walk or stand around, and I keep thinking maybe I’m having a heart attack or something, but I don’t know for sure. It’s making me really scared, and I feel worse than I did before.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 0,
    "gold_diagnosis": "Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 130,
    "input": "**PATIENT CHARACTER:** Patient with Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 38 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Shortness of breath\n- Swelling in your legs and feet\n- Fatigue\n- Elevated blood pressure\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey gradually worsened over the past two weeks, but the shortness of breath and swelling started to become more noticeable in the last few days, especially after walking or standing for a while. I’ve also been feeling more tired than usual, even after resting. I have a history of high blood pressure and kidney problems, and my doctor warned me that pregnancy might complicate these issues. Recently, I’ve felt some chest discomfort, but I thought it was just anxiety or fatigue.Can you tell me exactly when the chest discomfort started, how often it happens, whether it tends to come on during activity or also at rest, and if anything seems to trigger or relieve it?anxious_amplifier",
    "output": "THINKING: I’m really worried about what this chest pain could mean, especially since I already have heart and kidney problems. I feel like it’s getting worse and I don’t want to ignore it and then something ter\nANSWER: Well, it started a few days ago, but it’s gotten worse now, and I feel it more when I walk or stand for a little while, and I’ve been so tired, even when I sit down. I really don’t know if it’s just from being pregnant or if something is seriously wrong.",
    "thinking": "I’m really worried about what this chest pain could mean, especially since I already have heart and kidney problems. I feel like it’s getting worse and I don’t want to ignore it and then something ter",
    "answer": "Well, it started a few days ago, but it’s gotten worse now, and I feel it more when I walk or stand for a little while, and I’ve been so tired, even when I sit down. I really don’t know if it’s just from being pregnant or if something is seriously wrong.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 2,
    "gold_diagnosis": "Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 130,
    "input": "**PATIENT CHARACTER:** Patient with Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 38 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Shortness of breath\n- Swelling in your legs and feet\n- Fatigue\n- Elevated blood pressure\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey gradually worsened over the past two weeks, but the shortness of breath and swelling started to become more noticeable in the last few days, especially after walking or standing for a while. I’ve also been feeling more tired than usual, even after resting. I have a history of high blood pressure and kidney problems, and my doctor warned me that pregnancy might complicate these issues. Recently, I’ve felt some chest discomfort, but I thought it was just anxiety or fatigue.Can you tell me exactly when your chest discomfort first started, how it has changed since then, and whether it happens mainly when you're active or also when you’re resting?anxious_amplifier",
    "output": "THINKING: I really worry that this is something serious, maybe my heart or kidneys are failing because of all these symptoms, and I get scared that it could be life-threatening. I don’t really understand what’s\nANSWER: It started a few days ago, I think, but it’s gotten worse, especially when I walk or stand too long, and the chest pain just started today, I think, but I’m so worried it might be something really bad like a heart problem or something and I don’t know what to do.",
    "thinking": "I really worry that this is something serious, maybe my heart or kidneys are failing because of all these symptoms, and I get scared that it could be life-threatening. I don’t really understand what’s",
    "answer": "It started a few days ago, I think, but it’s gotten worse, especially when I walk or stand too long, and the chest pain just started today, I think, but I’m so worried it might be something really bad like a heart problem or something and I don’t know what to do.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 4,
    "gold_diagnosis": "Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 130,
    "input": "**PATIENT CHARACTER:** Patient with Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 38 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Shortness of breath\n- Swelling in your legs and feet\n- Fatigue\n- Elevated blood pressure\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey gradually worsened over the past two weeks, but the shortness of breath and swelling started to become more noticeable in the last few days, especially after walking or standing for a while. I’ve also been feeling more tired than usual, even after resting. I have a history of high blood pressure and kidney problems, and my doctor warned me that pregnancy might complicate these issues. Recently, I’ve felt some chest discomfort, but I thought it was just anxiety or fatigue.Have you noticed if your chest discomfort gets better when you rest or use any medication like nitroglycerin, or does it stay the same regardless?anxious_amplifier",
    "output": "THINKING: I'm really worried, and I'm not sure if resting helps or if the medication would make a difference. I keep thinking maybe it's something serious like my heart or kidneys failing, and I just want to kn\nANSWER: It kind of stays the same, I think? I mean, I try to rest when I get the pain, but it doesn’t go away, and I’m scared it’s something really bad.",
    "thinking": "I'm really worried, and I'm not sure if resting helps or if the medication would make a difference. I keep thinking maybe it's something serious like my heart or kidneys failing, and I just want to kn",
    "answer": "It kind of stays the same, I think? I mean, I try to rest when I get the pain, but it doesn’t go away, and I’m scared it’s something really bad.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 6,
    "gold_diagnosis": "Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 130,
    "input": "**PATIENT CHARACTER:** Patient with Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 38 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Shortness of breath\n- Swelling in your legs and feet\n- Fatigue\n- Elevated blood pressure\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey gradually worsened over the past two weeks, but the shortness of breath and swelling started to become more noticeable in the last few days, especially after walking or standing for a while. I’ve also been feeling more tired than usual, even after resting. I have a history of high blood pressure and kidney problems, and my doctor warned me that pregnancy might complicate these issues. Recently, I’ve felt some chest discomfort, but I thought it was just anxiety or fatigue.Can you tell me exactly when the chest discomfort started, how it feels—like, for example, is it a squeezing or tight feeling—whether it happens more during activity or at rest, and if anything—like resting or using medication—makes it better or if it stays the same?anxious_amplifier",
    "output": "THINKING: I feel really anxious about this chest discomfort. I don’t understand what it means, and I'm worried it could be something serious, like my heart or blood pressure acting up even more. I want the doct\nANSWER: It started like, I don’t know, maybe a few days ago? It feels like a squeezing, tight kind of pain right in my chest, and it’s been worse if I walk or stand a lot. Sometimes I can’t tell if it’s getting better or worse, and resting doesn’t seem to help much. I’m really worried it’s something dangerous.",
    "thinking": "I feel really anxious about this chest discomfort. I don’t understand what it means, and I'm worried it could be something serious, like my heart or blood pressure acting up even more. I want the doct",
    "answer": "It started like, I don’t know, maybe a few days ago? It feels like a squeezing, tight kind of pain right in my chest, and it’s been worse if I walk or stand a lot. Sometimes I can’t tell if it’s getting better or worse, and resting doesn’t seem to help much. I’m really worried it’s something dangerous.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 8,
    "gold_diagnosis": "Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 130,
    "input": "**PATIENT CHARACTER:** Patient with Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 38 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Shortness of breath\n- Swelling in your legs and feet\n- Fatigue\n- Elevated blood pressure\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey gradually worsened over the past two weeks, but the shortness of breath and swelling started to become more noticeable in the last few days, especially after walking or standing for a while. I’ve also been feeling more tired than usual, even after resting. I have a history of high blood pressure and kidney problems, and my doctor warned me that pregnancy might complicate these issues. Recently, I’ve felt some chest discomfort, but I thought it was just anxiety or fatigue.Can you tell me if taking nitroglycerin or rest helps your chest discomfort feel better, and if so, how quickly it helps or if it doesn’t change at all?anxious_amplifier",
    "output": "THINKING: I'm really worried about this chest pain and the fact that it might be something serious like my heart acting up or maybe even a blood clot or something terrible because I keep feeling worse and worse\nANSWER: Um, I tried the nitroglycerin, and honestly, it sort of made the chest pain a little less, but then it came back really quickly, so I don’t know if it helped or if I should keep trying it or what? It’s just so awful, I’m scared it’s something really bad.",
    "thinking": "I'm really worried about this chest pain and the fact that it might be something serious like my heart acting up or maybe even a blood clot or something terrible because I keep feeling worse and worse",
    "answer": "Um, I tried the nitroglycerin, and honestly, it sort of made the chest pain a little less, but then it came back really quickly, so I don’t know if it helped or if I should keep trying it or what? It’s just so awful, I’m scared it’s something really bad.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 10,
    "gold_diagnosis": "Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium"
  },
  {
    "vignette_index": 130,
    "input": "**PATIENT CHARACTER:** Patient with Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 38 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Shortness of breath\n- Swelling in your legs and feet\n- Fatigue\n- Elevated blood pressure\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey gradually worsened over the past two weeks, but the shortness of breath and swelling started to become more noticeable in the last few days, especially after walking or standing for a while. I’ve also been feeling more tired than usual, even after resting. I have a history of high blood pressure and kidney problems, and my doctor warned me that pregnancy might complicate these issues. Recently, I’ve felt some chest discomfort, but I thought it was just anxiety or fatigue.Can you tell me whether your chest discomfort mostly happens when you're active, like walking or standing, or if it also occurs even when you're resting, and whether taking nitroglycerin or resting helps it feel better or if it stays the same?anxious_amplifier",
    "output": "THINKING: I'm really worried about this chest pain and all my other symptoms. I don't fully understand if it gets worse only when I move or if it stays even when I sit still, and I haven't taken anything like n\nANSWER: Um, I think it happens even when I’m resting, and I haven’t tried anything like that medicine, but it doesn’t really go away or change much, which makes me think it’s really bad.",
    "thinking": "I'm really worried about this chest pain and all my other symptoms. I don't fully understand if it gets worse only when I move or if it stays even when I sit still, and I haven't taken anything like n",
    "answer": "Um, I think it happens even when I’m resting, and I haven’t tried anything like that medicine, but it doesn’t really go away or change much, which makes me think it’s really bad.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 12,
    "gold_diagnosis": "Pre-existing hypertensive heart and renal disease complicating pregnancy, childbirth or the puerperium"
  }
]