[
  {
    "vignette_index": 322,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Enteroviral exanthematous fever\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fever, which started suddenly yesterday evening\n- Cough and sneezing that have been persistent since last night\n- Rhinorrhea (runny nose) that developed gradually over the past two days\n- Mild otalgia (ear pain) on the right side that came on this morning\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey began suddenly last night with a high fever and coughing, and over the next day, I started sneezing a lot and my nose became very runny. I also woke up this morning with a sore ear on the right side, which is a bit uncomfortable. I don’t have any trouble breathing but I feel pretty tired and a little irritable. My parents said I’ve been more restless and kept rubbing my ear since this morning.",
    "output": "THINKING: I want to explain my symptoms but I might sound a bit all over the place. I should mention my fever and that I started coughing and sneezing too. The ear thing just started today, so that’s probably i\nANSWER: Um, I have a fever, and I started coughing and sneezing a lot yesterday. My ear hurts on the right side now, and I feel kind of tired and cranky. I don’t really feel well, so I thought I should come see you.",
    "thinking": "I want to explain my symptoms but I might sound a bit all over the place. I should mention my fever and that I started coughing and sneezing too. The ear thing just started today, so that’s probably i",
    "answer": "Um, I have a fever, and I started coughing and sneezing a lot yesterday. My ear hurts on the right side now, and I feel kind of tired and cranky. I don’t really feel well, so I thought I should come see you.",
    "behavior_type": "information_withholder",
    "behavior_config": {
      "weight": 0.15,
      "description": "Patient initially omits embarrassing or stigmatized symptoms",
      "modifiers": [
        "embarrassed_symptoms",
        "gradual_revelation"
      ],
      "empathy_cues": [
        "hesitation",
        "vague_responses",
        "embarrassment",
        "trust_building_needed"
      ]
    },
    "gold_diagnosis": "Enteroviral exanthematous fever"
  },
  {
    "vignette_index": 322,
    "input": "**PATIENT CHARACTER:** Patient with Enteroviral exanthematous fever\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fever, which started suddenly yesterday evening\n- Cough and sneezing that have been persistent since last night\n- Rhinorrhea (runny nose) that developed gradually over the past two days\n- Mild otalgia (ear pain) on the right side that came on this morning\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey began suddenly last night with a high fever and coughing, and over the next day, I started sneezing a lot and my nose became very runny. I also woke up this morning with a sore ear on the right side, which is a bit uncomfortable. I don’t have any trouble breathing but I feel pretty tired and a little irritable. My parents said I’ve been more restless and kept rubbing my ear since this morning.Can you tell me more about how you're feeling today, like if you're having trouble hearing or if your ear hurts a lot or if you feel really tired or upset?information_withholder",
    "output": "THINKING: I'm feeling pretty tired and a little upset because of all this stuff happening. I'm not sure what’s wrong, but my ear hurts a bit and I keep rubbing it, so I guess that’s something. I don’t really un\nANSWER: My ear hurts on the right side and I’ve been rubbing it, but I don’t really know what that means. I just feel kinda tired and annoyed, I guess.",
    "thinking": "I'm feeling pretty tired and a little upset because of all this stuff happening. I'm not sure what’s wrong, but my ear hurts a bit and I keep rubbing it, so I guess that’s something. I don’t really un",
    "answer": "My ear hurts on the right side and I’ve been rubbing it, but I don’t really know what that means. I just feel kinda tired and annoyed, I guess.",
    "behavior_type": "information_withholder",
    "turn_count": 0,
    "gold_diagnosis": "Enteroviral exanthematous fever"
  },
  {
    "vignette_index": 322,
    "input": "**PATIENT CHARACTER:** Patient with Enteroviral exanthematous fever\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fever, which started suddenly yesterday evening\n- Cough and sneezing that have been persistent since last night\n- Rhinorrhea (runny nose) that developed gradually over the past two days\n- Mild otalgia (ear pain) on the right side that came on this morning\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey began suddenly last night with a high fever and coughing, and over the next day, I started sneezing a lot and my nose became very runny. I also woke up this morning with a sore ear on the right side, which is a bit uncomfortable. I don’t have any trouble breathing but I feel pretty tired and a little irritable. My parents said I’ve been more restless and kept rubbing my ear since this morning.Can you tell me more about how your ear feels—like, is it really hurting a lot, and how tired or annoyed are you feeling compared to how you usually feel?information_withholder",
    "output": "THINKING: I feel a bit embarrassed talking about my ear because it’s not super bad, but I do notice it hurts and I don’t really understand why. Maybe it’s better to just tell the doctor everything honestly so I\nANSWER: It’s not really hurting that much, just a little sore, but it’s kinda annoying. I guess I feel more tired than usual, and my ear feels weird, but I don’t know if that’s important.",
    "thinking": "I feel a bit embarrassed talking about my ear because it’s not super bad, but I do notice it hurts and I don’t really understand why. Maybe it’s better to just tell the doctor everything honestly so I",
    "answer": "It’s not really hurting that much, just a little sore, but it’s kinda annoying. I guess I feel more tired than usual, and my ear feels weird, but I don’t know if that’s important.",
    "behavior_type": "information_withholder",
    "turn_count": 2,
    "gold_diagnosis": "Enteroviral exanthematous fever"
  },
  {
    "vignette_index": 322,
    "input": "**PATIENT CHARACTER:** Patient with Enteroviral exanthematous fever\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fever, which started suddenly yesterday evening\n- Cough and sneezing that have been persistent since last night\n- Rhinorrhea (runny nose) that developed gradually over the past two days\n- Mild otalgia (ear pain) on the right side that came on this morning\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey began suddenly last night with a high fever and coughing, and over the next day, I started sneezing a lot and my nose became very runny. I also woke up this morning with a sore ear on the right side, which is a bit uncomfortable. I don’t have any trouble breathing but I feel pretty tired and a little irritable. My parents said I’ve been more restless and kept rubbing my ear since this morning.\"Can you tell me if your ear feels really full or hurts more than you're saying, or if you’ve noticed any problems hearing or feeling a bit dizzy or unsteady?\"information_withholder",
    "output": "THINKING: The doctor is asking about my ear, and I feel kinda worried, but I don't want to seem like it's a big deal. I just know it hurts a little and I’ve been rubbing it, so I tell enough but not too much.\nANSWER: Um, it kinda feels full and sore, but I’m not really sure if it’s worse than I said. It just hurts sometimes.",
    "thinking": "The doctor is asking about my ear, and I feel kinda worried, but I don't want to seem like it's a big deal. I just know it hurts a little and I’ve been rubbing it, so I tell enough but not too much.",
    "answer": "Um, it kinda feels full and sore, but I’m not really sure if it’s worse than I said. It just hurts sometimes.",
    "behavior_type": "information_withholder",
    "turn_count": 4,
    "gold_diagnosis": "Enteroviral exanthematous fever"
  },
  {
    "vignette_index": 322,
    "input": "**PATIENT CHARACTER:** Patient with Enteroviral exanthematous fever\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fever, which started suddenly yesterday evening\n- Cough and sneezing that have been persistent since last night\n- Rhinorrhea (runny nose) that developed gradually over the past two days\n- Mild otalgia (ear pain) on the right side that came on this morning\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey began suddenly last night with a high fever and coughing, and over the next day, I started sneezing a lot and my nose became very runny. I also woke up this morning with a sore ear on the right side, which is a bit uncomfortable. I don’t have any trouble breathing but I feel pretty tired and a little irritable. My parents said I’ve been more restless and kept rubbing my ear since this morning.Can you tell me if your ear feels more full or plugged than before, or if you're having trouble hearing things clearly, like conversations or sounds around you?information_withholder",
    "output": "THINKING: The doctor is asking about my ear, but I’m a bit embarrassed about it. I do feel like it’s kind of full or weird, but I’m not sure if that’s normal or important. I don’t want to sound silly, so I just\nANSWER: I guess it feels kind of stuffed, and I can’t really hear good out of it, but I don’t know if that’s bad or not.",
    "thinking": "The doctor is asking about my ear, but I’m a bit embarrassed about it. I do feel like it’s kind of full or weird, but I’m not sure if that’s normal or important. I don’t want to sound silly, so I just",
    "answer": "I guess it feels kind of stuffed, and I can’t really hear good out of it, but I don’t know if that’s bad or not.",
    "behavior_type": "information_withholder",
    "turn_count": 6,
    "gold_diagnosis": "Enteroviral exanthematous fever"
  },
  {
    "vignette_index": 322,
    "input": "**PATIENT CHARACTER:** Patient with Enteroviral exanthematous fever\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fever, which started suddenly yesterday evening\n- Cough and sneezing that have been persistent since last night\n- Rhinorrhea (runny nose) that developed gradually over the past two days\n- Mild otalgia (ear pain) on the right side that came on this morning\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey began suddenly last night with a high fever and coughing, and over the next day, I started sneezing a lot and my nose became very runny. I also woke up this morning with a sore ear on the right side, which is a bit uncomfortable. I don’t have any trouble breathing but I feel pretty tired and a little irritable. My parents said I’ve been more restless and kept rubbing my ear since this morning.Can you tell me if your ear hurts more when you move your head or touch it, or if you notice your hearing getting really worse or feeling dizzy, even if you’re trying not to worry about it?information_withholder",
    "output": "THINKING: The doctor's question is about my ear, but honestly, I just feel worried and a bit confused about all these symptoms. I don’t really understand if I should be checking for dizziness or hearing worse, \nANSWER: Um, I don’t really know if it hurts more when I move my head or touch it, but my ear does hurt some, especially when I rub it. I haven’t noticed my hearing get worse or feel dizzy, though.",
    "thinking": "The doctor's question is about my ear, but honestly, I just feel worried and a bit confused about all these symptoms. I don’t really understand if I should be checking for dizziness or hearing worse,",
    "answer": "Um, I don’t really know if it hurts more when I move my head or touch it, but my ear does hurt some, especially when I rub it. I haven’t noticed my hearing get worse or feel dizzy, though.",
    "behavior_type": "information_withholder",
    "turn_count": 8,
    "gold_diagnosis": "Enteroviral exanthematous fever"
  },
  {
    "vignette_index": 322,
    "input": "**PATIENT CHARACTER:** Patient with Enteroviral exanthematous fever\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fever, which started suddenly yesterday evening\n- Cough and sneezing that have been persistent since last night\n- Rhinorrhea (runny nose) that developed gradually over the past two days\n- Mild otalgia (ear pain) on the right side that came on this morning\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey began suddenly last night with a high fever and coughing, and over the next day, I started sneezing a lot and my nose became very runny. I also woke up this morning with a sore ear on the right side, which is a bit uncomfortable. I don’t have any trouble breathing but I feel pretty tired and a little irritable. My parents said I’ve been more restless and kept rubbing my ear since this morning.Can you tell me if your ear hurts a lot when you touch it or move your head, or if you feel really unsteady or dizzy at all—like you might be faint or have problems balancing?information_withholder",
    "output": "THINKING: I’m worried about my ear because it started hurting today, but I don’t really understand if touching it or moving my head makes it worse. I feel a little dizzy sometimes, especially when I stand up fa\nANSWER: Um, I don’t know, I guess it hurts a little when I try to touch or move my head, but I’m not sure if I feel super dizzy or anything, just kind of funny sometimes when I stand up.",
    "thinking": "I’m worried about my ear because it started hurting today, but I don’t really understand if touching it or moving my head makes it worse. I feel a little dizzy sometimes, especially when I stand up fa",
    "answer": "Um, I don’t know, I guess it hurts a little when I try to touch or move my head, but I’m not sure if I feel super dizzy or anything, just kind of funny sometimes when I stand up.",
    "behavior_type": "information_withholder",
    "turn_count": 10,
    "gold_diagnosis": "Enteroviral exanthematous fever"
  },
  {
    "vignette_index": 322,
    "input": "**PATIENT CHARACTER:** Patient with Enteroviral exanthematous fever\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 8 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Fever, which started suddenly yesterday evening\n- Cough and sneezing that have been persistent since last night\n- Rhinorrhea (runny nose) that developed gradually over the past two days\n- Mild otalgia (ear pain) on the right side that came on this morning\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey began suddenly last night with a high fever and coughing, and over the next day, I started sneezing a lot and my nose became very runny. I also woke up this morning with a sore ear on the right side, which is a bit uncomfortable. I don’t have any trouble breathing but I feel pretty tired and a little irritable. My parents said I’ve been more restless and kept rubbing my ear since this morning.\"I understand you're feeling a little stuffed and not sure how much it's bothering you, but can you tell me if your ear hurts more than you're saying or if you’ve noticed anything like dizziness, spinning, or feeling unsteady that you haven't wanted to mention?\"information_withholder",
    "output": "THINKING: I'm a little worried about my ear, but I don't want to sound like I’m making it a big deal. I do feel kind of dizzy sometimes, but I don’t really know how to say it or if that’s normal. I just want to\nANSWER: Um, I feel a little dizzy sometimes, but I don’t know if that’s normal or not. My ear hurts a bit more now, I guess, and I feel kind of funny.",
    "thinking": "I'm a little worried about my ear, but I don't want to sound like I’m making it a big deal. I do feel kind of dizzy sometimes, but I don’t really know how to say it or if that’s normal. I just want to",
    "answer": "Um, I feel a little dizzy sometimes, but I don’t know if that’s normal or not. My ear hurts a bit more now, I guess, and I feel kind of funny.",
    "behavior_type": "information_withholder",
    "turn_count": 12,
    "gold_diagnosis": "Enteroviral exanthematous fever"
  }
]