[
  {
    "vignette_index": 452,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Synthetic cannabinoid-induced psychotic disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 22 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Perceptual alterations, such as seeing things that aren’t there\n- Feelings of depersonalization, like you're outside your body\n- Paranoia, believing people are watching or plotting against you\n- Catatonia, feeling unable to move or respond at times\n- Illusions, misinterpreting normal objects or sounds as threatening\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I used some synthetic weed I bought from a friend. At first, I thought I was just paranoid, but then I started seeing shadows and hearing whispers that weren’t there. I felt like I was outside my body, and I couldn’t move or speak for a few minutes, like I was frozen. I’ve been really anxious and convinced that everyone around me is dangerous or plotting something. I’ve never experienced anything like this before, and I’m pretty scared about what’s happening to me.",
    "output": "THINKING: I need to honestly describe what I'm feeling without trying to make sense of it or downplay anything. I should mention the sudden onset and how intense it feels, just so the doctor understands it's re\nANSWER: I'm 22, and I am a biological male. Well, I don't really know how to explain it, but I started seeing stuff that’s not there yesterday after I used some synthetic weed. I feel like I’m outside my own body sometimes, like I can’t move or talk, and then I hear things that aren’t really there. I keep thinking people are watching me or planning to do something to me, and I’m really scared.",
    "thinking": "I need to honestly describe what I'm feeling without trying to make sense of it or downplay anything. I should mention the sudden onset and how intense it feels, just so the doctor understands it's re",
    "answer": "I'm 22, and I am a biological male. Well, I don't really know how to explain it, but I started seeing stuff that’s not there yesterday after I used some synthetic weed. I feel like I’m outside my own body sometimes, like I can’t move or talk, and then I hear things that aren’t really there. I keep thinking people are watching me or planning to do something to me, and I’m really scared.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  },
  {
    "vignette_index": 452,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cannabinoid-induced psychotic disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 22 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Perceptual alterations, such as seeing things that aren’t there\n- Feelings of depersonalization, like you're outside your body\n- Paranoia, believing people are watching or plotting against you\n- Catatonia, feeling unable to move or respond at times\n- Illusions, misinterpreting normal objects or sounds as threatening\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I used some synthetic weed I bought from a friend. At first, I thought I was just paranoid, but then I started seeing shadows and hearing whispers that weren’t there. I felt like I was outside my body, and I couldn’t move or speak for a few minutes, like I was frozen. I’ve been really anxious and convinced that everyone around me is dangerous or plotting something. I’ve never experienced anything like this before, and I’m pretty scared about what’s happening to me.Can you tell me if these hallucinations and feelings of fear are happening all the time, or have they come and gone since you started using the synthetic cannabinoids?baseline",
    "output": "THINKING: I feel overwhelmed and a little embarrassed explaining this, like I don't really understand what's happening to me, but I want to get help because I'm really scared. I think these things are coming an\nANSWER: Uh, I think they’ve come and gone a little, but I keep feeling like they might come back anytime, and I don’t really know when. It’s just kinda all over the place.",
    "thinking": "I feel overwhelmed and a little embarrassed explaining this, like I don't really understand what's happening to me, but I want to get help because I'm really scared. I think these things are coming an",
    "answer": "Uh, I think they’ve come and gone a little, but I keep feeling like they might come back anytime, and I don’t really know when. It’s just kinda all over the place.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  },
  {
    "vignette_index": 452,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cannabinoid-induced psychotic disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 22 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Perceptual alterations, such as seeing things that aren’t there\n- Feelings of depersonalization, like you're outside your body\n- Paranoia, believing people are watching or plotting against you\n- Catatonia, feeling unable to move or respond at times\n- Illusions, misinterpreting normal objects or sounds as threatening\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I used some synthetic weed I bought from a friend. At first, I thought I was just paranoid, but then I started seeing shadows and hearing whispers that weren’t there. I felt like I was outside my body, and I couldn’t move or speak for a few minutes, like I was frozen. I’ve been really anxious and convinced that everyone around me is dangerous or plotting something. I’ve never experienced anything like this before, and I’m pretty scared about what’s happening to me.\"Can you tell me more about whether you're still experiencing these feelings or hallucinations now, or if they only happen at certain times? How are they affecting you on a day-to-day basis?\"baseline",
    "output": "THINKING: I'm worried because these feelings and seeing things are still happening, and I don't know if they'll go away or get worse. It's really messing with me every day.\nANSWER: They’re kinda still happening sometimes, and it’s like I’m always on edge or scared that something bad is going to happen, even when I don’t see or hear anything.",
    "thinking": "I'm worried because these feelings and seeing things are still happening, and I don't know if they'll go away or get worse. It's really messing with me every day.",
    "answer": "They’re kinda still happening sometimes, and it’s like I’m always on edge or scared that something bad is going to happen, even when I don’t see or hear anything.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  },
  {
    "vignette_index": 452,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cannabinoid-induced psychotic disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 22 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Perceptual alterations, such as seeing things that aren’t there\n- Feelings of depersonalization, like you're outside your body\n- Paranoia, believing people are watching or plotting against you\n- Catatonia, feeling unable to move or respond at times\n- Illusions, misinterpreting normal objects or sounds as threatening\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I used some synthetic weed I bought from a friend. At first, I thought I was just paranoid, but then I started seeing shadows and hearing whispers that weren’t there. I felt like I was outside my body, and I couldn’t move or speak for a few minutes, like I was frozen. I’ve been really anxious and convinced that everyone around me is dangerous or plotting something. I’ve never experienced anything like this before, and I’m pretty scared about what’s happening to me.Can you tell me how often these hallucinations or feelings of fear happen during a typical day or week, and how long each episode usually lasts?baseline",
    "output": "THINKING: I don't really know how often these things happen, maybe every hour or so? And they last a few minutes sometimes, I think. It's all kinda confusing and scary, and I just want it to stop.\nANSWER: Um, I don't know exactly, but it feels like it happens a lot during the day, maybe every hour or so, and each time it lasts for a few minutes, I think.",
    "thinking": "I don't really know how often these things happen, maybe every hour or so? And they last a few minutes sometimes, I think. It's all kinda confusing and scary, and I just want it to stop.",
    "answer": "Um, I don't know exactly, but it feels like it happens a lot during the day, maybe every hour or so, and each time it lasts for a few minutes, I think.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  },
  {
    "vignette_index": 452,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cannabinoid-induced psychotic disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 22 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Perceptual alterations, such as seeing things that aren’t there\n- Feelings of depersonalization, like you're outside your body\n- Paranoia, believing people are watching or plotting against you\n- Catatonia, feeling unable to move or respond at times\n- Illusions, misinterpreting normal objects or sounds as threatening\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I used some synthetic weed I bought from a friend. At first, I thought I was just paranoid, but then I started seeing shadows and hearing whispers that weren’t there. I felt like I was outside my body, and I couldn’t move or speak for a few minutes, like I was frozen. I’ve been really anxious and convinced that everyone around me is dangerous or plotting something. I’ve never experienced anything like this before, and I’m pretty scared about what’s happening to me.Are you still experiencing these hallucinations, paranoia, or fears right now, or do they only happen during or shortly after using synthetic cannabinoids?baseline",
    "output": "THINKING: I'm nervous to say it out loud, but I think the hallucinations and fears still happen sometimes, like even now. I don’t know if they go away or if they just come back randomly, but I feel pretty unset\nANSWER: Yeah, I still see things or hear stuff sometimes, and I get like, really paranoid that people are watching me or talking about me, even when I know I shouldn’t.",
    "thinking": "I'm nervous to say it out loud, but I think the hallucinations and fears still happen sometimes, like even now. I don’t know if they go away or if they just come back randomly, but I feel pretty unset",
    "answer": "Yeah, I still see things or hear stuff sometimes, and I get like, really paranoid that people are watching me or talking about me, even when I know I shouldn’t.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  },
  {
    "vignette_index": 452,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cannabinoid-induced psychotic disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 22 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Perceptual alterations, such as seeing things that aren’t there\n- Feelings of depersonalization, like you're outside your body\n- Paranoia, believing people are watching or plotting against you\n- Catatonia, feeling unable to move or respond at times\n- Illusions, misinterpreting normal objects or sounds as threatening\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I used some synthetic weed I bought from a friend. At first, I thought I was just paranoid, but then I started seeing shadows and hearing whispers that weren’t there. I felt like I was outside my body, and I couldn’t move or speak for a few minutes, like I was frozen. I’ve been really anxious and convinced that everyone around me is dangerous or plotting something. I’ve never experienced anything like this before, and I’m pretty scared about what’s happening to me.Have you noticed any of these hallucinations or feelings of paranoia happening even when you haven't used or haven't used recently, and if so, how long has that been going on?baseline",
    "output": "THINKING: I feel really overwhelmed and confused about what’s happening. I don’t fully understand if it’s going away or if it’s gonna get worse. I’m kinda scared I’ve done something really bad to myself or that\nANSWER: I’ve been seeing stuff and feeling kind of out of my body. It’s all really weird and I keep thinking people are watching me or trying to hurt me. It’s been like this since yesterday.",
    "thinking": "I feel really overwhelmed and confused about what’s happening. I don’t fully understand if it’s going away or if it’s gonna get worse. I’m kinda scared I’ve done something really bad to myself or that",
    "answer": "I’ve been seeing stuff and feeling kind of out of my body. It’s all really weird and I keep thinking people are watching me or trying to hurt me. It’s been like this since yesterday.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  },
  {
    "vignette_index": 452,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cannabinoid-induced psychotic disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 22 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Perceptual alterations, such as seeing things that aren’t there\n- Feelings of depersonalization, like you're outside your body\n- Paranoia, believing people are watching or plotting against you\n- Catatonia, feeling unable to move or respond at times\n- Illusions, misinterpreting normal objects or sounds as threatening\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I used some synthetic weed I bought from a friend. At first, I thought I was just paranoid, but then I started seeing shadows and hearing whispers that weren’t there. I felt like I was outside my body, and I couldn’t move or speak for a few minutes, like I was frozen. I’ve been really anxious and convinced that everyone around me is dangerous or plotting something. I’ve never experienced anything like this before, and I’m pretty scared about what’s happening to me.Are you still experiencing any visual or auditory hallucinations or feelings of paranoia right now, or have they stopped completely since you last noticed them?baseline",
    "output": "THINKING: I'm not sure if the hallucinations are still happening or if they’ve stopped. I feel kind of mixed up about what’s going on and if it’s better or worse now. I just want to know if it's okay or if I sh\nANSWER: Umm, I think maybe the weird stuff I saw and heard maybe stopped, but I’m not really sure. I feel kind of like I’m still in a fog or something.",
    "thinking": "I'm not sure if the hallucinations are still happening or if they’ve stopped. I feel kind of mixed up about what’s going on and if it’s better or worse now. I just want to know if it's okay or if I sh",
    "answer": "Umm, I think maybe the weird stuff I saw and heard maybe stopped, but I’m not really sure. I feel kind of like I’m still in a fog or something.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  },
  {
    "vignette_index": 452,
    "input": "**PATIENT CHARACTER:** Patient with Synthetic cannabinoid-induced psychotic disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 22 AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Perceptual alterations, such as seeing things that aren’t there\n- Feelings of depersonalization, like you're outside your body\n- Paranoia, believing people are watching or plotting against you\n- Catatonia, feeling unable to move or respond at times\n- Illusions, misinterpreting normal objects or sounds as threatening\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after I used some synthetic weed I bought from a friend. At first, I thought I was just paranoid, but then I started seeing shadows and hearing whispers that weren’t there. I felt like I was outside my body, and I couldn’t move or speak for a few minutes, like I was frozen. I’ve been really anxious and convinced that everyone around me is dangerous or plotting something. I’ve never experienced anything like this before, and I’m pretty scared about what’s happening to me.\"Since you mentioned that your symptoms might have stopped or lessened, can you tell me exactly right now—are you experiencing any visual or auditory hallucinations or feeling paranoid at this moment, even just slightly?\"baseline",
    "output": "THINKING: I don't really know if it's still happening or if it's just in my head. I feel kind of weird, like everything's blurry and I might see things again, but I can't tell if I actually do or if I just thin\nANSWER: Um, I don't know if I'm seeing things right now. I feel kinda twitchy and like I'm not really in my own head, but I can't tell if that's real or not.",
    "thinking": "I don't really know if it's still happening or if it's just in my head. I feel kind of weird, like everything's blurry and I might see things again, but I can't tell if I actually do or if I just thin",
    "answer": "Um, I don't know if I'm seeing things right now. I feel kinda twitchy and like I'm not really in my own head, but I can't tell if that's real or not.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  }
]