[
  {
    "vignette_index": 300,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.",
    "output": "THINKING: I should mention the main problems first and be honest, even if I feel a bit embarrassed about some things. I want to explain my symptoms clearly but also seem unsure, as that's how I really feel.\nANSWER: I'm a 28-year-old guy, and I guess I just started feeling really bad out of nowhere. I’ve got this really sharp pain in my chest, especially when I breathe or lie down, and it kind of goes to my neck and shoulders. I also started running a fever last night, and I feel short of breath, even when I’m just walking around a little. And I think my heartbeat has been kinda weird, irregular or something, the past couple of days.",
    "thinking": "I should mention the main problems first and be honest, even if I feel a bit embarrassed about some things. I want to explain my symptoms clearly but also seem unsure, as that's how I really feel.",
    "answer": "I'm a 28-year-old guy, and I guess I just started feeling really bad out of nowhere. I’ve got this really sharp pain in my chest, especially when I breathe or lie down, and it kind of goes to my neck and shoulders. I also started running a fever last night, and I feel short of breath, even when I’m just walking around a little. And I think my heartbeat has been kinda weird, irregular or something, the past couple of days.",
    "behavior_type": "information_withholder",
    "behavior_config": {
      "weight": 0.15,
      "description": "Patient initially omits embarrassing or stigmatized symptoms",
      "modifiers": [
        "embarrassed_symptoms",
        "gradual_revelation"
      ],
      "empathy_cues": [
        "hesitation",
        "vague_responses",
        "embarrassment",
        "trust_building_needed"
      ]
    },
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Can you tell me more about when these symptoms first started and how they have changed over time?information_withholder",
    "output": "THINKING: I feel a bit overwhelmed and worried because my symptoms came on suddenly and they're getting worse. I don’t really understand all the details, but I remember the fever and the chest pain starting las\nANSWER: It all started about two days ago with the pain and fever, and since then, the pain’s been sharper and I feel more short of breath, especially when I move or breathe deeply.",
    "thinking": "I feel a bit overwhelmed and worried because my symptoms came on suddenly and they're getting worse. I don’t really understand all the details, but I remember the fever and the chest pain starting las",
    "answer": "It all started about two days ago with the pain and fever, and since then, the pain’s been sharper and I feel more short of breath, especially when I move or breathe deeply.",
    "behavior_type": "information_withholder",
    "turn_count": 0,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.\"Can you tell me more about how these symptoms are affecting you day to day, and how severe or worrisome they feel to you when they happen?\"information_withholder",
    "output": "THINKING: I feel a bit overwhelmed and unsure how serious this is. I don’t want to overreact, but the chest pain and the stuff with my heartbeat are really bothering me, and I’m worried it might be something ba\nANSWER: Uh, it’s been really uncomfortable—like, the pain gets worse when I breathe or lie down, and I get tired easily. It feels pretty serious, but I don’t know how bad it actually is.",
    "thinking": "I feel a bit overwhelmed and unsure how serious this is. I don’t want to overreact, but the chest pain and the stuff with my heartbeat are really bothering me, and I’m worried it might be something ba",
    "answer": "Uh, it’s been really uncomfortable—like, the pain gets worse when I breathe or lie down, and I get tired easily. It feels pretty serious, but I don’t know how bad it actually is.",
    "behavior_type": "information_withholder",
    "turn_count": 2,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Can you tell me more about how your pain feels—like whether it’s constant or comes and goes, if it changes when you move or change your position, and how it’s affecting your daily activities and comfort level?information_withholder",
    "output": "THINKING: I feel a bit overwhelmed and worried about how all these things are happening at once. I don’t really understand what’s going on, but I know the pain and shortness of breath are making me uncomfortabl\nANSWER: It’s like a sharp pain in my chest that gets worse when I breathe or lie down, and I notice it more now when I do anything active. It’s been making it hard to breathe and I feel kind of tired and anxious.",
    "thinking": "I feel a bit overwhelmed and worried about how all these things are happening at once. I don’t really understand what’s going on, but I know the pain and shortness of breath are making me uncomfortabl",
    "answer": "It’s like a sharp pain in my chest that gets worse when I breathe or lie down, and I notice it more now when I do anything active. It’s been making it hard to breathe and I feel kind of tired and anxious.",
    "behavior_type": "information_withholder",
    "turn_count": 4,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Can you describe exactly where in your chest the pain is, and does the pain spread or radiate to other parts like your neck, jaw, or arms?information_withholder",
    "output": "THINKING: I feel a bit nervous talking about this, and I’m not sure how much detail I should give. The pain is definitely in my chest, but I’m wondering if I should mention the other stuff like my neck or shoul\nANSWER: Um, the pain is in the middle of my chest, and it kind of hurts more when I breathe in deep or lie down. It also seems to go up towards my neck and shoulders sometimes.",
    "thinking": "I feel a bit nervous talking about this, and I’m not sure how much detail I should give. The pain is definitely in my chest, but I’m wondering if I should mention the other stuff like my neck or shoul",
    "answer": "Um, the pain is in the middle of my chest, and it kind of hurts more when I breathe in deep or lie down. It also seems to go up towards my neck and shoulders sometimes.",
    "behavior_type": "information_withholder",
    "turn_count": 6,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Can you tell me exactly how your chest pain feels—like, is it constant or does it come and go? And does anything make it better or worse, such as moving, breathing deeply, or changing your position?information_withholder",
    "output": "THINKING: I feel a bit worried and confused about how all these symptoms are connected. I don’t really understand what’s happening, but the pain and the other stuff came on pretty suddenly, and I’m kind of scar\nANSWER: Um, it's a sharp pain in my chest, and it feels worse when I breathe in or lie down, and it kind of comes and goes. That's about all I feel I can say right now.",
    "thinking": "I feel a bit worried and confused about how all these symptoms are connected. I don’t really understand what’s happening, but the pain and the other stuff came on pretty suddenly, and I’m kind of scar",
    "answer": "Um, it's a sharp pain in my chest, and it feels worse when I breathe in or lie down, and it kind of comes and goes. That's about all I feel I can say right now.",
    "behavior_type": "information_withholder",
    "turn_count": 8,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Can you tell me if you've noticed any sweating, feeling faint or dizzy, or if you feel any chest tightness along with the pain?information_withholder",
    "output": "THINKING: I feel a bit embarrassed talking about everything at once, but I need to be honest about how uncomfortable I am. I am worried because the pain is pretty bad, and I feel like I can't breathe right some\nANSWER: Um, yeah, I’ve been feeling like I get really out of breath, especially when I move around, and the pain in my chest is sharp. It gets worse when I breathe deep or lie down. I also felt kinda dizzy sometimes, and I think I had a fever last night.",
    "thinking": "I feel a bit embarrassed talking about everything at once, but I need to be honest about how uncomfortable I am. I am worried because the pain is pretty bad, and I feel like I can't breathe right some",
    "answer": "Um, yeah, I’ve been feeling like I get really out of breath, especially when I move around, and the pain in my chest is sharp. It gets worse when I breathe deep or lie down. I also felt kinda dizzy sometimes, and I think I had a fever last night.",
    "behavior_type": "information_withholder",
    "turn_count": 10,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Can you tell me if you've noticed feeling more sweaty or hot, or if you’ve ever felt faint, dizzy, or like your chest is tightening along with the pain?information_withholder",
    "output": "THINKING: I'm not exactly sure what to say or how to describe it. I do feel kind of hot sometimes and a little dizzy, but I’m not really sure if that’s what you're asking about. I just feel off, and the chest p\nANSWER: Yeah, I’ve been feeling kind of hot and sometimes I get dizzy, but it’s all kind of confusing. The pain is the worst, especially when I breathe or move around.",
    "thinking": "I'm not exactly sure what to say or how to describe it. I do feel kind of hot sometimes and a little dizzy, but I’m not really sure if that’s what you're asking about. I just feel off, and the chest p",
    "answer": "Yeah, I’ve been feeling kind of hot and sometimes I get dizzy, but it’s all kind of confusing. The pain is the worst, especially when I breathe or move around.",
    "behavior_type": "information_withholder",
    "turn_count": 12,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Can you tell me if your fever feels worse at certain times, and if you've experienced any times when you're so dizzy or short of breath that you had to sit down or feel like you might faint?information_withholder",
    "output": "THINKING: I feel a bit scared about all this, but I don't really understand what's important or if I should be worried about the times when I get really dizzy. I do notice it gets worse when I breathe deeply or\nANSWER: Um, I guess the fever feels worse sometimes, especially in the evening, I think. And yeah, I do get really dizzy sometimes when I try to stand up quickly, but I don’t know if I could say it happens all the time or just sometimes.",
    "thinking": "I feel a bit scared about all this, but I don't really understand what's important or if I should be worried about the times when I get really dizzy. I do notice it gets worse when I breathe deeply or",
    "answer": "Um, I guess the fever feels worse sometimes, especially in the evening, I think. And yeah, I do get really dizzy sometimes when I try to stand up quickly, but I don’t know if I could say it happens all the time or just sometimes.",
    "behavior_type": "information_withholder",
    "turn_count": 14,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Have you experienced any episodes of your breathing becoming very fast or difficult, or feeling like your heartbeat is racing or irregular, and can I check your vital signs now to see how you're doing physically?information_withholder",
    "output": "THINKING: I feel a bit anxious when he asks about my breathing and heartbeat, but I also know I should tell him so he understands how I feel. I’m worried, but I don’t really understand what’s going on or what’s\nANSWER: Um, yeah, I’ve noticed my chest feels kind of tight and sharp, especially when I breathe deep or lie down. My heart’s been beating kinda funny or faster, I think, but I’m not really sure. I guess I can let you check, if you think I should.",
    "thinking": "I feel a bit anxious when he asks about my breathing and heartbeat, but I also know I should tell him so he understands how I feel. I’m worried, but I don’t really understand what’s going on or what’s",
    "answer": "Um, yeah, I’ve noticed my chest feels kind of tight and sharp, especially when I breathe deep or lie down. My heart’s been beating kinda funny or faster, I think, but I’m not really sure. I guess I can let you check, if you think I should.",
    "behavior_type": "information_withholder",
    "turn_count": 16,
    "gold_diagnosis": "Infectious pericarditis"
  },
  {
    "vignette_index": 300,
    "input": "**PATIENT CHARACTER:** Patient with Infectious pericarditis\n\nYou are a PATIENT: You are 28 AND your biological gender is male.\nYou are experiencing the following symptoms:\n- Sharp chest pain that worsens when you breathe deeply or lie down\n- Shortness of breath, especially when exerting yourself\n- A fever that came on suddenly last night\n- Pain radiating to your neck and shoulders\n- An irregular heartbeat that you’ve noticed over the past couple of days\nThese symptoms began suddenly about two days ago, starting with the chest pain and fever, and have since become more noticeable, especially when you try to breathe or change positions.Can I check your current vital signs, including your temperature, heart rate, blood pressure, and oxygen levels, so I can make sure you're stable right now?information_withholder",
    "output": "THINKING: I’m a little nervous about what all my vital signs might show, but I guess the doctor needs to know if I’m okay. I’m not sure what they’ll find, and I feel kind of worried even just thinking about it.\nANSWER: Uh, yeah, I guess so. I don’t really know what my numbers are supposed to be, but I feel pretty bad, especially with the pain and everything. Just make sure I’m okay.",
    "thinking": "I’m a little nervous about what all my vital signs might show, but I guess the doctor needs to know if I’m okay. I’m not sure what they’ll find, and I feel kind of worried even just thinking about it.",
    "answer": "Uh, yeah, I guess so. I don’t really know what my numbers are supposed to be, but I feel pretty bad, especially with the pain and everything. Just make sure I’m okay.",
    "behavior_type": "information_withholder",
    "turn_count": 18,
    "gold_diagnosis": "Infectious pericarditis"
  }
]