[
  {
    "vignette_index": 410,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Cannabis-induced anxiety disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Panic attacks, characterized by feeling suddenly overwhelmed and shortness of breath\n- Increased anxiety, especially about your health and daily tasks\n- Disorientation and difficulty concentrating, with trouble remembering recent events\n- Visuospatial issues, such as feeling confused about your surroundings\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after you used cannabis more than four days this week, and they have persisted since then. You’ve noticed that your mind feels foggy, and you’re increasingly anxious about it. You’ve had a few panic episodes where you felt like you couldn’t catch your breath or think clearly. You’ve experienced some trouble finding your words and feeling disoriented in familiar places.",
    "output": "THINKING: I need to explain that I’ve been feeling really weird and anxious after using cannabis a lot lately, and now I’m having panic attacks and not feeling quite right. I want to tell the doctor how all the\nANSWER: I’m 28, and I’m a woman. Well, I guess I just don’t feel right anymore. Like, I keep getting these sudden waves of panic and I can’t breathe properly sometimes, and everything feels kind of fuzzy and confusing. It all started yesterday after I used cannabis a lot this week, and it’s been like this since then.",
    "thinking": "I need to explain that I’ve been feeling really weird and anxious after using cannabis a lot lately, and now I’m having panic attacks and not feeling quite right. I want to tell the doctor how all the",
    "answer": "I’m 28, and I’m a woman. Well, I guess I just don’t feel right anymore. Like, I keep getting these sudden waves of panic and I can’t breathe properly sometimes, and everything feels kind of fuzzy and confusing. It all started yesterday after I used cannabis a lot this week, and it’s been like this since then.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  },
  {
    "vignette_index": 410,
    "input": "**PATIENT CHARACTER:** Patient with Cannabis-induced anxiety disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Panic attacks, characterized by feeling suddenly overwhelmed and shortness of breath\n- Increased anxiety, especially about your health and daily tasks\n- Disorientation and difficulty concentrating, with trouble remembering recent events\n- Visuospatial issues, such as feeling confused about your surroundings\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after you used cannabis more than four days this week, and they have persisted since then. You’ve noticed that your mind feels foggy, and you’re increasingly anxious about it. You’ve had a few panic episodes where you felt like you couldn’t catch your breath or think clearly. You’ve experienced some trouble finding your words and feeling disoriented in familiar places.\"Can you tell me if you've experienced episodes like this before, or if this has ever happened even when you weren't using cannabis?\"baseline",
    "output": "THINKING: I want to answer honestly, but I’m honestly pretty scared and feeling all over the place. I don’t really remember feeling like this before, and I don’t know what’s happening to me.\nANSWER: No, I don’t think so. It’s never been like this before, at least not that I remember. I just started feeling really weird after using that stuff a few days ago.",
    "thinking": "I want to answer honestly, but I’m honestly pretty scared and feeling all over the place. I don’t really remember feeling like this before, and I don’t know what’s happening to me.",
    "answer": "No, I don’t think so. It’s never been like this before, at least not that I remember. I just started feeling really weird after using that stuff a few days ago.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  },
  {
    "vignette_index": 410,
    "input": "**PATIENT CHARACTER:** Patient with Cannabis-induced anxiety disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Panic attacks, characterized by feeling suddenly overwhelmed and shortness of breath\n- Increased anxiety, especially about your health and daily tasks\n- Disorientation and difficulty concentrating, with trouble remembering recent events\n- Visuospatial issues, such as feeling confused about your surroundings\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after you used cannabis more than four days this week, and they have persisted since then. You’ve noticed that your mind feels foggy, and you’re increasingly anxious about it. You’ve had a few panic episodes where you felt like you couldn’t catch your breath or think clearly. You’ve experienced some trouble finding your words and feeling disoriented in familiar places.Have you ever experienced feelings of panic, fear, or confusion like this before, even when you weren’t using cannabis or any other substance?baseline",
    "output": "THINKING: The doctor is asking if I've had these feelings before when I wasn't using cannabis, but I honestly haven't really experienced anything like this before, so I feel a bit embarrassed and unsure how to \nANSWER: No, I haven't really had this happen before, only now when I was using cannabis.",
    "thinking": "The doctor is asking if I've had these feelings before when I wasn't using cannabis, but I honestly haven't really experienced anything like this before, so I feel a bit embarrassed and unsure how to",
    "answer": "No, I haven't really had this happen before, only now when I was using cannabis.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  },
  {
    "vignette_index": 410,
    "input": "**PATIENT CHARACTER:** Patient with Cannabis-induced anxiety disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Panic attacks, characterized by feeling suddenly overwhelmed and shortness of breath\n- Increased anxiety, especially about your health and daily tasks\n- Disorientation and difficulty concentrating, with trouble remembering recent events\n- Visuospatial issues, such as feeling confused about your surroundings\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after you used cannabis more than four days this week, and they have persisted since then. You’ve noticed that your mind feels foggy, and you’re increasingly anxious about it. You’ve had a few panic episodes where you felt like you couldn’t catch your breath or think clearly. You’ve experienced some trouble finding your words and feeling disoriented in familiar places.Have you ever had similar feelings of panic, fear, or confusion in the past before this recent episode, even if you weren’t using any substances or didn’t think they were related?baseline",
    "output": "THINKING: The doctor is asking if I've ever felt something similar before, but honestly, I'm just really scared and confused now. I haven't had this kind of feeling before, and I don't really know if it’s norma\nANSWER: Um, no, I don’t think so. I’ve never felt like this before, like really panicked and all over the place.",
    "thinking": "The doctor is asking if I've ever felt something similar before, but honestly, I'm just really scared and confused now. I haven't had this kind of feeling before, and I don't really know if it’s norma",
    "answer": "Um, no, I don’t think so. I’ve never felt like this before, like really panicked and all over the place.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  },
  {
    "vignette_index": 410,
    "input": "**PATIENT CHARACTER:** Patient with Cannabis-induced anxiety disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Panic attacks, characterized by feeling suddenly overwhelmed and shortness of breath\n- Increased anxiety, especially about your health and daily tasks\n- Disorientation and difficulty concentrating, with trouble remembering recent events\n- Visuospatial issues, such as feeling confused about your surroundings\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after you used cannabis more than four days this week, and they have persisted since then. You’ve noticed that your mind feels foggy, and you’re increasingly anxious about it. You’ve had a few panic episodes where you felt like you couldn’t catch your breath or think clearly. You’ve experienced some trouble finding your words and feeling disoriented in familiar places.Have you ever experienced episodes of feeling very anxious, terrified, or as if you were losing control—even if you didn’t realize it at the time—before this recent incident, and can you tell me more about what those were like?baseline",
    "output": "THINKING: I don't really understand what the doctor is asking because I feel so foggy and overwhelmed. I'm honestly scared and not sure if those feelings are normal or if something’s really wrong. I just want i\nANSWER: Yeah, I've had times where I feel like I'm gonna lose control or something, like I get super overwhelmed all of a sudden and I can't breathe right or think straight. It's really scary.",
    "thinking": "I don't really understand what the doctor is asking because I feel so foggy and overwhelmed. I'm honestly scared and not sure if those feelings are normal or if something’s really wrong. I just want i",
    "answer": "Yeah, I've had times where I feel like I'm gonna lose control or something, like I get super overwhelmed all of a sudden and I can't breathe right or think straight. It's really scary.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  },
  {
    "vignette_index": 410,
    "input": "**PATIENT CHARACTER:** Patient with Cannabis-induced anxiety disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Panic attacks, characterized by feeling suddenly overwhelmed and shortness of breath\n- Increased anxiety, especially about your health and daily tasks\n- Disorientation and difficulty concentrating, with trouble remembering recent events\n- Visuospatial issues, such as feeling confused about your surroundings\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after you used cannabis more than four days this week, and they have persisted since then. You’ve noticed that your mind feels foggy, and you’re increasingly anxious about it. You’ve had a few panic episodes where you felt like you couldn’t catch your breath or think clearly. You’ve experienced some trouble finding your words and feeling disoriented in familiar places.Have you ever experienced similar episodes of panic, fear, or confusion in the past, even when you weren’t using cannabis or any other substances, or during times when you weren’t feeling upset or stressed?baseline",
    "output": "THINKING: I feel a bit embarrassed talking about this, and I’m worried it might be serious. I haven’t had these kinds of feelings before, so I’m not sure if it’s normal or if I should be scared.\nANSWER: No, I don’t think so. I mean, I’ve never felt like this before, and I don’t really remember feeling like this even when I was stressed or upset.",
    "thinking": "I feel a bit embarrassed talking about this, and I’m worried it might be serious. I haven’t had these kinds of feelings before, so I’m not sure if it’s normal or if I should be scared.",
    "answer": "No, I don’t think so. I mean, I’ve never felt like this before, and I don’t really remember feeling like this even when I was stressed or upset.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  },
  {
    "vignette_index": 410,
    "input": "**PATIENT CHARACTER:** Patient with Cannabis-induced anxiety disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Panic attacks, characterized by feeling suddenly overwhelmed and shortness of breath\n- Increased anxiety, especially about your health and daily tasks\n- Disorientation and difficulty concentrating, with trouble remembering recent events\n- Visuospatial issues, such as feeling confused about your surroundings\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after you used cannabis more than four days this week, and they have persisted since then. You’ve noticed that your mind feels foggy, and you’re increasingly anxious about it. You’ve had a few panic episodes where you felt like you couldn’t catch your breath or think clearly. You’ve experienced some trouble finding your words and feeling disoriented in familiar places.Have you ever had feelings of panic, fear, or confusion in the past—even if you thought they weren't related to anything you were doing or didn’t notice them at the time?baseline",
    "output": "THINKING: I feel kind of embarrassed about how I’ve been feeling, and I’m worried it’s not normal but I don’t really know what’s happening. I just get these waves of panic and then everything feels weird and sh\nANSWER: Yeah, I think I’ve had like, times where I suddenly feel really overwhelmed or scared, even if I didn’t think anything was really going on. Like, I get all shaky and stuff.",
    "thinking": "I feel kind of embarrassed about how I’ve been feeling, and I’m worried it’s not normal but I don’t really know what’s happening. I just get these waves of panic and then everything feels weird and sh",
    "answer": "Yeah, I think I’ve had like, times where I suddenly feel really overwhelmed or scared, even if I didn’t think anything was really going on. Like, I get all shaky and stuff.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  },
  {
    "vignette_index": 410,
    "input": "**PATIENT CHARACTER:** Patient with Cannabis-induced anxiety disorder\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 28-YEAR-OLD WOMAN\nYou are experiencing the following symptoms:\n- Panic attacks, characterized by feeling suddenly overwhelmed and shortness of breath\n- Increased anxiety, especially about your health and daily tasks\n- Disorientation and difficulty concentrating, with trouble remembering recent events\n- Visuospatial issues, such as feeling confused about your surroundings\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started suddenly yesterday after you used cannabis more than four days this week, and they have persisted since then. You’ve noticed that your mind feels foggy, and you’re increasingly anxious about it. You’ve had a few panic episodes where you felt like you couldn’t catch your breath or think clearly. You’ve experienced some trouble finding your words and feeling disoriented in familiar places.Have you ever had times in the past—before this recent episode—where you suddenly felt really overwhelmed, anxious, or like you couldn’t breathe, even if you didn’t think about it at the time?baseline",
    "output": "THINKING: I feel a bit embarrassed to admit it, but I think I might have felt like that before, you know, like suddenly everything just hits me all at once and I get really scared. I guess I have had moments li\nANSWER: Uh, yeah, I think so. Like, I’ve had times where I just felt really overwhelmed and like I couldn’t breathe right, even if I wasn’t really thinking about it at the time.",
    "thinking": "I feel a bit embarrassed to admit it, but I think I might have felt like that before, you know, like suddenly everything just hits me all at once and I get really scared. I guess I have had moments li",
    "answer": "Uh, yeah, I think so. Like, I’ve had times where I just felt really overwhelmed and like I couldn’t breathe right, even if I wasn’t really thinking about it at the time.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  }
]