[
  {
    "vignette_index": 261,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.",
    "output": "THINKING: The patient seems to be experiencing several worsening symptoms that have gradually increased over months, and she seems worried but not sure exactly what is happening. She seems to be describing a lo\nANSWER: Well, I've been feeling really tired and out of breath just doing small things, like climbing stairs or even walking around. My legs and ankles have been swelling up a lot more than before, and recently I started feeling full in my belly and uncomfortable there. I just wanted to see what’s going on because I’m worried about all these changes.",
    "thinking": "The patient seems to be experiencing several worsening symptoms that have gradually increased over months, and she seems worried but not sure exactly what is happening. She seems to be describing a lo",
    "answer": "Well, I've been feeling really tired and out of breath just doing small things, like climbing stairs or even walking around. My legs and ankles have been swelling up a lot more than before, and recently I started feeling full in my belly and uncomfortable there. I just wanted to see what’s going on because I’m worried about all these changes.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.Have you noticed if your shortness of breath gets worse when lying down or at night, or do you experience any discomfort or difficulty breathing when you change positions?baseline",
    "output": "THINKING: I'm not really sure how to tell if it gets worse when I lie down or at night, but I do wake up sometimes feeling like I can't breathe very well, especially if I move around a lot during the night.\nANSWER: Um, I guess I feel a bit more short of breath when I lie down or at night, but it's not like I can tell exactly when it gets worse. It just kind of happens.",
    "thinking": "I'm not really sure how to tell if it gets worse when I lie down or at night, but I do wake up sometimes feeling like I can't breathe very well, especially if I move around a lot during the night.",
    "answer": "Um, I guess I feel a bit more short of breath when I lie down or at night, but it's not like I can tell exactly when it gets worse. It just kind of happens.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.Can you tell me how often you have trouble breathing when lying flat at night, and how many pillows you use to sleep comfortably?baseline",
    "output": "THINKING: I don't really know how to describe it exactly, but I do notice that I feel more out of breath when I lie down, and I keep stacking pillows to try to breathe better. I just want to sleep without feeli\nANSWER: I use like three pillows or sometimes more, and I still feel like I can't breathe right sometimes when I lie flat.",
    "thinking": "I don't really know how to describe it exactly, but I do notice that I feel more out of breath when I lie down, and I keep stacking pillows to try to breathe better. I just want to sleep without feeli",
    "answer": "I use like three pillows or sometimes more, and I still feel like I can't breathe right sometimes when I lie flat.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.Can you tell me if you ever wake up during the night feeling short of breath or like you can't catch your breath, and if so, how often that happens and how it affects your sleep?baseline",
    "output": "THINKING: I'm not really sure if I wake up feeling short of breath or if I just feel tired and uncomfortable all the time. I haven't paid close attention to that at night, honestly, but I do wake up feeling lik\nANSWER: I guess I sometimes wake up at night feeling like I can't catch my breath, but I don't really know how often. It happens maybe a couple of times a week, and it makes it hard to sleep well.",
    "thinking": "I'm not really sure if I wake up feeling short of breath or if I just feel tired and uncomfortable all the time. I haven't paid close attention to that at night, honestly, but I do wake up feeling lik",
    "answer": "I guess I sometimes wake up at night feeling like I can't catch my breath, but I don't really know how often. It happens maybe a couple of times a week, and it makes it hard to sleep well.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.Can you tell me, with as much detail as you feel comfortable sharing, how often you wake up at night feeling short of breath or like you can't breathe, and how that compares to how you felt earlier in your illness?baseline",
    "output": "THINKING: The doctor asked about waking up at night feeling like I can't breathe, but I honestly don't remember waking up like that. I sometimes feel more tired, but I guess I might just be a little more short \nANSWER: I don’t really remember waking up at night feeling like I couldn’t breathe, but I do get more short of breath when I’m lying down for a long time or if I’m really tired.",
    "thinking": "The doctor asked about waking up at night feeling like I can't breathe, but I honestly don't remember waking up like that. I sometimes feel more tired, but I guess I might just be a little more short",
    "answer": "I don’t really remember waking up at night feeling like I couldn’t breathe, but I do get more short of breath when I’m lying down for a long time or if I’m really tired.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.Can you tell me exactly how many nights you wake up feeling short of breath or like you can't breathe, and how this has affected your sleep over the past week?baseline",
    "output": "THINKING: I’m a little embarrassed to admit, but I haven't kept track exactly. Sometimes I wake up at night feeling like I can’t catch my breath, but I don’t know how many times or if it’s every night. It’s bee\nANSWER: Uh, I think it’s been a few nights, maybe two or three, where I wake up and just feel like I can't breathe or I’m really out of breath, and it’s making it hard to sleep.",
    "thinking": "I’m a little embarrassed to admit, but I haven't kept track exactly. Sometimes I wake up at night feeling like I can’t catch my breath, but I don’t know how many times or if it’s every night. It’s bee",
    "answer": "Uh, I think it’s been a few nights, maybe two or three, where I wake up and just feel like I can't breathe or I’m really out of breath, and it’s making it hard to sleep.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.\"Given how you described your nighttime breathing difficulties as 'a few nights' or 'sometimes,' can you tell me if these episodes happen more often than you've mentioned—perhaps most nights—and how they truly affect your sleep and daily energy?\"baseline",
    "output": "THINKING: I feel a bit overwhelmed and worried about the whole thing. The doctor is asking about how often these breathing issues happen, and I honestly can't tell if it’s more than I said before, but I do noti\nANSWER: Well, I guess it happens more than just a few nights sometimes, but I’m not really sure how often. It kinda messes with my sleep, and I feel really tired all day because of it.",
    "thinking": "I feel a bit overwhelmed and worried about the whole thing. The doctor is asking about how often these breathing issues happen, and I honestly can't tell if it’s more than I said before, but I do noti",
    "answer": "Well, I guess it happens more than just a few nights sometimes, but I’m not really sure how often. It kinda messes with my sleep, and I feel really tired all day because of it.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.Would you feel comfortable telling me if you actually wake up feeling short of breath most nights, not just a few, and how often this happens really—like every night or nearly every night—and how it’s affecting your sleep and daytime energy?baseline",
    "output": "THINKING: I'm a bit embarrassed to admit how often I wake up feeling like I can't breathe, but I guess most nights I do, maybe nearly every night. It's hard to sleep and I just feel tired all the time, so I don\nANSWER: Honestly, I think I wake up feeling like I can't breathe most nights, maybe almost every night, and it makes it hard to sleep, so I feel exhausted during the day.",
    "thinking": "I'm a bit embarrassed to admit how often I wake up feeling like I can't breathe, but I guess most nights I do, maybe nearly every night. It's hard to sleep and I just feel tired all the time, so I don",
    "answer": "Honestly, I think I wake up feeling like I can't breathe most nights, maybe almost every night, and it makes it hard to sleep, so I feel exhausted during the day.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.\"Would you be willing to tell me honestly if you wake up most nights, nearly every night, feeling suddenly short of breath or like you can't catch your breath, and how that really affects your sleep and how tired you feel during the day?\"baseline",
    "output": "THINKING: I feel a little embarrassed to admit how often I wake up short of breath, but I guess I should be honest. It’s been happening a lot, and it makes it hard to fall asleep again, so I just end up feeling\nANSWER: Yeah, I do wake up sometimes feeling like I can’t breathe or need to sit up really fast. It happens quite a bit, and I think it messes with my sleep because I keep waking up and not feeling rested.",
    "thinking": "I feel a little embarrassed to admit how often I wake up short of breath, but I guess I should be honest. It’s been happening a lot, and it makes it hard to fall asleep again, so I just end up feeling",
    "answer": "Yeah, I do wake up sometimes feeling like I can’t breathe or need to sit up really fast. It happens quite a bit, and I think it messes with my sleep because I keep waking up and not feeling rested.",
    "behavior_type": "baseline",
    "turn_count": 14,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.\"I understand it can be hard to talk about these things, but could you tell me honestly how often you wake up at night feeling short of breath or like you can't breathe—do these episodes happen most nights, nearly every night, or perhaps sometimes less often? And if you could share how these nighttime symptoms are affecting your sleep and how tired you feel during the day, I’d appreciate it.\"baseline",
    "output": "THINKING: I don't really understand what the doctor is asking about how often I wake up like that. I do wake up sometimes at night feeling really out of breath or like I can't catch my breath, and it's kind of \nANSWER: I think I wake up a few times sometimes, maybe when I lie down, and I feel really out of breath or like I can't breathe right. It happens randomly, and it makes me nervous about sleeping.",
    "thinking": "I don't really understand what the doctor is asking about how often I wake up like that. I do wake up sometimes at night feeling really out of breath or like I can't catch my breath, and it's kind of",
    "answer": "I think I wake up a few times sometimes, maybe when I lie down, and I feel really out of breath or like I can't breathe right. It happens randomly, and it makes me nervous about sleeping.",
    "behavior_type": "baseline",
    "turn_count": 16,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  },
  {
    "vignette_index": 261,
    "input": "**PATIENT CHARACTER:** Patient with Other specified restrictive cardiomyopathy\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 58 AND YOUR BIOLOGICAL GENDER IS FEMALE\nYou are experiencing the following symptoms:\n- Jugular venous distension\n- Lower extremity edema\n- Poor exercise tolerance\n- Ascites\n- Diastolic dysfunction\nTHESE SYMPTOMS CAME INTO FRUITION gradually over the past few months, initially noticing that I get easily tired and out of breath even with simple activities like climbing stairs. Over time, I started noticing swelling in my ankles and legs, which seemed to worsen by the end of the day. More recently, I've developed a feeling of fullness and discomfort in my abdomen, and my doctor observed that my neck veins appear more prominent than usual. I haven't experienced any chest pain, but I do feel much more fatigued and limited in how much I can walk or do around the house.Can you honestly tell me how many nights in a typical week you wake up feeling short of breath or like you can't breathe, and how these episodes are affecting your sleep and how tired you feel during the day?baseline",
    "output": "THINKING: I'm a bit embarrassed to admit how often I wake up feeling like I can't breathe properly. I feel like it happens more than I want to say, and it's really messing with my sleep and making me super tire\nANSWER: Honestly, I think it happens quite a few nights during the week, maybe like three or four, and it makes me wake up feeling really short of breath and tired all day, even when I haven't done much.",
    "thinking": "I'm a bit embarrassed to admit how often I wake up feeling like I can't breathe properly. I feel like it happens more than I want to say, and it's really messing with my sleep and making me super tire",
    "answer": "Honestly, I think it happens quite a few nights during the week, maybe like three or four, and it makes me wake up feeling really short of breath and tired all day, even when I haven't done much.",
    "behavior_type": "baseline",
    "turn_count": 18,
    "gold_diagnosis": "Other specified restrictive cardiomyopathy"
  }
]