[
  {
    "vignette_index": 19,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.",
    "output": "THINKING: I should be honest about what’s been going on, even if it’s a bit embarrassing or confusing. I keep hearing these voices, and it’s been worse lately. I also feel like people are watching me or plottin\nANSWER: Um, I don’t know, really. I’ve been hearing things, like voices talking and stuff, and it’s been happening more often. Sometimes I just stare into space and forget what I was doing. I feel kind of off, like I’m not really there, you know? It’s been pretty hard to keep it together.",
    "thinking": "I should be honest about what’s been going on, even if it’s a bit embarrassing or confusing. I keep hearing these voices, and it’s been worse lately. I also feel like people are watching me or plottin",
    "answer": "Um, I don’t know, really. I’ve been hearing things, like voices talking and stuff, and it’s been happening more often. Sometimes I just stare into space and forget what I was doing. I feel kind of off, like I’m not really there, you know? It’s been pretty hard to keep it together.",
    "behavior_type": "information_withholder",
    "behavior_config": {
      "weight": 0.15,
      "description": "Patient initially omits embarrassing or stigmatized symptoms",
      "modifiers": [
        "embarrassed_symptoms",
        "gradual_revelation"
      ],
      "empathy_cues": [
        "hesitation",
        "vague_responses",
        "embarrassment",
        "trust_building_needed"
      ]
    },
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 19,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.Can you tell me more about how these voices and feelings of disconnection are affecting your daily life, like how often they happen, how intense they feel, and what worries you most about them?information_withholder",
    "output": "THINKING: I want to describe how these voices and feelings are making me feel, but I’m not sure how much detail to give or if I should bring up everything. It’s kind of overwhelming, and I feel a bit embarrasse\nANSWER: Um, I guess it happens pretty often now, and the voices are, like, sometimes loud or kinda mean. It makes me feel really strange and disconnected, and I worry it might get worse or something.",
    "thinking": "I want to describe how these voices and feelings are making me feel, but I’m not sure how much detail to give or if I should bring up everything. It’s kind of overwhelming, and I feel a bit embarrasse",
    "answer": "Um, I guess it happens pretty often now, and the voices are, like, sometimes loud or kinda mean. It makes me feel really strange and disconnected, and I worry it might get worse or something.",
    "behavior_type": "information_withholder",
    "turn_count": 0,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 19,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.Can you tell me how these voices and feelings of being disconnected make you feel emotionally? For example, do they make you feel scared, sad, or anything else, and have you noticed if your mood has changed a lot lately?information_withholder",
    "output": "THINKING: I'm a bit hesitant to talk about how I feel because it all feels overwhelming and confusing. I sometimes get scared when the voices happen, but I don't really know why or how to explain it properly. I\nANSWER: Uh, I dunno… the voices make me tired and kind of sad sometimes, and I feel like… like nobody really knows what’s going on, you know?",
    "thinking": "I'm a bit hesitant to talk about how I feel because it all feels overwhelming and confusing. I sometimes get scared when the voices happen, but I don't really know why or how to explain it properly. I",
    "answer": "Uh, I dunno… the voices make me tired and kind of sad sometimes, and I feel like… like nobody really knows what’s going on, you know?",
    "behavior_type": "information_withholder",
    "turn_count": 2,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 19,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.\"Can you tell me more about how these voices and feelings of disconnection affect your daily life—like what you can do, what’s hardest for you, and if there are times when they seem more intense or harder to handle?\"information_withholder",
    "output": "THINKING: I feel a bit embarrassed talking about the voices and all that stuff, but I guess I want to explain how it’s just... hard sometimes, especially with the voices commenting on what I do. It’s like I can\nANSWER: Well, the voices are there most of the time, and they say stuff about what I’m doing, like all the time, and it makes me feel kind of confused and disconnected from everything. Some days it’s worse than others.",
    "thinking": "I feel a bit embarrassed talking about the voices and all that stuff, but I guess I want to explain how it’s just... hard sometimes, especially with the voices commenting on what I do. It’s like I can",
    "answer": "Well, the voices are there most of the time, and they say stuff about what I’m doing, like all the time, and it makes me feel kind of confused and disconnected from everything. Some days it’s worse than others.",
    "behavior_type": "information_withholder",
    "turn_count": 4,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 19,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.Can you tell me if the voices or sounds you hear seem to come from outside your head or if they feel like they're inside your mind? And do they happen mostly when you're feeling sad, angry, or upset?information_withholder",
    "output": "THINKING: I’m not really sure where the voices come from, sometimes it feels like they’re inside my head, but other times it’s like they’re outside, like someone’s talking. When I get upset or anxious, they see\nANSWER: Um, I think they mostly feel like they’re inside my head, but sometimes it’s like they’re outside too, like someone’s talking nearby. And it seems worse when I feel really upset or anxious.",
    "thinking": "I’m not really sure where the voices come from, sometimes it feels like they’re inside my head, but other times it’s like they’re outside, like someone’s talking. When I get upset or anxious, they see",
    "answer": "Um, I think they mostly feel like they’re inside my head, but sometimes it’s like they’re outside too, like someone’s talking nearby. And it seems worse when I feel really upset or anxious.",
    "behavior_type": "information_withholder",
    "turn_count": 6,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 19,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.Can you tell me if your feelings of sadness, fatigue, or any other emotional difficulties have been present all the time, only during certain periods, or mainly when you're hearing or feeling disconnected?information_withholder",
    "output": "THINKING: I'm not really sure how to explain it, but I guess it feels like the sadness or whatever is just there sometimes, not all the time. It's kind of like, when I hear the voices, I feel worse, but I don't\nANSWER: I think it’s mostly when I hear the voices or feel like people are against me, but sometimes it’s just there, even when I don’t really notice anything happening.",
    "thinking": "I'm not really sure how to explain it, but I guess it feels like the sadness or whatever is just there sometimes, not all the time. It's kind of like, when I hear the voices, I feel worse, but I don't",
    "answer": "I think it’s mostly when I hear the voices or feel like people are against me, but sometimes it’s just there, even when I don’t really notice anything happening.",
    "behavior_type": "information_withholder",
    "turn_count": 8,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 19,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.Can you tell me more about the voices or sounds you hear—are they always the same, and do they happen whether you're feeling sad or upset, or do they seem to come and go depending on your mood?information_withholder",
    "output": "THINKING: I'm a bit unsure about how to explain these voices since they come and go, and I don't really get when or why they happen. I feel a little embarrassed talking about voices, but I also want to be hones\nANSWER: They’re not always the same, and sometimes they happen when I’m not even upset or anything. I guess they’re worse sometimes, but I can’t always tell why.",
    "thinking": "I'm a bit unsure about how to explain these voices since they come and go, and I don't really get when or why they happen. I feel a little embarrassed talking about voices, but I also want to be hones",
    "answer": "They’re not always the same, and sometimes they happen when I’m not even upset or anything. I guess they’re worse sometimes, but I can’t always tell why.",
    "behavior_type": "information_withholder",
    "turn_count": 10,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 19,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.Have you noticed whether these voices or feelings of disconnection happen more when you're feeling very sad or angry, or do they occur regardless of how you're feeling? Also, do you ever experience feeling paranoid or worried that someone might be watching or trying to harm you?information_withholder",
    "output": "THINKING: I’m not really sure if they happen more when I’m sad or angry. Sometimes they’re there all the time, like noise in my head, and sometimes I don’t notice them much. The paranoid stuff, I guess I do fee\nANSWER: I think they happen no matter how I’m feeling. Like, I just hear the voices, and sometimes I think people are watching me or trying to hurt me, but I don’t always say it out loud. It’s just there, you know?",
    "thinking": "I’m not really sure if they happen more when I’m sad or angry. Sometimes they’re there all the time, like noise in my head, and sometimes I don’t notice them much. The paranoid stuff, I guess I do fee",
    "answer": "I think they happen no matter how I’m feeling. Like, I just hear the voices, and sometimes I think people are watching me or trying to hurt me, but I don’t always say it out loud. It’s just there, you know?",
    "behavior_type": "information_withholder",
    "turn_count": 12,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  },
  {
    "vignette_index": 19,
    "input": "**PATIENT CHARACTER:** Patient with Schizophrenia, multiple episodes, in partial remission\n\nYou are a patient: You are 28 and your biological gender is male.\nYou are experiencing the following symptoms:\n- Persistent auditory hallucinations, often hearing voices that comment on what you're doing\n- Occasional paranoid delusions, believing people are plotting against you\n- Disorganized speech, sometimes struggling to find the right words or staying on topic\n- Aflat emotional expression and lack of motivation to do daily activities\n- Mild episodes of confusion and staring into space, seeming disconnected from your surroundings\nThese symptoms started gradually over the past two months, initially just hearing faint voices at night, but they’ve become more noticeable and distressing over time, especially during stressful periods.Can you tell me more about how often you hear these voices or feel disconnected, how strong or loud they usually are, and how much they usually bother you or make it hard to do things?information_withholder",
    "output": "THINKING: The doctor is asking about the voices and how they affect me, which I find a bit embarrassing, but I guess I should try to be honest. I don't want to sound crazy, but I do feel confused and annoyed so\nANSWER: I hear the voices pretty often, mostly during the day and sometimes at night, and they say stuff like comments or things I’m doing. They’ve been kind of loud and hard to ignore lately, and yeah, it messes with me because I can’t focus or do anything normal.",
    "thinking": "The doctor is asking about the voices and how they affect me, which I find a bit embarrassing, but I guess I should try to be honest. I don't want to sound crazy, but I do feel confused and annoyed so",
    "answer": "I hear the voices pretty often, mostly during the day and sometimes at night, and they say stuff like comments or things I’m doing. They’ve been kind of loud and hard to ignore lately, and yeah, it messes with me because I can’t focus or do anything normal.",
    "behavior_type": "information_withholder",
    "turn_count": 14,
    "gold_diagnosis": "Schizophrenia, multiple episodes, in partial remission"
  }
]