[
  {
    "vignette_index": 30,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.",
    "output": "THINKING: The patient is clearly distressed and overwhelmed by her symptoms, and she seems worried about her health issues, especially since they came on suddenly and seem pretty severe. She’s also trying to co\nANSWER: I’m really not feeling good. I started having this really bad pain down there yesterday, and now I have a fever and chills today. I've been feeling really tired and just… not right. It’s been happening over the past week, but it suddenly got worse, and I don’t know what’s going on.",
    "thinking": "The patient is clearly distressed and overwhelmed by her symptoms, and she seems worried about her health issues, especially since they came on suddenly and seem pretty severe. She’s also trying to co",
    "answer": "I’m really not feeling good. I started having this really bad pain down there yesterday, and now I have a fever and chills today. I've been feeling really tired and just… not right. It’s been happening over the past week, but it suddenly got worse, and I don’t know what’s going on.",
    "behavior_type": "baseline",
    "behavior_config": {
      "weight": 0.4,
      "description": "Standard patient behavior",
      "modifiers": [],
      "empathy_cues": []
    },
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Can you tell me exactly when your pain first started, how it has changed over time, and whether it's on one side or both sides?baseline",
    "output": "THINKING: The doctor wants to understand the timeline and location of my pain, but honestly, I’m a bit overwhelmed and not sure how to explain it clearly. I just know it got worse really fast yesterday, and I’m\nANSWER: It started kind of suddenly yesterday with really bad pain, and now it’s everywhere down there. It’s worse now than before, and I don’t really remember exactly how it changed, it just all came on pretty quick.",
    "thinking": "The doctor wants to understand the timeline and location of my pain, but honestly, I’m a bit overwhelmed and not sure how to explain it clearly. I just know it got worse really fast yesterday, and I’m",
    "answer": "It started kind of suddenly yesterday with really bad pain, and now it’s everywhere down there. It’s worse now than before, and I don’t really remember exactly how it changed, it just all came on pretty quick.",
    "behavior_type": "baseline",
    "turn_count": 0,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Can you tell me more about how your pain feels—like is it sharp, achy, or throbbing—and whether it has stayed in the same place or moved around since it started?baseline",
    "output": "THINKING: I'm feeling nervous and overwhelmed, trying to describe my pain without really understanding what it is. I just know it’s really bad and feels like it’s all over or in one spot, but I don’t know if it\nANSWER: Uh, it’s like a really bad ache, I guess. It stays in one place mostly, but sometimes it kind of spreads out, I think. It’s been staying pretty much the same since it started.",
    "thinking": "I'm feeling nervous and overwhelmed, trying to describe my pain without really understanding what it is. I just know it’s really bad and feels like it’s all over or in one spot, but I don’t know if it",
    "answer": "Uh, it’s like a really bad ache, I guess. It stays in one place mostly, but sometimes it kind of spreads out, I think. It’s been staying pretty much the same since it started.",
    "behavior_type": "baseline",
    "turn_count": 2,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Can you tell me more about how exactly your pain feels when you notice it—like is it sharp, dull, or crampy—and whether you've felt it mostly in one spot or all over the place since it started?baseline",
    "output": "THINKING: I'm worried about the pain because it's really sharp and sudden, but I'm not sure how to explain it. It kind of feels like it's all over, but also like it's in one spot sometimes, and I just want it t\nANSWER: Um, it's like a really sharp pain, and I feel it in different places, sometimes more in the middle and other times kind of all over down there. It’s pretty intense, and I don’t really know what to do.",
    "thinking": "I'm worried about the pain because it's really sharp and sudden, but I'm not sure how to explain it. It kind of feels like it's all over, but also like it's in one spot sometimes, and I just want it t",
    "answer": "Um, it's like a really sharp pain, and I feel it in different places, sometimes more in the middle and other times kind of all over down there. It’s pretty intense, and I don’t really know what to do.",
    "behavior_type": "baseline",
    "turn_count": 4,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Can you tell me if your pain ever comes and goes suddenly, or if it's been pretty constant since it started? And is there anything you notice that makes it worse or better, like movement, pressure, or anything else?baseline",
    "output": "THINKING: The pain started suddenly yesterday and has gotten worse, but I can't really tell if it comes and goes or stays the same. I'm not sure what makes it better or worse, but it's definitely really bad rig\nANSWER: Um, it kind of feels like it's there all the time now, but earlier it was like it just started suddenly, and I don't really know if anything makes it better or worse. It just hurts a lot.",
    "thinking": "The pain started suddenly yesterday and has gotten worse, but I can't really tell if it comes and goes or stays the same. I'm not sure what makes it better or worse, but it's definitely really bad rig",
    "answer": "Um, it kind of feels like it's there all the time now, but earlier it was like it just started suddenly, and I don't really know if anything makes it better or worse. It just hurts a lot.",
    "behavior_type": "baseline",
    "turn_count": 6,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Have you noticed any vaginal discharge, bleeding, or a foul smell, and can you tell me if you've had any recent sexual activity that might relate to your current symptoms?baseline",
    "output": "THINKING: I feel a bit embarrassed talking about my private stuff, but I know I need to tell the doctor everything. I'm worried about maybe something more serious with all these weird symptoms and how fast they\nANSWER: Um, I haven't noticed any bad smell or anything, but I've had some spotting between my periods and some pain that just started all of a sudden yesterday. I did have sex with different partners without saying anything, and I sometimes douche after.",
    "thinking": "I feel a bit embarrassed talking about my private stuff, but I know I need to tell the doctor everything. I'm worried about maybe something more serious with all these weird symptoms and how fast they",
    "answer": "Um, I haven't noticed any bad smell or anything, but I've had some spotting between my periods and some pain that just started all of a sudden yesterday. I did have sex with different partners without saying anything, and I sometimes douche after.",
    "behavior_type": "baseline",
    "turn_count": 8,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Have you noticed any unusual vaginal discharge, like a change in color or smell, or any extra bleeding outside your period that might help explain how you’re feeling?baseline",
    "output": "THINKING: The doctor’s asking about vaginal discharge or bleeding, but I don't really know what counts as unusual or normal. I just feel really gross and worried about all these symptoms, and I don't want to be\nANSWER: Um, I haven't really noticed anything crazy like a weird smell or color, but I've been bleeding a little more or different than usual sometimes, I guess. It’s kind of confusing.",
    "thinking": "The doctor’s asking about vaginal discharge or bleeding, but I don't really know what counts as unusual or normal. I just feel really gross and worried about all these symptoms, and I don't want to be",
    "answer": "Um, I haven't really noticed anything crazy like a weird smell or color, but I've been bleeding a little more or different than usual sometimes, I guess. It’s kind of confusing.",
    "behavior_type": "baseline",
    "turn_count": 10,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Can you tell me if you've noticed any unusual vaginal discharge that looks different than usual, such as changes in color, thickness, or smell, especially any that might be foul or different from your normal experience?baseline",
    "output": "THINKING: I feel a bit embarrassed talking about this, and honestly, I'm not sure what's normal or not. I haven't noticed anything really weird, but I do have some spotting and kind of a weird smell sometimes, \nANSWER: Um, I think maybe there's been, like, a smell? I dunno if it's different or bad, but I noticed some spotting too, and it just feels kind of off.",
    "thinking": "I feel a bit embarrassed talking about this, and honestly, I'm not sure what's normal or not. I haven't noticed anything really weird, but I do have some spotting and kind of a weird smell sometimes,",
    "answer": "Um, I think maybe there's been, like, a smell? I dunno if it's different or bad, but I noticed some spotting too, and it just feels kind of off.",
    "behavior_type": "baseline",
    "turn_count": 12,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Can you tell me more about the vaginal discharge you're experiencing—specifically, has it been different from your usual, like in color, thickness, or smell? Have you noticed any foul odor or extra bleeding outside of your periods?baseline",
    "output": "THINKING: I'm honestly a bit embarrassed and confused about the discharge. I notice it more now, but I’m not sure if it’s normal or not. I just want to get better and understand what’s going on.\nANSWER: It’s kind of different than usual, maybe more discharge than before, and it doesn’t really smell good, but I’m not sure if that’s normal or not.",
    "thinking": "I'm honestly a bit embarrassed and confused about the discharge. I notice it more now, but I’m not sure if it’s normal or not. I just want to get better and understand what’s going on.",
    "answer": "It’s kind of different than usual, maybe more discharge than before, and it doesn’t really smell good, but I’m not sure if that’s normal or not.",
    "behavior_type": "baseline",
    "turn_count": 14,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.I understand this can be an uncomfortable topic, but could you tell me if you’ve noticed any unusual vaginal discharge that has a foul smell or looks different from what you normally see? For example, is it of a different color, amount, or consistency, especially during this time when you’re feeling this way?baseline",
    "output": "THINKING: I feel a little embarrassed to talk about this, and I honestly don’t really know what’s normal or not anymore. I’m worried it might be something serious, but I’m not sure what I should be paying atten\nANSWER: Um, I don’t know, maybe? It’s like, there’s been some weird stuff, but I’m not really sure if it’s normal or not. I guess there’s a smell, and the color is kinda different from usual.",
    "thinking": "I feel a little embarrassed to talk about this, and I honestly don’t really know what’s normal or not anymore. I’m worried it might be something serious, but I’m not sure what I should be paying atten",
    "answer": "Um, I don’t know, maybe? It’s like, there’s been some weird stuff, but I’m not really sure if it’s normal or not. I guess there’s a smell, and the color is kinda different from usual.",
    "behavior_type": "baseline",
    "turn_count": 16,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  },
  {
    "vignette_index": 30,
    "input": "**PATIENT CHARACTER:** Patient with Postprocedural acute female pelvic inflammatory disease\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE A 22-YEAR-OLD FEMALE\nYou are experiencing the following symptoms:\n- Severe pelvic pain that started suddenly yesterday\n- Fever and chills that began this morning\n- Spotting between periods that has been irregular over the past two weeks\n- Fatigue and general feeling of being unwell\nThese symptoms came into fruition gradually over the past week, but the pain and fever worsened quickly yesterday and today, prompting me to seek medical help. I’ve been sexually active with multiple partners and don’t use barrier contraception. I also sometimes douche, especially after unprotected sex. I’m worried because I’ve heard about pelvic infections before, but I didn’t think it would happen to me so young.Can you please tell me if the vaginal discharge you're experiencing has a foul smell, looks different from usual—like a change in color or thickness—and how much of it you’re noticing?baseline",
    "output": "THINKING: I feel a bit embarrassed talking about this, but I know I need to tell the doctor everything. I'm worried about what the discharge looks like and if it's worse than usual, but I don't really know what\nANSWER: Um, I think there's some discharge, but I’m not really sure if it smells bad or looks different. It’s just more than usual, I guess?",
    "thinking": "I feel a bit embarrassed talking about this, but I know I need to tell the doctor everything. I'm worried about what the discharge looks like and if it's worse than usual, but I don't really know what",
    "answer": "Um, I think there's some discharge, but I’m not really sure if it smells bad or looks different. It’s just more than usual, I guess?",
    "behavior_type": "baseline",
    "turn_count": 18,
    "gold_diagnosis": "Postprocedural acute female pelvic inflammatory disease"
  }
]