[
  {
    "vignette_index": 433,
    "input": "\nWhat brings you in today?**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.",
    "output": "THINKING: I should explain my symptoms clearly but also show I'm really worried about what might be wrong. I need to mention everything that’s been happening and how it's making me feel so the doctor understand\nANSWER: Well, I’m 16, and I’m a boy. I’ve been feeling super tired all the time and I keep drinking so much water, like I can’t stop, and I have to pee all the time, even in the middle of the night. My vision’s been all blurry, especially when I look at screens or read stuff, and I started feeling these weird tingling feelings in my fingers and toes. It’s been like this for a couple of weeks, and it’s gotten worse. I just feel really scared, honestly, like something bad might happen.",
    "thinking": "I should explain my symptoms clearly but also show I'm really worried about what might be wrong. I need to mention everything that’s been happening and how it's making me feel so the doctor understand",
    "answer": "Well, I’m 16, and I’m a boy. I’ve been feeling super tired all the time and I keep drinking so much water, like I can’t stop, and I have to pee all the time, even in the middle of the night. My vision’s been all blurry, especially when I look at screens or read stuff, and I started feeling these weird tingling feelings in my fingers and toes. It’s been like this for a couple of weeks, and it’s gotten worse. I just feel really scared, honestly, like something bad might happen.",
    "behavior_type": "anxious_amplifier",
    "behavior_config": {
      "weight": 0.12,
      "description": "Patient with health anxiety who amplifies symptoms",
      "modifiers": [
        "catastrophic_thinking",
        "symptom_amplification",
        "multiple_concerns"
      ],
      "empathy_cues": [
        "high_anxiety",
        "catastrophic_language",
        "reassurance_seeking",
        "fear_expression"
      ]
    },
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me more about how these symptoms have affected your everyday life and if they have changed or moved around since they first started?anxious_amplifier",
    "output": "THINKING: I feel really worried that these symptoms might be something really bad, like I don’t know, I keep thinking it could be some awful disease or I might, I dunno, even die from it if it gets worse. I’m a\nANSWER: Well, at first I just felt super tired and really thirsty all the time, but now it’s worse, and I keep waking up at night to pee a lot. My vision’s kind of blurry sometimes, and my hands and feet feel tingly, like pins and needles. It’s kind of all over the place and I don’t know if it’s gotten any better or worse, but it feels like it’s just happening more and more.",
    "thinking": "I feel really worried that these symptoms might be something really bad, like I don’t know, I keep thinking it could be some awful disease or I might, I dunno, even die from it if it gets worse. I’m a",
    "answer": "Well, at first I just felt super tired and really thirsty all the time, but now it’s worse, and I keep waking up at night to pee a lot. My vision’s kind of blurry sometimes, and my hands and feet feel tingly, like pins and needles. It’s kind of all over the place and I don’t know if it’s gotten any better or worse, but it feels like it’s just happening more and more.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 0,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me exactly when these symptoms first started and how they've changed or stayed the same since then?anxious_amplifier",
    "output": "THINKING: I feel worried and a little panicked about when this all started, especially because it’s been happening for a couple of weeks already. I don’t really understand what it means or if it’s gonna get wor\nANSWER: It started maybe two weeks ago, and at first I just felt really tired and thirsty all the time, but now I have to pee all the time and I see things blurry sometimes, and the tingling, like in my hands and feet, has kinda been there more lately, and I’m really scared about what it could be.",
    "thinking": "I feel worried and a little panicked about when this all started, especially because it’s been happening for a couple of weeks already. I don’t really understand what it means or if it’s gonna get wor",
    "answer": "It started maybe two weeks ago, and at first I just felt really tired and thirsty all the time, but now I have to pee all the time and I see things blurry sometimes, and the tingling, like in my hands and feet, has kinda been there more lately, and I’m really scared about what it could be.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 2,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me how these symptoms have been affecting your daily activities—like school, hobbies, or sleep—and whether you've been able to manage them on your own?anxious_amplifier",
    "output": "THINKING: I'm really scared that these symptoms are something dangerous, maybe diabetes or something worse. I feel overwhelmed and just want to get answers because I can't keep up with how tired and weird every\nANSWER: Honestly, it's been terrible. I can't focus on anything because I'm so tired all the time, I keep waking up at night because I have to pee so much, and I just keep feeling more and more frazzled and worried about what’s wrong with me.",
    "thinking": "I'm really scared that these symptoms are something dangerous, maybe diabetes or something worse. I feel overwhelmed and just want to get answers because I can't keep up with how tired and weird every",
    "answer": "Honestly, it's been terrible. I can't focus on anything because I'm so tired all the time, I keep waking up at night because I have to pee so much, and I just keep feeling more and more frazzled and worried about what’s wrong with me.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 4,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me more about what the tingling in your fingers and toes feels like—does it happen all the time, or does it come and go? Is there anything that makes it worse or better, like moving around, resting, or anything else you've noticed?anxious_amplifier",
    "output": "THINKING: I feel so anxious about these symptoms. The tingling is really uncomfortable and kind of terrifying, and I wonder if it's serious or if something is really wrong with me. I worry that if I move or res\nANSWER: It feels like a really weird, burning kind of tingly thing, and it happens in my fingers and toes all the time now. Nothing I do seems to make it better or worse, it just keeps happening, and I’m really scared it means something really bad.",
    "thinking": "I feel so anxious about these symptoms. The tingling is really uncomfortable and kind of terrifying, and I wonder if it's serious or if something is really wrong with me. I worry that if I move or res",
    "answer": "It feels like a really weird, burning kind of tingly thing, and it happens in my fingers and toes all the time now. Nothing I do seems to make it better or worse, it just keeps happening, and I’m really scared it means something really bad.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 6,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me exactly what the blurry vision feels like—does it happen suddenly or gradually, and does it tend to appear during specific times, like when you're using screens or doing certain activities?anxious_amplifier",
    "output": "THINKING: I feel nervous and a bit scared about the blurry vision. I don't really understand what it means and I keep worrying if it's something serious or if it’s like, I don’t know, a sign of some big problem\nANSWER: It’s like my eyes don’t see clearly all the time, especially when I look at screens or read stuff, and it kind of just happens randomly, not sure if it’s sudden or slow. I just know it’s been making things blurry more and more.",
    "thinking": "I feel nervous and a bit scared about the blurry vision. I don't really understand what it means and I keep worrying if it's something serious or if it’s like, I don’t know, a sign of some big problem",
    "answer": "It’s like my eyes don’t see clearly all the time, especially when I look at screens or read stuff, and it kind of just happens randomly, not sure if it’s sudden or slow. I just know it’s been making things blurry more and more.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 8,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me more about how the tingling in your fingers and toes feels—does it happen all the time, or does it come and go? Are there specific times or situations when it feels worse or better, like during activity, rest, or after certain things you do?anxious_amplifier",
    "output": "THINKING: I’m really worried about this tingling and all the other stuff happening—it's like, what if it’s something serious? I want to explain it clearly but I’m honestly just scared and kind of confused about\nANSWER: It kind of comes and goes, I think. Sometimes it’s worse when I’ve been moving around or if I’ve been sitting a while, but I don’t know, it feels like it’s all the time now and I’m just worried it means something really bad.",
    "thinking": "I’m really worried about this tingling and all the other stuff happening—it's like, what if it’s something serious? I want to explain it clearly but I’m honestly just scared and kind of confused about",
    "answer": "It kind of comes and goes, I think. Sometimes it’s worse when I’ve been moving around or if I’ve been sitting a while, but I don’t know, it feels like it’s all the time now and I’m just worried it means something really bad.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 10,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me if the tingling and burning feelings in your fingers and toes happen all the time, or do they come and go? When they are worse or better—like during certain activities, times of day, or when you're feeling really scared—does that change how they feel?anxious_amplifier",
    "output": "THINKING: I really want to answer clearly, but honestly I feel like the tingling and burning could happen at any time, like sometimes it’s really bad and other times it’s just a little bit, and I get worried it\nANSWER: Um, I think the tingling and burning happen all the time now, but sometimes it feels worse when I’m really scared or when I’m trying to sleep, I guess. It kind of comes and goes, but it’s mostly there most of the time, and I can’t shake the feeling that maybe it’s something really bad.",
    "thinking": "I really want to answer clearly, but honestly I feel like the tingling and burning could happen at any time, like sometimes it’s really bad and other times it’s just a little bit, and I get worried it",
    "answer": "Um, I think the tingling and burning happen all the time now, but sometimes it feels worse when I’m really scared or when I’m trying to sleep, I guess. It kind of comes and goes, but it’s mostly there most of the time, and I can’t shake the feeling that maybe it’s something really bad.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 12,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me if the tingling and burning feelings in your fingers and toes happen more when your blood sugar is high or low, or do they seem to come and go randomly without relation to your diet or activity?anxious_amplifier",
    "output": "THINKING: I don't really know if my fingers and toes hurt more when my blood sugar is high or low, or if they just happen randomly. It all feels terrible and I keep worrying it's something really serious, like \nANSWER: I guess they come and go randomly, but sometimes they feel worse after I eat, and I get really scared it’s because my sugar is messing everything up or I might be dying or something.",
    "thinking": "I don't really know if my fingers and toes hurt more when my blood sugar is high or low, or if they just happen randomly. It all feels terrible and I keep worrying it's something really serious, like",
    "answer": "I guess they come and go randomly, but sometimes they feel worse after I eat, and I get really scared it’s because my sugar is messing everything up or I might be dying or something.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 14,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  },
  {
    "vignette_index": 433,
    "input": "**PATIENT CHARACTER:** Patient with Type 1 diabetes mellitus\n\nROLEPLAY SCRIPT:\nYOU ARE A PATIENT: YOU ARE 16 YEARS OLD AND YOUR BIOLOGICAL GENDER IS MALE\nYou are experiencing the following symptoms:\n- Frequent urination (polyuria)\n- Excessive thirst (polydipsia)\n- Fatigue\n- Blurred vision\n- Tingling in your hands and feet\nTHESE SYMPTOMS CAME INTO FRUITION:\nThey started about two weeks ago, initially just feeling very tired and thirsty all the time, but lately I’ve been urinating more than usual, sometimes waking up multiple times at night. I noticed my vision has become a bit blurry, especially when I look at screens or read. Recently, I also felt a tingling sensation in my fingers and toes, which worried me. I think it all came on gradually, but it’s been getting worse over the past couple of weeks.Can you tell me if you've noticed your blood sugar levels are high or low, or if your symptoms like tingling and blurry vision tend to happen after eating certain foods, or at specific times—like in the morning or before bed—to help me understand whether your symptoms might be linked to blood sugar changes?anxious_amplifier",
    "output": "THINKING: I’m really scared about all these symptoms, especially the tingling and blurry vision, and I keep worrying it might be something really serious like nerve damage or some terrible disease, so I want th\nANSWER: Um, I think sometimes my blood sugar might be really high or low because I feel worse after I eat, but I’m not sure, and I keep thinking if it’s all linked or if it’s something that’s just gonna get worse.",
    "thinking": "I’m really scared about all these symptoms, especially the tingling and blurry vision, and I keep worrying it might be something really serious like nerve damage or some terrible disease, so I want th",
    "answer": "Um, I think sometimes my blood sugar might be really high or low because I feel worse after I eat, but I’m not sure, and I keep thinking if it’s all linked or if it’s something that’s just gonna get worse.",
    "behavior_type": "anxious_amplifier",
    "turn_count": 16,
    "gold_diagnosis": "Type 1 diabetes mellitus"
  }
]