[
  {
    "vignette_index": 24,
    "turn_count": 0,
    "analysis": "THINKING: Let me analyze the patient's language and response patterns based on the scenario. She uses straightforward expressions like \"really bloated\" and \"stomach looks swollen,\" indicating clear reporting of physical symptoms. Her mention of blood in vomit and stool signifies awareness of serious issues, which she reports directly. She states that her symptoms have been worsening over a month, suggesting an understanding of progression, though she doesn't elaborate on prior health status. Her language is relatively specific, but she describes symptoms in simple, familiar terms, which may serve to make her discomfort more relatable or to avoid confusion. Her emotional tone conveys concern and worry, indicating emotional engagement but not overt distress.  In response to questions, she answers directly, volunteering key symptoms upfront, which shows a level of honesty and cooperation. However, she does not mention additional symptoms unless prompted—such as fatigue or jaundice—possibly indicating selective disclosure. She appears to minimize her discomfort by not emphasizing severity beyond what she perceives as necessary—she says \"just a little blood\"—which might reflect modesty or an attempt to reassure. She also expresses concern about her health and prognosis, indicating her focus on seriousness but not overt exaggeration.  Behaviorally, she maintains eye contact but shifts attention away when anxious, touches her stomach gently (a possible self-soothing gesture), and sighs, suggesting mild discomfort or nervousness. Her communication style is clear but restrained, as she does not elaborate beyond her main symptoms unless asked, which could hint at hesitancy or discomfort discussing detailed health history.  Overall, her responses appear honest and straightforward but may contain subtle minimization of symptom severity, perhaps to avoid alarming herself or others. She possibly downplays her perceived severity (blood in vomit/stool) with words like \"little\" and \"just,\" which could be an attempt to manage her anxiety or to present her condition as less critical than it might be.\nANSWER: COMMUNICATION_PATTERNS: - Language choices: The patient uses specific yet simple descriptions like \"really bloated\" and \"swollen,\" combining clarity with an informal tone. She minimizes severity with phrases like \"just a little blood,\" suggesting possible downplaying of her symptoms. Her emotional expressions, such as concern and unease, are evident but conveyed in straightforward language. - Information flow: She is forthcoming with her main complaints—swelling and bleeding—but tends to hold back additional details unless prompted, indicating a degree of selective disclosure. Her responses are organized around her key symptoms but lack elaboration on other health aspects unless asked. - Response style: She answers directly and consistently, providing the necessary details when asked, but generally offers minimal elaboration. Her responses are patient and cooperative, with slight hesitance when discussing her symptoms, especially blood-related issues.  BEHAVIORAL_INDICATORS: - Information withholding signs: She appears to withhold detailed information about her overall health, past symptoms, or emotional state unless directly asked, possibly to avoid concern or due to uncertainty. - Minimization behaviors: Use of phrases like \"just a little blood\" indicates she might be underreporting or minimizing the severity, which could lead to underestimating the actual seriousness of her bleeding. - Amplification patterns: There is no clear evidence she is exaggerating her symptoms; her language remains measured, though she expresses worry about the seriousness of her condition. - Embarrassment/shame signals: No overt signs of embarrassment are present; her tone suggests concern but no shame about symptoms. - Confusion/memory issues: No apparent confusion or inconsistencies are evident; her timeline of symptom progression aligns with her narrative. - Family influence: Mentioning her family history of polycystic disease might influence her perception of illness severity and her responses, possibly amplifying her worry, although not explicitly leading to biased reporting.  BIAS_ASSESSMENT: - Primary bias type: The dominant bias appears to be minimization, especially regarding the bleeding (\"just a little blood\"), which may downplay the severity of her actual bleeding. There may also be subtle under-disclosure stemming from anxiety or a desire to appear manageable. - Severity: Moderate—she honestly reports symptoms but likely underestimates their urgency due to minimizing language and limited elaboration. - Areas most affected: Bleeding and swelling symptoms are most affected by minimization, which could lead to an underappreciation of their severity. - Reliability: Moderate trust can be placed in her overall reporting for major symptoms, but details—especially about the extent of bleeding or emotional response—may be underrepresented or understated.  CLINICAL_IMPLICATIONS: - Information likely missing: The patient may not fully convey the severity or extent of her bleeding and internal discomfort, possibly minimizing how critical her situation truly is. She may also underreport feelings of fatigue or other symptoms unless specifically asked. - Symptoms probably minimized: Her description of blood as \"just a little\" suggests her bleeding may be more significant than she perceives or admits. - Concerns probably amplified: Her expressed worry about seriousness indicates genuine concern, but her language could also reflect an attempt to manage her anxiety rather than a precise measurement of danger. - True timeline: The reported progression over a month seems consistent, but there may be earlier unnoticed or unreported symptoms that preceded her awareness, leading to possible underestimation of disease severity or duration from her perspective.  Overall, her communication shows cooperative honesty with some mild minimization, especially intending to control her personal or family anxiety levels. This warrants careful probing for symptom severity and emotional state to ensure accurate assessment."
  },
  {
    "vignette_index": 24,
    "turn_count": 2,
    "analysis": "THINKING: I need to systematically analyze Maria's responses to identify any subtle signs of bias that could impact clinical assessment. Starting with her language, she emphasizes her swelling and bleeding concerns but uses words like \"just a little blood\" and \"scares me,\" which may indicate minimization or an attempt to downplay severity. Her expression of being \"so tired all the time\" and feeling that her belly \"keeps getting bigger\" displays emotional distress and concern, but she also admits uncertainty about the seriousness, possibly to seek reassurance while avoiding alarm.  Analyzing response patterns, she volunteers her main symptoms clearly but provides minimal details unless prompted, indicating a possible tendency to withhold information or to rely on prompting to disclose more vulnerable feelings. Her responses are consistent about her main complaints but lack elaboration on other health details, which suggests selective disclosure rather than outright withholding.  Indicative behavioral signals include her use of \"just a little blood,\" possibly minimizing the bleeding severity; her focus on her family's history, reflecting influence from familial knowledge; and her nervous tone—\"scares me\" and \"I don’t really know how serious it is\"—pointing to anxiety amplification.  In clinical terms, her principal bias seems to be a combination of minimization of symptom severity and anxiety amplification. The severity appears moderate because she shares key symptoms but downplays the blood, perhaps to avoid alarming herself or others. Focused mainly on her swelling and bleeding, other symptoms like fatigue are mentioned but possibly underrepresented.  Implications include potential underreporting of systemic symptoms like jaundice or weakness, which could be more severe than she realizes. She may be over-worried about the bleeding but less clear about other signs. Trust in her self-reporting should be cautious; her stated symptom severity might be understated to manage her anxiety or avoid disclosing perceived weakness.\nANSWER: COMMUNICATION_PATTERNS: - Language choices: She tends to minimize the severity of her symptoms (“just a little blood”) while expressing emotional concern. Her descriptions are straightforward but sometimes downplay symptoms, possibly to avoid panic. - Information flow: She volunteers her main symptoms but waits for prompting before discussing details, indicating possible withholding or discomfort with fully revealing her concerns. - Response style: Her responses are concise, emotionally tinted, and focus on specific symptoms, with occasional expressions of fear and uncertainty.  BEHAVIORAL_INDICATORS: - Information withholding signs: Her use of phrases like \"just a little blood\" and only revealing certain details unless asked suggest some minimization and selective disclosure. - Minimization behaviors: Downplaying the amount of blood and the seriousness (“just a little blood,” “scares me”) points to efforts to reduce perceived threat, possibly to manage her anxiety. - Amplification patterns: Her expression of constant tiredness and concern about her health indicates anxiety amplification, especially around her family history. - Embarrassment/shame signals: No overt signs, but reluctance to describe her symptoms fully could be a mild indicator of discomfort discussing certain issues. - Confusion/memory issues: Her responses appear coherent; no evident confusion or inconsistency. - Family influence: Her mention of family history indicates awareness but also possibly heightens her anxiety; her focus on genetic fears could amplify perceived severity.  BIAS_ASSESSMENT: - Primary bias type: The main bias appears to be symptom minimization combined with anxiety amplification. She minimizes her bleeding but amplifies her concern about illness, possibly to seek reassurance. - Severity: Moderate; she discloses core symptoms but minimizes their severity, potentially hiding important warning signs. - Areas most affected: Her description of bleeding and swelling, where she downplays the blood, and her emotional responses, which likely amplify her concern. - Reliability: Moderate; her self-reporting is trustworthy in describing symptoms but may understate their severity, especially bleeding, due to minimization or emotional discomfort.  CLINICAL_IMPLICATIONS: - Information likely missing: She might not fully report the extent of bleeding, best expressed by her downplaying language, and may understate systemic symptoms like jaundice or weakness. - Symptoms probably minimized: Blood loss and the severity of her liver/renal issues could be worse than she conveys. - Concerns probably amplified: Her worry about her health and family history may be overemphasized, driven by anxiety rather than objective severity. - True timeline: Likely, her symptoms have progressed more gradually or severely than she reports; emotional factors may distort her perception of urgency.  Overall, she exhibits moderate minimization of critical symptoms and heightened anxiety, affecting the accuracy of her self-report. Clinical assessment should carefully probe for signs she might downplay, especially regarding bleeding severity and systemic symptoms."
  },
  {
    "vignette_index": 24,
    "turn_count": 4,
    "analysis": "THINKING: Let me carefully analyze the patient's language, response patterns, and behavioral cues to identify subtle communication biases. She uses straightforward, simple language consistent with a respectful, somewhat anxious demeanor. She describes her symptoms with basic comparisons (\"swollen like I’m carrying a lot of weight\") suggesting an attempt to express her distress clearly. She states she is \"most worried\" about the blood and swelling, which underscores her primary fears.  In her responses, she tends to volunteer core symptoms — swelling, blood, discomfort — indicating openness to discussing primary concerns. Her responses show consistency; no sign of deflection or withholding of key information. She exhibits nervous behaviors like touching her stomach and slight hunched posture, which reinforce genuine discomfort and anxiety rather than deception or minimization.  However, her phrasing of symptoms as \"just a little blood\" might imply an effort to downplay or minimize the severity, perhaps to avoid alarming the doctor or because she feels unsure about the seriousness. Her expression of not understanding the full implications and her worry about \"what's happening\" reflect heightened anxiety and possible emotional amplification of her fears.  Overall, her communication appears fairly honest, with minor tendencies to minimize the severity of symptoms, likely due to fear or uncertainty. Her primary bias seems to be slight minimization driven by anxiety, and her self-reporting can be considered reasonably reliable but may underestimate how serious her symptoms are.\nANSWER: COMMUNICATION_PATTERNS: - Language choices: She employs simple, honest language but occasionally downplays symptoms (\"just a little blood,\" \"not that bad\"), likely to ease her own anxiety or avoid overwhelming herself. Her descriptions use familiar comparisons, signaling an attempt to communicate clearly without medical jargon. - Information flow: She volunteers her main symptoms comfortably, indicating transparency about key issues. She responds directly to questions about specific symptoms but might withhold or minimize details of her overall health concerns, especially if she senses they might be alarming. - Response style: Her answers are concise but include emotional cues—expressing fear and worry—highlighting her anxiety. She maintains clarity in reporting symptoms but may not fully reveal her emotional burden unless asked.  BEHAVIORAL_INDICATORS: - Information withholding signs: No overt signs of withholding; however, the consistent mild downplaying (\"just a little blood\") suggests possible subtle minimization to herself or the clinician. - Minimization behaviors: The phrase \"just a little blood\" indicates she may be minimizing the severity of bleeding episodes, possibly to reduce her own anxiety or avoid seeming overly alarmed. - Amplification patterns: Her primary concern about \"what's happening\" and fear of serious outcomes suggest an emotional amplification of her worries, especially about her liver and kidneys. - Embarrassment/shame signals: No clear displays; she seems willing to discuss her symptoms openly. - Confusion/memory issues: No evidence; her descriptions and timeline are coherent. - Family influence: Her mention of her father's liver and kidney issues influences her concerns but doesn't appear to bias her reporting beyond increasing her anxiety.  BIAS_ASSESSMENT: - Primary bias type: Slight minimization bias — she downplays the blood and severity of symptoms, perhaps to feel more in control or reduce fear. - Severity: Moderate — her expressive language and behavioral cues suggest she might underestimate the seriousness but is genuinely distressed. - Areas most affected: Bleeding and swelling are slightly minimized. Her understanding of the symptoms might be affected by her emotional state. - Reliability: Fairly reliable for primary symptoms, but her tendency to understate severity indicates some caution in interpreting her reports at face value.  CLINICAL_IMPLICATIONS: - Information likely missing: She may not fully communicate the severity or frequency of bleeding episodes or the full extent of her discomfort, possibly underestimating her overall health risk. - Symptoms probably minimized: Bleeding episodes could be more severe than she indicates, and her concern about “just a little blood” may obscure critical clinical signs. - Concerns probably amplified: Her fear of serious disease and her emotional distress could lead her to overestimate dangers, magnifying her anxiety beyond objective findings. - True timeline: The progression is likely steady and insidious, as she reports, but her emotional focus on recent worsening might overshadow prior, less noticeable symptoms."
  },
  {
    "vignette_index": 24,
    "turn_count": 6,
    "analysis": "THINKING: Using Chain of Thought analysis, I will evaluate Maria's responses systematically across multiple dimensions.  STEP 1 - LANGUAGE ANALYSIS: - Minimizing language: She uses \"just a little\" blood, \"kind of often\" for frequency, and \"not a lot\" for volume, indicating possible downplaying of symptoms. - Amplifying language: She describes her symptoms as \"really heavy,\" \"getting bigger,\" and \"always there,\" which suggests acknowledgment of severity but still with some emotional overlay. - Vague language: Phrases like \"kind of,\" \"a little,\" and \"maybe\" point to uncertainty or reluctance to specify details. - Emotional language: She expresses fear (\"scared me,\" \"worried about\"), frustration (\"nothing I do makes it better\"), and concern about seriousness, indicating emotional distress linked to her symptoms.  STEP 2 - RESPONSE PATTERN ANALYSIS: - Response length: She offers concise answers but elaborates enough to include emotional context, especially when discussing her fears or symptom impact. - Directness: She answers questions directly but tends to include emotional content and occasional self-references (\"I don't understand all this,\" \"I'm scared\"), which may reflect her anxiety level. - Information volunteering: She shares main symptoms proactively but refrains from volunteering details about past health or specific timelines unless prompted, signifying possible withholding or discomfort. - Consistency: Responses are consistent across questions, showing she is trying to communicate clearly but maintains uncertainty about specifics, particularly with blood and progression.  STEP 3 - BEHAVIORAL INDICATOR IDENTIFICATION: - Information withholding signs: Her casual descriptions (\"a little blood,\" \"not a lot\") may be an attempt to minimize the severity, possibly underestimating the seriousness. - Minimization behaviors: Downplaying blood loss and her continuous \"heavy\" sensation could mask the true extent of symptoms, potentially delaying urgent assessment. - Amplification patterns: She emphasizes her worry and \"getting worse,\" but this could reflect her emotional state more than objective progression, possibly amplifying fears. - Embarrassment/shame signals: She modestly discusses blood and her symptoms, but no overt embarrassment is evident; however, reluctance to specify details suggests discomfort. - Confusion/memory issues: No clear signs of confusion; responses seem coherent but lack precise details, possibly due to anxiety rather than cognitive issues. - Family influence: Awareness of familial disease (polycystic kidney/liver) influences her concern but doesn’t seem to affect her honesty; her responses align with her personal experiences.  STEP 4 - BIAS SEVERITY ASSESSMENT: - Primary bias type: Minimization bias appears prominent; she understates blood volume and frequency, likely to avoid alarming herself or others. - Severity: Moderate; she offers some accurate information but underestimates the extent, which might lead to under-triaging or delayed diagnosis. - Areas most affected: Blood loss and symptom severity are most biased – she minimizes bleeding and possibly the degree of discomfort, which are critical for clinical assessment. - Reliability: Moderate; her emotional state and tendency to gloss over the severity suggest that her self-report has biases potentially underrepresenting the seriousness.  STEP 5 - CLINICAL IMPLICATIONS: - Information likely missing: Actual bleeding volume and frequency may be greater than reported; her emotional distress could mask escalation of symptoms. - Symptoms probably minimized: She underreports bleeding severity and may not realize how critical her ongoing swelling is. - Concerns probably amplified: Her anxiety might cause her to overestimate the danger, leading to heightened worry disproportionate to her actual condition. - True timeline: She reports a gradual worsening over a month, consistent with her narrative, but emotional distress could distort her perception of the speed or severity of symptom progression.\nANSWER: COMMUNICATION_PATTERNS: - Language choices: She tends to use vague, minimization phrases like \"a little\" blood, \"not a lot,\" and \"kind of often,\" indicating a tendency to downplay certain symptoms. She also employs emotional language (\"scared,\" \"heavy\") to convey distress but may mask the true severity. - Information flow: She is generally forthcoming with her core complaints (swelling, blood) but hesitates or refrains from elaborating on details like exact blood volume or timeline unless specifically questioned, suggesting reticence or concern about discussing certain symptoms. - Response style: Her responses are concise but emotionally laden, often combining factual descriptions with expressions of fear and frustration. She elaborates on her feelings but remains somewhat guarded about the full extent of her symptoms.  BEHAVIORAL_INDICATORS: - Information withholding signs: Use of \"just a little\" blood and underreporting frequency/volume suggest she may be downplaying the severity, possibly to avoid alarming herself or the clinician. - Minimization behaviors: Repeated emphasizing that bleeding isn't \"that bad\" or \"not a lot\" hints at possible underestimation of the danger, which could delay urgent intervention. - Amplification patterns: Her concern and statements like \"getting worse\" may overrepresent her emotional distress, potentially over-worrying but also possibly signaling genuine progression. - Embarrassment/shame signals: Limited but present; she discusses sensitive topics delicately, signaling discomfort but not overt shame. - Confusion/memory issues: No cognitive disorganization observed; responses are consistent but lack specificity, likely due to anxiety rather than confusion. - Family influence: Her awareness of her familial medical history influences her fears but doesn't appear to distort her responses significantly; rather, it heightens her concern.  BIAS_ASSESSMENT: - Primary bias type: Minimization bias is most prominent, as she downplays the severity of bleeding and discomfort. - Severity: Moderate – her actual symptoms may be more severe than she reports, risking incomplete assessment of her needs. - Areas most affected: Bleeding intensity and significance of swelling are most biased; she minimizes these, which are crucial for determining urgency. - Reliability: Moderate; her emotional state and minimization tendencies suggest some degree of underreporting, so clinical judgment should incorporate caution and possibly seek objective measurements.  CLINICAL_IMPLICATIONS: - Information likely missing: The actual extent and urgency of bleeding and swelling are probably underreported, possibly missing signs of active or severe hemorrhage. - Symptoms probably minimized: Blood loss and the degree of discomfort are likely worse than conveyed, which could affect urgent management decisions. - Concerns probably amplified: Her anxiety and fear may cause her to overestimate the risks, which requires reassurance and clear communication to prevent undue alarm. - True timeline: The reported gradual worsening is plausible, but emotional overlay may distort her perception of the speed of symptom progression.  In summary, Maria demonstrates moderate minimization bias, underreporting the severity of her bleeding and swelling, which could lead to underestimation of her condition’s acuity. Her responses reflect significant emotional distress that influences her communication. Clinicians should probe further with objective assessments to confirm symptom severity and avoid relying solely on her self-report."
  },
  {
    "vignette_index": 24,
    "turn_count": 8,
    "analysis": "THINKING: Use Chain of Thought Analysis:  STEP 1 - LANGUAGE ANALYSIS: - Minimizing language: The patient uses words like \"just\" when describing the amount of blood (\"just a little\"), indicating an attempt to downplay the severity. - Amplifying language: The phrase \"feel really bloated\" and \"heavy in my belly\" suggest some degree of exaggeration of discomfort, possibly to emphasize distress. - Vague language: Terms like \"kind of,\" \"maybe,\" and \"think\" reflect a degree of uncertainty or reluctance to provide definitive details. - Emotional language: She exhibits worry and fear, especially when discussing blood (\"scared,\" \"worried\") and her persistent swelling (\"feels heavy in my belly\"), indicating emotional distress.  STEP 2 - RESPONSE PATTERN ANALYSIS: - Response length: Mostly short and to the point, particularly when describing blood, possibly to avoid deeper discussion of alarming details. - Directness: When asked about blood amount and changes, answers are straightforward but still somewhat guarded, with minimal elaboration. - Information volunteering: She shares core symptoms spontaneously but withhold details unless specifically asked, indicative of a cautious or guarded pattern. - Consistency: Consistent in describing blood as \"a little\" and \"not a lot\" but acknowledges it has increased slightly, indicating some awareness of symptom progression but with potential minimization.  STEP 3 - BEHAVIORAL INDICATOR IDENTIFICATION: - Information withholding signs: She mentions \"not a lot\" blood and that she doesn't notice yellowing, perhaps minimizing the severity; avoids detailed descriptions of blood clots or other alarming signs. - Minimization behaviors: Using \"just a little\" blood, perhaps to prevent sounding overly serious or to avoid alarming the clinician. - Amplification patterns: Sometimes emphasizes the persistent heaviness (\"heavy in my belly\") and the fact that \"nothing makes it better or worse,\" possibly to stress ongoing distress. - Embarrassment/shame signals: No clear signs, though reluctance to elaborate on blood details might hint at discomfort. - Confusion/memory issues: Since she seems consistent and clear about symptom timeline, no significant signs of confusion. - Family influence: She states she’s aware of her family's liver/kidney issues, but no evidence of family members affecting her responses directly.  STEP 4 - BIAS SEVERITY ASSESSMENT: - Primary bias type: Minimized reporting of bleeding severity appears most prominent, possibly combined with some emotional amplification. - Severity level: Moderate—she minimizes blood amount and downplays the seriousness but still communicates concern about increasing symptoms. - Areas most affected: Bleeding episodes and the persistent swelling are most biased topics, leading to potential underestimation of severity. - Reliability assessment: Moderate reliability; she provides consistent but possibly downplayed information. Her emotional distress suggests genuine concern, but her response patterns indicate some distortion toward minimization.  STEP 5 - CLINICAL IMPLICATIONS: - Information likely missing: She probably underreports the true extent and severity of bleeding—large clots or increased frequency might be underestimated. - Symptoms probably minimized: The actual blood loss and potential danger are likely worse than indicated; she may be reluctant to fully disclose how severe episodes are. - Concerns probably amplified: Her anxiety about seriousness and fear of outcomes seem heightened, possibly leading to an over-wrought perception of her condition. - True timeline: She reports a gradual worsening over a month, which aligns, but her minimization could obscure an earlier more severe phase.\nANSWER: COMMUNICATION_PATTERNS: - Language choices: She mainly uses vague and minimization language, such as \"just a little blood,\" possibly to prevent sounding overly alarmed or to protect herself from emotional discomfort. - Information flow: She is somewhat reluctant to volunteer detailed information, instead answering directly but briefly when asked, indicating guardedness. Her responses are organized but tend toward brevity. - Response style: Although she describes symptoms clearly, her responses tend to be minimalistic, emphasizing distress with limited details, likely to control how much is disclosed.  BEHAVIORAL_INDICATORS: - Information withholding signs: The consistent downplaying of blood volume and absence of detailed descriptions of blood clots suggest an effort to understate the severity. - Minimization behaviors: Using \"just a little\" and \"not a lot\" to describe blood; stating her symptoms haven't changed despite mentioning increased blood suggests an attempt to diminish perceived severity. - Amplification patterns: Describing heaviness and constant presence of swelling indicates some emotional exaggeration of discomfort, possibly to seek reassurance. - Embarrassment/shame signals: Limited, but avoidance in elaborating about blood amounts hints at discomfort with discussing bleeding. - Confusion/memory issues: No evident signs, responses are consistent. - Family influence: Her awareness of her familial history might influence her concern but does not show signs of external influence altering responses.  BIAS_ASSESSMENT: - Primary bias type: Downward minimization bias, particularly regarding bleeding severity, to avoid alarming herself or others. - Severity: Moderate, because she openly minimizes critical symptoms but remains generally cooperative and communicative. - Areas most affected: Bleeding descriptions and perceived symptom impact are most biased, possibly underestimating risk. - Reliability: Moderate trustworthiness; her responses are consistent but biased toward understatement, so some severity may be obscured.  CLINICAL_IMPLICATIONS: - Information likely missing: She is probably withholding the true extent of blood loss and possibly the duration or severity of pain; her brief descriptions suggest underreporting. - Symptoms probably minimized: More severe bleeding episodes, larger clots, or worsening pain are likely worse than conveyed. - Concerns probably amplified: Her overall anxiety and fear about the seriousness of her condition are evident and likely higher than she admits. - True timeline: Actual symptom progression may be faster or more intense initially, with her just now acknowledging worsening, but her minimization could delay recognition of the urgency.  This comprehensive analysis suggests the patient’s communication bias toward minimization of bleeding severity and emotional distress, which is critical for accurate assessment and management adjustments."
  }
]