[
  {
    "vignette_index": 1113,
    "input": "Major Depressive Disorder, current episode END",
    "output": "THINKING: STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: I am fairly certain of Major Depressive Disorder, but given the patient's context and the mention of bipolar disorder type II, I recognize the importance of confirming the mood disorder subtype to tailor treatment properly. - Severity classification: Symptoms appear moderate to severe, given the persistent emotional distress, passive suicidal ideation, and mental fatigue, though active plans are absent. The passive suicidal thoughts elevate the concern. - Urgency level: Urgent to monitor closely, especially due to suicidal ideation, even if passive, requiring safety evaluation. - Differential considerations still requiring monitoring: Bipolar disorder mood episodes, anxiety disorders, substance use, and psychosis.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Psychotherapy (e.g., CBT) combined with pharmacotherapy tailored to bipolar disorder, preferably a mood stabilizer or atypical antidepressant cautiously used. - Supporting evidence: Evidence supports combined approach for depression—psychotherapy helps with coping and symptom management, and mood stabilizers reduce mood fluctuation risks. - Patient-specific considerations: Anxiety amplification may interfere with engagement; passive suicidal ideation warrants a careful safety plan. - Contraindications or cautions: Be cautious with antidepressants alone in bipolar disorder due to risk of mood switching; monitor for adverse effects.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: A mood stabilizer such as lamotrigine, starting at low dose (e.g., 25 mg daily), titrating gradually. - Rationale for selection: Lamotrigine is effective in bipolar depression with a lower risk of inducing mania. - Expected timeline for improvement: Symptomatic improvements may begin within 4-6 weeks. - Key side effects to monitor: Skin rash ( Stevens-Johnson syndrome risk), liver function, mood stability. - Alternative medications: Quetiapine or lithium if indicated based on further assessment.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary interventions: Engage in psychotherapy such as CBT or interpersonal therapy; psychoeducation about bipolar disorder. - Patient education priorities: Risks of mood episodes, importance of medication adherence, recognizing early warning signs. - Lifestyle modifications: Regular sleep schedule, consistent exercise, stress management techniques. - Behavioral interventions: Mindfulness practices, establishing routine.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Initial follow-up in 2 weeks to evaluate safety, medication adherence, and symptom trajectory; then regularly every 4-6 weeks. - Monitoring parameters: Mood symptoms, suicidal ideation, medication side effects, sleep patterns. - Red flag symptoms: Increased suicidal thoughts, mood swings, aggression, or medication adverse effects requiring urgent evaluation. - Treatment response assessment: Symptom scales (e.g., PHQ-9), patient self-report, functional status, safety.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Use a calm, validating tone, emphasizing collaboration, and ensuring she understands the safety plan. - Addressing patient concerns: Likely worries about medication side effects, stigma, or treatment efficacy. Reassure and provide clear information. - Adherence strategies: Simplify medication regimen, provide written instructions, schedule regular follow-ups, involve supportive persons if appropriate. - Family involvement: With consent, involve family members for support and monitoring.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Psychiatric consultation for medication adjustments and ongoing management, ideally within 1-2 weeks. - Other healthcare team members: Consider involving a therapist or counselor and certified case manager as needed. - Community resources: Bipolar support groups, educational materials from mental health organizations. - Insurance/cost considerations: Ensure medications and therapy are covered; explore patient assistance programs if necessary.\nANSWER: Based on the diagnosis of Major Depressive Disorder, current episode END, but considering the context suggestive of bipolar disorder type II with depressive episodes, I recommend a comprehensive treatment approach that combines evidence-based pharmacotherapy, psychotherapy, and safety planning. The treatment plan includes initiating a mood stabilizer such as lamotrigine, coupled with psychotherapy (e.g., cognitive-behavioral therapy or psychoeducation) to address mood stabilization and symptom management, while closely monitoring for mood shifts or adverse effects. Immediate focus is on establishing safety given the passive suicidal ideation, with scheduled follow-up within 2 weeks to assess response and tolerability. Long-term management aims to stabilize mood, prevent future episodes, and support recovery through medication adherence, lifestyle modifications, and patient education. Ongoing surveillance will involve regular symptom assessment, monitoring for adverse effects, and adjusting treatment as needed to optimize outcomes and minimize risks.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Educate the patient about mood disorder symptoms, safety, and the importance of medication adherence; develop a safety plan for suicidal ideation; plan first psychiatric follow-up. - Short-term goals (1-4 weeks): Initiate medication titration, confirm engagement in psychotherapy, monitor for side effects and mood stabilization. - Long-term objectives (3-6 months): Achieve sustained mood stability, reduce depressive episodes, and establish healthy routines. - Patient handout summary: Key points about bipolar disorder, medication purpose and side effects, importance of routine, and emergency contact information.",
    "gold_diagnosis": "Bipolar type II disorder, current episode depressive, mild"
  }
]