[
  {
    "vignette_index": 12,
    "input": "Stress-induced somatic symptoms / somatic symptom disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: High confidence in stress-induced somatic symptoms / somatic symptom disorder, given episodes of tingling, chest tightness, and pressure related to stress, with no objective findings. - Severity classification: Moderate, as symptoms are episodic, persistent for months, worsening with stress and fatigue, but not causing functional impairment to the degree that would require urgent intervention. - Urgency level: Routine care needed, as there is no evidence of life-threatening symptoms; reassurance and management are appropriate. - Differential considerations still requiring monitoring: Cardiac, neurological, or other somatic conditions should be periodically re-evaluated if new symptoms arise.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Cognitive Behavioral Therapy (CBT) targeting health anxiety and stress management. - Supporting evidence: CBT is strongly supported for somatic symptom disorder, effectively reducing symptom severity and health anxiety. - Patient-specific considerations: She exhibits poor insight; psychoeducation will be essential. - Contraindications or cautions: Avoid unnecessary reassurance-focused interventions alone, which can reinforce illness beliefs.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Not indicated as first-line; consider only if symptoms significantly impair functioning or if comorbid mood/anxiety disorders exist. - Rationale for selection: Pharmacotherapy (e.g., SSRIs) can be adjunct if psychotherapy alone is insufficient. - Expected timeline for improvement: 4-6 weeks for antidepressant benefits if started. - Key side effects to monitor: GI disturbances, sleep changes, sexual side effects; monitor mood and adherence. - Alternative medications if first-line fails: Serotonin-norepinephrine reuptake inhibitors (SNRIs), low-dose mirtazapine for sleep if needed.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Initiate CBT focusing on stress reduction, health anxiety, and functional coping strategies. - Patient education priorities: Normalize benign nature of symptoms; explain the role of stress; dispel catastrophic beliefs. - Lifestyle modifications: Encourage regular exercise, sleep hygiene, balanced diet, stress reduction techniques (e.g., mindfulness, relaxation exercises). - Behavioral interventions: Consider referral for relaxation training or meditation classes; utilize stress management techniques.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Schedule in 4 weeks to evaluate response to psychotherapy and adjustment of interventions. - Monitoring parameters: Symptom frequency/severity, stress levels, health anxiety scores. - Red flag symptoms: New neurological deficits, chest pain worsening, palpitations, fainting—seek urgent evaluation. - Treatment response assessment: Use symptom diaries and anxiety scales to gauge improvement.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Empathic, non-judgmental; validate her distress while emphasizing benign nature of symptoms. - Addressing patient concerns: Reassure that symptoms are manageable and linked to stress. - Adherence strategies: Explain benefits of psychotherapy and lifestyle changes; involve her actively in planning. - Family involvement: With her consent, involve family members to support adherence and understanding.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Consider referral to a psychologist or psychiatrist trained in CBT or health anxiety. - Other healthcare team members: Collaborate with primary care team for continuity. - Community resources: Provide info on stress management programs, support groups for health anxiety. - Insurance/cost considerations: Verify coverage for psychotherapy; explore low-cost or community options.\nANSWER: Based on the diagnosis of stress-induced somatic symptoms / somatic symptom disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating cognitive-behavioral therapy to address health anxiety and develop stress management skills, along with patient education emphasizing the benign and stress-related nature of her symptoms. Lifestyle modifications such as regular exercise, sleep hygiene, and relaxation techniques will support symptom reduction. Pharmacotherapy is reserved for cases where symptoms significantly impair functioning or co-existing mood/anxiety disorders are identified, with SSRIs as the first choice if needed. Follow-up will be scheduled in 4 weeks to assess progress, with ongoing monitoring for symptom changes and emergence of red flag symptoms. Engagement with mental health professionals and community resources will be integral to sustainability. This approach aims to reduce distress, improve functional status, and minimize unnecessary medical interventions.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Provide psychoeducation, reassure benign nature of symptoms, and initiate discussion for psychotherapy referral. - Short-term goals (1-4 weeks): Start CBT, implement lifestyle changes, and monitor symptom trends. - Long-term objectives (3-6 months): Achieve symptom stabilization, improved stress management, and reduced health anxiety. - Patient handout summary: Include key points about stress management, the benign nature of symptoms, and the importance of therapy and lifestyle modifications.",
    "gold_diagnosis": "Hypochondriasis with poor to absent insight"
  }
]