[
  {
    "vignette_index": 4167,
    "input": "THINKING:\nDiagnosis: Isoniazid-induced neuropsychiatric toxicity\nJustification: The patient developed new neuropsychiatric symptoms—visual hallucinations, paranoia, anxiety, sleep disturbances, and cognitive fog—approximately one week after starting a new tuberculosis medication. Isoniazid is known to cause neurotoxicity, including hallucinations and neuropsychiatric symptoms, especially if the patient has a deficiency in vitamin B6 (pyridoxine), which is often exacerbated by concomitant medications or nutritional deficiencies. The absence of prior similar symptoms further suggests an acquired, drug-related cause rather than a primary psychiatric disorder. The temporal association with the medication initiation supports this diagnosis.\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nIsoniazid-induced neuropsychiatric toxicity END",
    "output": "THINKING: The patient’s neuropsychiatric symptoms are likely attributable to isoniazid toxicity, which is known to cause hallucinations, paranoia, anxiety, sleep disturbances, and cognitive fog, particularly in the context of pyridoxine deficiency. The timing of symptom onset following medication initiation further supports this. The primary approach involves discontinuing or substituting isoniazid to halt further neurotoxicity. Supplementation with vitamin B6 (pyridoxine) is essential to reverse and prevent neurotoxic effects, especially if ongoing isoniazid therapy is necessary. Supportive care such as reassurance, monitoring mental status, and addressing sleep and anxiety disturbances as needed are also important. Pharmacological interventions, like antipsychotics or anxiolytics, may be used cautiously if symptoms are severe and causing significant distress, but the main focus should be on removal of the offending agent and B6 repletion.\n\nANSWER: The treatment plan should include discontinuing isoniazid immediately if clinically feasible, and initiating high-dose pyridoxine (typically 25-50 mg orally daily) to replenish vitamin B6 levels and address neurotoxicity. Consider substituting isoniazid with an alternative antitubercular agent, such as rifampin or an alternative regimen, after consultation with an infectious disease specialist. Supportive management should involve reassurance and monitoring of neuropsychiatric symptoms, with the potential addition of low-dose anxiolytics or antipsychotics if symptoms are severe or distressing. It is also important to review the patient’s nutritional status, ensure adequate intake of B6-rich foods, and monitor for symptom resolution. Close follow-up is necessary to assess for response to therapy and to determine future TB treatment options."
  }
]