[
  {
    "vignette_index": 81,
    "input": "Herpetic keratitis END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High, based on the acute presentation with vesicular lesions, ocular pain, photophobia, and systemic symptoms. - Severity classification: Likely moderate to severe, given rapid progression, intense pain, visual symptoms, and potential for corneal involvement threatening vision. - Urgency level: Immediate ophthalmologic consultation is essential; this condition can progress rapidly to corneal ulceration or scarring if untreated. - Differential considerations still requiring monitoring: Bacterial keratitis, allergic conjunctivitis, other viral or autoimmune keratitis.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Topical antiviral therapy with manifestly effective agents. - Supporting evidence: Topical antivirals, such as trifluridine, ganciclovir gel, or vidarabine, are proven to reduce viral replication and improve outcomes in herpetic keratitis. - Patient-specific considerations: The patient’s age, systemic health, and potential for adherence. - Contraindications or cautions: Avoid corticosteroids initially unless prescribed by ophthalmologist, as they can exacerbate viral replication if used improperly.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Ganciclovir 0.15% ophthalmic gel, applied five times daily. - Rationale for selection: Has demonstrated high efficacy with fewer side effects and is specifically approved for herpetic keratitis. - Expected timeline for improvement: Symptomatic relief within a few days; clinical improvement typically seen in 1-2 weeks. - Key side effects to monitor: Local irritation, conjunctival hyperemia; rare systemic absorption. - Alternative medications if first-line fails: Trifluridine 1% drops or vidarabine ointment; systemic acyclovir may be added if stromal or intraocular involvement develops.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Maintain good eyelid hygiene, avoid eye rubbing. - Patient education priorities: Emphasize importance of adherence to medications, recognize worsening symptoms. - Lifestyle modifications: Minimize eye strain, wear protective sunglasses to reduce photophobia. - Behavioral interventions: Stress management techniques as systemic symptoms alleviate.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Re-evaluate ophthalmologist within 24-48 hours; weekly until active infection resolves. - Monitoring parameters: Symptom resolution, visual acuity, evidence of corneal healing or ulceration, intraocular inflammation. - Red flag symptoms: Sudden worsening of pain, vision loss, signs of corneal perforation, worsening conjunctivitis. - Treatment response assessment: Symptom improvement, decreased lesion size, corneal clarity.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (baseline), how should I communicate this plan? - Communication approach: Clear, concise explanations emphasizing the urgency and importance of adherence. - Addressing patient concerns: Reassure regarding safety and efficacy of medications. - Adherence strategies: Provide written instructions, set reminders, encourage questions. - Family involvement: With patient consent, inform family members about signs requiring urgent care.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Immediate ophthalmology consultation to confirm diagnosis, initiate topical antivirals, and monitor. - Other healthcare team members: Possible collaboration with nurses for medication education. - Community resources: Educational pamphlets on herpetic eye disease, support groups if needed. - Insurance/cost considerations: Confirm medication coverage, consider cost-effective options while ensuring treatment efficacy.\nANSWER: Based on the diagnosis of herpetic keratitis, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating topical ganciclovir 0.15% gel applied five times daily, ensuring prompt ophthalmologic consultation for confirmation and ongoing monitoring. Topical antivirals are essential to limit viral replication and prevent corneal scarring. Supportive care involves eyelid hygiene, photophobia management, and patient education on medication adherence and symptom monitoring. Follow-up within 24-48 hours with an ophthalmologist is crucial for assessment of treatment response, with ongoing weekly evaluations until resolution. Patient education will emphasize the importance of adherence, recognizing worsening signs, and avoiding eye rubbing. Short-term goals aim for symptomatic improvement and lesion control within 1-2 weeks, with long-term management focused on preventing recurrences and monitoring for potential complications like stromal keratitis. This approach aims to preserve vision, minimize complications, and promote recovery while addressing patient concerns and ensuring coordinated care with ophthalmology and support resources.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange urgent ophthalmology consultation, start topical ganciclovir, and advise patient on symptom monitoring. - Short-term goals (1-4 weeks): Achieve lesion resolution, prevent complications, and educate patient on recurrence prevention. - Long-term objectives (3-6 months): Monitor for recurrence, educate on triggers, and ensure stable ocular health. - Patient handout summary: Key points about herpetic keratitis, medication instructions, warning signs, and follow-up importance.",
    "gold_diagnosis": "Herpes simplex keratitis"
  }
]