[
  {
    "vignette_index": 281,
    "input": "Substance-Induced Psychotic Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High, given the episodic visual hallucinations following inhalant use, associated confusion, disorientation, and the pattern consistent with inhalant-induced psychosis. - Severity classification: Moderate, as hallucinations are recurrent but not described as persistent or severely impairing daily functioning; agitation or safety concerns are not specified yet. - Urgency level: Routine care needed, with close follow-up to monitor for escalation or deterioration. - Differential considerations still requiring monitoring: Other neuropsychiatric conditions (e.g., primary psychotic disorder), ongoing substance use issues, metabolic or neurological causes.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Abstinence from inhalants and supportive management; in some cases, adjunctive pharmacotherapy for psychotic symptoms. - Supporting evidence: Abstinence is crucial since inhalant toxicity/substance-induced psychosis is often reversible with cessation; antipsychotics may be used short-term if symptoms persist or cause significant impairment. - Patient-specific considerations: The patient is a holder of information; likely minimizing substance use, which may impact engagement. The episodes are episodic, suggesting potential for recovery with abstinence. - Contraindications or cautions: Avoid sedative medications that may worsen confusion; monitor for extrapyramidal symptoms if antipsychotics are introduced.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: low-dose risperidone (e.g., 1 mg daily), considering its efficacy and tolerability. - Rationale for selection: Risperidone has a favorable side effect profile for short-term management of psychosis, with quick onset of action. - Expected timeline for improvement: noticeable reduction of hallucinations within 1-2 weeks. - Key side effects to monitor: weight gain, extrapyramidal symptoms, sedation, metabolic changes. - Alternative medications if first-line fails: olanzapine or aripiprazole; dosage adjustments based on response and tolerability.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: psychoeducation on substance effects, stress management techniques. - Patient education priorities: importance of abstaining from inhalants, recognizing early warning signs of relapse. - Lifestyle modifications: establishing regular sleep patterns, stress reduction strategies, avoiding environments associated with inhalant use. - Behavioral interventions: motivational interviewing, cognitive-behavioral therapy (CBT) for substance use and hallucination management; referral to substance use counseling.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: re-evaluate in 1-2 weeks after initiating treatment; then monthly until stabilized. - Monitoring parameters: symptom frequency/severity, medication side effects, substance use (self-report and, if available, urine drug screens). - Red flag symptoms: worsening hallucinations, suicidal ideation, worsening confusion, agitation, signs of neurotoxicity. - Treatment response assessment: reduction in hallucination episodes, improved sleep, decreased anxiety, patient's insight and cooperation.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (information_withholder), how should I communicate this plan? - Communication approach: use clear, gentle explanations emphasizing safety and recovery; explicitly check for understanding and encourage questions. - Addressing patient concerns: reassure about confidentiality, the reversibility of symptoms with abstinence, and the support available. - Adherence strategies: involve the patient in treatment planning, possibly using visual aids or written summaries; consider motivational interviewing techniques. - Family involvement: with patient consent, involve family or support persons to enhance adherence and monitoring.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: psychiatry for medication management and ongoing psychiatric support; addiction specialist for substance use treatment. - Other healthcare team members: case manager or social worker for resource coordination; mental health therapist for CBT. - Community resources: local substance abuse support groups, educational programs, crisis lines. - Insurance/cost considerations: ensure medication coverage and access to therapy services; discuss affordability and transportation if needed.\nANSWER: Based on the diagnosis of Substance-Induced Psychotic Disorder, specifically inhalant-induced delirium, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes advising complete abstinence from inhalants, initiating low-dose risperidone to manage psychotic symptoms, and providing psychoeducation regarding substance effects and relapse prevention. Short-term pharmacotherapy aims to reduce hallucinations and agitation, with close monitoring for side effects. Non-pharmacological interventions include motivational interviewing, stress management, sleep hygiene, and engaging mental health counseling, particularly CBT for substance use. Ongoing follow-up in 1-2 weeks to assess symptom resolution, medication tolerability, and substance use is essential, with subsequent visits monthly. Collaborating with psychiatry, addiction specialists, and involving family or support persons as appropriate can enhance adherence and recovery. The ultimate goal is to achieve symptom remission, support abstinence, and prevent relapse through integrated medical, psychological, and social support systems.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): confirm substance abstinence, provide psychoeducation, start lowest effective dose risperidone, schedule follow-up. - Short-term goals (1-4 weeks): reduction or resolution of hallucinations, stabilization of mood and sleep, initiation of substance use counseling. - Long-term objectives (3-6 months): sustained abstinence, full symptom resolution, improved functioning, integration of coping strategies. - Patient handout summary: importance of avoiding inhalants, recognizing early symptoms of relapse, medication adherence, and when to seek urgent care.",
    "gold_diagnosis": "Volatile inhalant-induced delirium"
  }
]