[
  {
    "vignette_index": 359,
    "input": "Postpartum hemorrhage with hypovolemic shockEND",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment plan. Starting with confirmation of the diagnosis and assessment of severity, I recognize postpartum hemorrhage with hypovolemic shock as a \nANSWER: Based on the diagnosis of postpartum hemorrhage with hypovolemic shock, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate stabilization with fluid resuscitation, uterotonics, and blood transfusion if indicated, with careful clinical monitoring to prevent worsening shock. Long-term management involves monitoring for ongoing bleeding, correcting anemia, and planning for postpartum follow-up. Initial management focuses on rapid stabilization and control of bleeding, while establishing a multidisciplinary team for ongoing care. Follow-up care will include reassessment of hemodynamic status, laboratory evaluations, and support for recovery. This approach aims to restore circulatory stability, prevent complications, and ensure safe postpartum recovery.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Initiate IV access with large-bore cannulas, start rapid infusion of warmed isotonic saline or lactated Ringer’s solution, administer uterotonics (e.g., oxytocin IV infusion), and prepare blood products for transfusion if hemoglobin is low or bleeding persists.\n- Short-term goals (1-4 weeks): Monitor vital signs, hemoglobin, and coagulation profile; assess for ongoing bleeding or anemia; provide iron supplementation if needed; educate about recognizing signs of recurrent bleeding.\n- Long-term objectives (3-6 months): Ensure complete recovery, address anemia, review delivery and bleeding history, and plan for future pregnancies with counseling on bleeding risks.\n- Patient handout summary: Emphasize the importance of prompt reporting of heavy bleeding, dizziness, or faintness; explain treatment steps, including transfusions and medications; stress adherence to follow-up visits and anemia management.",
    "thinking": "Use systematic clinical reasoning to develop your treatment plan. Starting with confirmation of the diagnosis and assessment of severity, I recognize postpartum hemorrhage with hypovolemic shock as a",
    "answer": "Based on the diagnosis of postpartum hemorrhage with hypovolemic shock, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate stabilization with fluid resuscitation, uterotonics, and blood transfusion if indicated, with careful clinical monitoring to prevent worsening shock. Long-term management involves monitoring for ongoing bleeding, correcting anemia, and planning for postpartum follow-up. Initial management focuses on rapid stabilization and control of bleeding, while establishing a multidisciplinary team for ongoing care. Follow-up care will include reassessment of hemodynamic status, laboratory evaluations, and support for recovery. This approach aims to restore circulatory stability, prevent complications, and ensure safe postpartum recovery.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Initiate IV access with large-bore cannulas, start rapid infusion of warmed isotonic saline or lactated Ringer’s solution, administer uterotonics (e.g., oxytocin IV infusion), and prepare blood products for transfusion if hemoglobin is low or bleeding persists.\n- Short-term goals (1-4 weeks): Monitor vital signs, hemoglobin, and coagulation profile; assess for ongoing bleeding or anemia; provide iron supplementation if needed; educate about recognizing signs of recurrent bleeding.\n- Long-term objectives (3-6 months): Ensure complete recovery, address anemia, review delivery and bleeding history, and plan for future pregnancies with counseling on bleeding risks.\n- Patient handout summary: Emphasize the importance of prompt reporting of heavy bleeding, dizziness, or faintness; explain treatment steps, including transfusions and medications; stress adherence to follow-up visits and anemia management.",
    "gold_diagnosis": "Third-stage haemorrhage"
  }
]