[
  {
    "vignette_index": 494,
    "input": "Aortic Dissection END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary \nANSWER: Based on the diagnosis of aortic dissection, I recommend a comprehensive treatment approach that combines immediate hemodynamic stabilization with urgent specialist intervention. The initial focus should be on rapidly controlling blood pressure and heart rate with IV beta-blockers (e.g., esmolol), while preparing for emergent surgical consultation if the dissection involves the ascending aorta. Hospitalization with continuous monitoring for signs of extension or complications is essential. Patient education should emphasize the severity of the condition and the necessity of urgent care, addressing anxiety through reassurance and support. Long-term management includes strict blood pressure control, lifestyle modifications, and close follow-up with cardiothoracic surgery and primary care. This plan aims to prevent progression, reduce mortality risk, and support the patient's physical and psychological recovery.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Initiate IV beta-blocker infusion, establish monitoring with continuous ECG and blood pressure; alert surgical team.\n- Short-term goals (1-4 weeks): Achieve blood pressure and heart rate targets, complete imaging to determine extent, and facilitate surgical planning.\n- Long-term objectives (3-6 months): Post-operative follow-up, strict blood pressure management, lifestyle changes, and psychological support.\n- Patient handout summary: Importance of blood pressure control, recognition of warning signs, role of surgery, and lifestyle recommendations.",
    "thinking": "Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary",
    "answer": "Based on the diagnosis of aortic dissection, I recommend a comprehensive treatment approach that combines immediate hemodynamic stabilization with urgent specialist intervention. The initial focus should be on rapidly controlling blood pressure and heart rate with IV beta-blockers (e.g., esmolol), while preparing for emergent surgical consultation if the dissection involves the ascending aorta. Hospitalization with continuous monitoring for signs of extension or complications is essential. Patient education should emphasize the severity of the condition and the necessity of urgent care, addressing anxiety through reassurance and support. Long-term management includes strict blood pressure control, lifestyle modifications, and close follow-up with cardiothoracic surgery and primary care. This plan aims to prevent progression, reduce mortality risk, and support the patient's physical and psychological recovery.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Initiate IV beta-blocker infusion, establish monitoring with continuous ECG and blood pressure; alert surgical team.\n- Short-term goals (1-4 weeks): Achieve blood pressure and heart rate targets, complete imaging to determine extent, and facilitate surgical planning.\n- Long-term objectives (3-6 months): Post-operative follow-up, strict blood pressure management, lifestyle changes, and psychological support.\n- Patient handout summary: Importance of blood pressure control, recognition of warning signs, role of surgery, and lifestyle recommendations.",
    "gold_diagnosis": "Aneurysm or dissection of artery of lower extremity"
  }
]