[
  {
    "vignette_index": 27,
    "input": "Major Depressive Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary \nANSWER: Based on the diagnosis of Major Depressive Disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating pharmacotherapy with a selective serotonin reuptake inhibitor (e.g., sertraline 50 mg daily) alongside cognitive-behavioral therapy, tailored to the patient's personality profile and substance dependence history. Immediate priorities include careful monitoring for side effects and safety, especially during early treatment. Long-term management will involve regular follow-up at 2 and 4-6 weeks to assess symptom improvement, adherence, and any emerging concerns. Patient education will focus on understanding depression, setting realistic expectations, and recognizing warning signs of worsening mood or suicidality. This integrated plan aims to alleviate symptoms, improve functioning, and ensure safety while respecting the patient's stoic demeanor by fostering a supportive, open communication environment.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Schedule an initial follow-up, begin psychoeducation, and discuss starting sertraline; assess for immediate safety concerns.\n- Short-term goals (1-4 weeks): Titrate medication as tolerated, initiate CBT, evaluate adherence, and monitor symptoms.\n- Long-term objectives (3-6 months): Achieve remission or significant improvement in depressive symptoms, maintain engagement in therapy, and assess for ongoing substance dependence support.\n- Patient handout summary: Depression is common but treatable; medication and therapy work together; important to follow up regularly; watch for worsening thoughts or mood changes.",
    "thinking": "Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary",
    "answer": "Based on the diagnosis of Major Depressive Disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating pharmacotherapy with a selective serotonin reuptake inhibitor (e.g., sertraline 50 mg daily) alongside cognitive-behavioral therapy, tailored to the patient's personality profile and substance dependence history. Immediate priorities include careful monitoring for side effects and safety, especially during early treatment. Long-term management will involve regular follow-up at 2 and 4-6 weeks to assess symptom improvement, adherence, and any emerging concerns. Patient education will focus on understanding depression, setting realistic expectations, and recognizing warning signs of worsening mood or suicidality. This integrated plan aims to alleviate symptoms, improve functioning, and ensure safety while respecting the patient's stoic demeanor by fostering a supportive, open communication environment.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Schedule an initial follow-up, begin psychoeducation, and discuss starting sertraline; assess for immediate safety concerns.\n- Short-term goals (1-4 weeks): Titrate medication as tolerated, initiate CBT, evaluate adherence, and monitor symptoms.\n- Long-term objectives (3-6 months): Achieve remission or significant improvement in depressive symptoms, maintain engagement in therapy, and assess for ongoing substance dependence support.\n- Patient handout summary: Depression is common but treatable; medication and therapy work together; important to follow up regularly; watch for worsening thoughts or mood changes.",
    "gold_diagnosis": "Stimulant dependence including amphetamines, methamphetamine or methcathinone, sustained partial remission"
  }
]