[
  {
    "vignette_index": 758,
    "input": "Intrahepatic cholestasis of pregnancy with hepatic impairment END",
    "output": "THINKING: Use systematic clinical reasoning to develop a treatment approach for intrahepatic cholestasis of pregnancy with hepatic impairment. First, I'll confirm the diagnosis and assess severity/urgency, considering the patient's presentation with jaundice, systemic illness signs, and potential neurological involvement. Severity must be carefully classified to determine urgency and monitor for complications like hepatic failure or fetal risks. The evidence-based treatment prioritizes maternal stabilization, symptom relief, and fetal safety. Pharmacological options may include ursodeoxycholic acid, which is standard, but in severe hepatic impairment, close monitoring and possible hospitalization are necessary. Non-pharmacological strategies involve supportive care and patient education. Follow-up will focus on liver function tests, fetal monitoring, and neurological status. Communication should be clear and reassuring, emphasizing the importance of adherence and follow-up. Referrals to obstetrics, hepatology, and potentially nutrition or social services are indicated. The plan aims for maternal stabilization, fetal wellbeing, and minimizing risks.\nANSWER: Based on the diagnosis of intrahepatic cholestasis of pregnancy with hepatic impairment, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes close inpatient or outpatient monitoring of hepatic function and fetal wellbeing, administration of ursodeoxycholic acid to alleviate cholestasis, and supportive care to address dehydration and nutritional needs, with careful observation for signs of worsening hepatic impairment. Initial management focuses on optimizing maternal health, preventing complications such as hepatic failure or encephalopathy, and monitoring fetal status via non-stress tests or biophysical profiles. Long-term management involves ongoing liver function assessment, fetal surveillance, and planning for delivery at term or earlier if maternal or fetal risks escalate. Follow-up care will include regular labs, neurological assessment, and obstetric evaluations. Patient education will emphasize symptom reporting, adherence to medications, and the importance of immediate care if neurological symptoms worsen. This approach aims to improve maternal and fetal outcomes, minimize hepatic deterioration, and prevent complications related to hepatic impairment.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Initiate hospitalization if neurological symptoms or hepatic deterioration are evident; start ursodeoxycholic acid 15 mg/kg/day divided in 2-3 doses; ensure IV fluids for hydration; arrange immediate obstetric consultation and fetal monitoring. - Short-term goals (1-4 weeks): Monitor liver function tests, maternal neurological status, and fetal wellbeing regularly; adjust treatment as needed; plan for delivery timing based on maternal and fetal status. - Long-term objectives (3-6 months): Achieve stabilization of hepatic function; maintain fetal health; plan for delivery and postpartum follow-up to assess maternal hepatic recovery. - Patient handout summary: - Take your medications as prescribed and report any worsening symptoms like confusion, severe fatigue, or worsening jaundice. - Keep all obstetric and liver function appointments. - Notify your healthcare provider immediately if you experience headache, vision changes, confusion, abdominal pain, or decreased fetal movements. - Follow dietary and hydration recommendations. - Understand the importance of close monitoring for you and your baby.",
    "gold_diagnosis": "Viral hepatitis complicating pregnancy, childbirth or the puerperium"
  }
]