[
  {
    "vignette_index": 224,
    "input": "Postpartum hemorrhage leading to hypovolemic shock END",
    "output": "THINKING: Use systematic clinical reasoning to develop a treatment approach:\n \nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary di\nANSWER: Based on the diagnosis of postpartum hemorrhage leading to hypovolemic shock, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate volume resuscitation with IV fluids and transfusion of compatible blood products to restore blood volume and stabilize hemodynamics. Uterotonics such as oxytocin should be administered promptly to promote uterine contraction; tranexamic acid should be given early to reduce ongoing bleeding. Non-pharmacological measures like uterine massage and examination for retained tissue should be performed, with additional intervention such as uterine tamponade if bleeding persists. Continuous monitoring of vital signs, bleeding, and laboratory parameters is essential, with close attention to red flags warranting urgent action. Clear communication tailored to her storytelling style involves explaining each step simply and reassuring her efforts. Engagement of her support system and referrals to obstetrics and hematology specialists ensure comprehensive care. Follow-up in hospital and outpatient settings will track recovery and address potential complications. This approach aims to quickly stabilize her condition, minimize blood loss, and support her recovery in both physical and emotional aspects.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Ensure resuscitation with IV fluids and initiate blood transfusion; administer oxytocin and tranexamic acid; perform uterine examination and massage.\n- Short-term goals (1-4 weeks): Achieve hemodynamic stabilization, monitor hemoglobin levels, and prevent recurrent bleeding.\n- Long-term objectives (3-6 months): Complete postpartum recovery, address any ongoing coagulation issues, and provide psychological support if needed.\n- Patient handout summary: Key points include signs of ongoing bleeding, importance of follow-up visits, and recognizing symptoms requiring urgent attention.",
    "thinking": "Use systematic clinical reasoning to develop a treatment approach:\n \nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary di",
    "answer": "Based on the diagnosis of postpartum hemorrhage leading to hypovolemic shock, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate volume resuscitation with IV fluids and transfusion of compatible blood products to restore blood volume and stabilize hemodynamics. Uterotonics such as oxytocin should be administered promptly to promote uterine contraction; tranexamic acid should be given early to reduce ongoing bleeding. Non-pharmacological measures like uterine massage and examination for retained tissue should be performed, with additional intervention such as uterine tamponade if bleeding persists. Continuous monitoring of vital signs, bleeding, and laboratory parameters is essential, with close attention to red flags warranting urgent action. Clear communication tailored to her storytelling style involves explaining each step simply and reassuring her efforts. Engagement of her support system and referrals to obstetrics and hematology specialists ensure comprehensive care. Follow-up in hospital and outpatient settings will track recovery and address potential complications. This approach aims to quickly stabilize her condition, minimize blood loss, and support her recovery in both physical and emotional aspects.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Ensure resuscitation with IV fluids and initiate blood transfusion; administer oxytocin and tranexamic acid; perform uterine examination and massage.\n- Short-term goals (1-4 weeks): Achieve hemodynamic stabilization, monitor hemoglobin levels, and prevent recurrent bleeding.\n- Long-term objectives (3-6 months): Complete postpartum recovery, address any ongoing coagulation issues, and provide psychological support if needed.\n- Patient handout summary: Key points include signs of ongoing bleeding, importance of follow-up visits, and recognizing symptoms requiring urgent attention.",
    "gold_diagnosis": "Intrapartum haemorrhage with coagulation defect"
  }
]