[
  {
    "vignette_index": 4155,
    "input": "THINKING:  \nDiagnosis: Pheochromocytoma  \nJustification: The patient's symptoms—including episodic headaches, dizziness upon standing, facial flushing, sense of warmth, tachycardia, sweating, and episodes mainly in the mornings or upon standing—are characteristic features of catecholamine excess. These episodes are often linked to tumor secretion of catecholamines from a pheochromocytoma. Additionally, the patient's known hypertension and symptom pattern align with this diagnosis. The episodes' duration and associated autonomic symptoms support this suspicion, and further testing with plasma or urine catecholamines would confirm the diagnosis.  \nChecklist:  \n- No diagnostic uncertainty remaining: No  \n- No further clarification needed: No  \n\nANSWER:  \nPheochromocytoma  \nEND",
    "output": "THINKING: Pheochromocytoma is a catecholamine-secreting tumor that can cause significant hypertensive episodes and symptoms such as headaches, sweating, tachycardia, and flushing. The primary goal is to prevent hypertensive crises and stabilize blood pressure before definitive treatment. Initial management should focus on pharmacologic blockade to control catecholamine effects, typically with alpha-adrenergic antagonists to prevent hypertensive surges, followed by beta-blockers if tachycardia persists, but only after adequate alpha blockade to avoid unopposed alpha vasoconstriction. Non-pharmacological measures include reducing stress and avoiding factors that may provoke catecholamine release. Once stabilized, the patient should undergo imaging studies (such as CT or MRI of the adrenal glands) to localize the tumor, followed by surgical excision, which is curative. Close outpatient follow-up and possibly consultation with an endocrinologist specialized in adrenal tumors are essential.\n\nANSWER: The treatment plan involves initiating alpha-adrenergic blockade, such as starting phenoxybenzamine or a similar long-acting alpha blocker, to control episodic hypertension and reduce catecholamine effects. Once adequate alpha blockade is achieved and blood pressure is stabilized, a beta-blocker (e.g., propranolol or labetalol) can be added to manage tachycardia, but only after ensuring alpha blockade to avoid hypertensive crises. Concurrently, the patient should undergo imaging—preferably CT or MRI of the adrenal glands—to locate the tumor. The patient should be counseled to avoid activities or medications that may provoke catecholamine release. After stabilization and localization, surgical removal of the tumor (adrenalectomy) is the definitive treatment. Follow-up care will include monitoring blood pressure, catecholamine levels postoperatively, and coordinating care with endocrinology and surgery specialists to ensure complete resolution and manage any complications."
  }
]