[
  {
    "vignette_index": 542,
    "input": "Choroidal Nevus or Melanoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: High, given the gold standard diagnosis of conjunctival melanoma, which can present as pigmented conjunctival lesions. - Severity classification: Likely moderate to severe if confirmed, as melanoma poses higher risk of invasion and metastasis; severity depends on lesion size, location, and features such as thickness and ulceration. - Urgency level: Urgent, because conjunctival melanoma requires prompt identification and management to prevent local invasion and systemic spread. - Differential considerations still requiring monitoring: Benign nevus, pigmented inflamed lesion, or other conjunctival pigmented lesions needing further assessment.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Surgical excision with appropriate margin control, possibly combined with adjunctive cryotherapy. - Supporting evidence: Literature indicates that surgical excision with clear margins is primary, and adjunctive therapies improve local control. - Patient-specific considerations: The patient's vision symptoms and underreporting of related issues highlight the need for comprehensive ocular assessment; urgency also depends on lesion features. - Contraindications or cautions: Avoid delayed intervention; be cautious to preserve ocular structure and function.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Topical mitomycin C or interferon alfa-2b as adjuncts if needed; however, primary curettage and excision are surgical. - Rationale for selection: Adjunctive topical therapies can help reduce local recurrence post-surgery. - Expected timeline for improvement: Monitor healing and recurrence over initial 3-6 months. - Key side effects to monitor: Ocular surface toxicity, irritation, scleral thinning. - Alternative medications if first-line fails: Radiotherapy or enucleation in case of recurrence or extensive invasion.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Patient counseling on disease prognosis, importance of follow-up, and eye protection. - Patient education priorities: Recognize symptoms of recurrence or invasion, importance of adherence to follow-up. - Lifestyle modifications: Use of UV protection, avoid eye trauma. - Behavioral interventions: Encouragement to report new or worsening symptoms promptly.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Regular ophthalmologic exams every 3-6 months for the first 2 years, then annually. - Monitoring parameters: Lesion appearance, signs of recurrence, visual acuity, intraocular pressure if relevant. - Red flag symptoms: New or enlarging pigmented lesion, pain, visual decline, or signs of ocular invasion. - Treatment response assessment: Visual stability, absence of lesion growth or recurrence, patient-reported symptom control.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Use clear, non-technical language; emphasize the importance of follow-up and early detection. - Addressing patient concerns: Reassure about the treatment success rates, while being honest about risks. - Adherence strategies: Schedule follow-up appointments before discharge, use reminder systems, involve family if possible. - Family involvement: Engage family members to support adherence and provide emotional reassurance.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Ocular oncologist/cancer specialist for surgical management and possible adjunctive therapies. - Other healthcare team members: Ophthalmic nurses, optometrists, possibly a counselor for support. - Community resources: Eye health support groups, patient education materials. - Insurance/cost considerations: Assist with obtaining coverage for surgery, follow-up tests, medications.\nANSWER: Based on the diagnosis of conjunctival melanoma, I recommend a comprehensive treatment approach that combines evidence-based surgical management with adjunctive therapies and patient-centered care strategies. The initial management involves prompt surgical excision with clear margins, supported by adjunctive topical therapies such as mitomycin C or interferon alfa-2b to reduce recurrence risk. Patient education should emphasize the importance of regular follow-up, recognition of symptoms indicating recurrence, and ocular protection measures. Follow-up care will include scheduled ophthalmologic examinations every 3-6 months initially, with close monitoring for signs of local or systemic recurrence. This plan aims to optimize local tumor control, preserve visual function, and ensure early detection of potential complications, while minimizing treatment-related side effects and fostering patient adherence through clear communication and engagement.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange urgent ophthalmology consultation for detailed ocular assessment and surgical planning. - Short-term goals (1-4 weeks): Complete surgical excision, initiate adjunctive topical therapy if indicated, and educate the patient thoroughly. - Long-term objectives (3-6 months): Monitor for lesion recurrence, evaluate visual function, and adjust follow-up schedule based on clinical course. - Patient handout summary: Emphasize necessity of follow-up visits, protective eye behaviors, and prompt reporting of new symptoms, to promote compliance and early intervention.",
    "gold_diagnosis": "Melanoma of conjunctiva"
  }
]