[
  {
    "vignette_index": 667,
    "input": "Stevens-Johnson syndrome / Toxic epidermal necrolysis (SJS/TEN) END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: Very high; the presentation with extensive blistering and systemic symptoms along with a history suggests SJS/TEN. - Severity classification: Severe, given extensive skin involvement, systemic malaise, and potential ocular surface issues. - Urgency level: Immediate; SJS/TEN require urgent hospitalization and management. - Differential considerations still requiring monitoring: Disseminated herpes simplex infection, other drug reactions, bullous pemphigoid, but clinical features favor SJS/TEN.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Admission to a specialized or burn unit/hospital for supportive care; discontinue any suspected offending agents immediately. - Supporting evidence: Supportive care akin to burn management improves outcomes; immunomodulatory therapies are controversial but are considered in specific cases. - Patient-specific considerations: Potential herpes simplex involvement necessitates antiviral therapy; ocular symptoms suggest need for ophthalmology consultation. - Contraindications or cautions: Avoid antibiotics or steroids unless clinically indicated; monitor for secondary infections.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Initiate intravenous acyclovir (10 mg/kg every 8 hours for 7-10 days) considering disseminated herpes simplex; continue topical ocular antiviral treatment if needed. - Rationale for selection: Addresses active herpes simplex infection; acyclovir is effective and well-studied. - Expected timeline for improvement: Systemic and skin improvement within 1-2 weeks if responsive. - Key side effects to monitor: Renal function (azotemia), if IV acyclovir used. - Alternative medications if first-line fails: Foscarnet or famciclovir, but primarily rely on acyclovir unless contraindicated.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Strict skin care with gentle cleansing, wound management, temperature regulation, hydration. - Patient education priorities: Importance of medication adherence, recognition of complications, ocular surface care. - Lifestyle modifications: Adequate rest, nutrition support to promote healing. - Behavioral interventions: Psycho-social support if distress related to skin and systemic illness.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Daily assessments during hospitalization; ophthalmology and dermatology consults within 24-48 hours. - Monitoring parameters: Skin lesion evolution, signs of secondary infection, hydration, renal function, ocular surface status. - Red flag symptoms: Increasing pain, new or worsening ocular symptoms, signs of infection, hypovolemia. - Treatment response assessment: Improvement in skin lesions, stabilization of systemic symptoms, resolution of ocular irritation.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (baseline), how should I communicate this plan? - Communication approach: Clear, factual explanation emphasizing urgency and collaborative care. - Addressing patient concerns: Reassure about the effectiveness of supportive care and address fears about transfers or procedures. - Adherence strategies: Involve patient in decision-making to improve compliance. - Family involvement: Educate family members about care needs and warning signs for escalation.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Ophthalmology within 24 hours; dermatology for ongoing skin management. - Other healthcare team members: Nursing staff skilled in burn/skin care; social work for emotional support. - Community resources: Support groups for SJS/TEN; educational materials on disease management. - Insurance/cost considerations: Confirm coverage for hospitalization, antivirals, and specialist consultations; consider patient assistance programs if needed.\nANSWER: Based on the diagnosis of Stevens-Johnson syndrome / Toxic epidermal necrolysis (SJS/TEN), I recommend a comprehensive treatment approach that combines urgent supportive care with targeted antiviral therapy and multidisciplinary management. The key interventions include hospital admission with intensive wound and skin management, immediate discontinuation of suspected offending agents, initiation of IV acyclovir to treat disseminated herpes simplex infection, and close ophthalmologic evaluation for ocular involvement. Supportive care focuses on hydration, pain control, infection prevention, and skin protection. Ongoing monitoring involves regular assessment of skin, systemic status, and ocular health, with prompt escalation if symptoms worsen. Clear communication with the patient about the severity and necessity of multidisciplinary treatment will be crucial, along with involving dermatology, ophthalmology, and nursing teams to optimize recovery and prevent long-term sequelae.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Admit the patient to a specialized unit, stop all non-essential medications, start IV fluids, administer IV acyclovir, and arrange ophthalmology consult. - Short-term goals (1-4 weeks): Stabilize skin and systemic symptoms, prevent secondary infections, and initiate ocular surface management. - Long-term objectives (3-6 months): Skin re-epithelialization, ocular surface recovery, and monitoring for potential sequelae. - Patient handout summary: Educate about SJS/TEN severity, importance of medication abstinence, skin and eye care, and signs of complications requiring urgent care.",
    "gold_diagnosis": "Disseminated cutaneous herpes simplex infection complicating other skin diseases"
  }
]