[
  {
    "vignette_index": 773,
    "input": "THINKING:\nDiagnosis: Congenital or acquired ejaculatory duct obstruction possibly associated with seminal vesicle or ductal anomalies, leading to decreased or absent semen volume and sensation of pelvic fullness, possibly contributing to infertility. The patient's symptoms of difficulty initiating urination, incomplete bladder emptying, and abnormal semen characteristics suggest a blockage affecting the ejaculatory pathway and possibly associated with prostate or seminal vesicle dysfunction. The absence of systemic symptoms and no prior history of infections or surgeries lean toward a congenital anomaly or developmental abnormality rather than infection or acquired obstruction.\n\nJustification: The patient's presentation of reduced or absent semen, discomfort during ejaculation, and urinary symptoms suggest an obstructive process or developmental anomaly affecting the ejaculatory ducts or seminal vesicles. The dull, full sensation during ejaculation and occasional difficulty urinating indicate possible blockage points. The fact that his libido and erectile function are intact points away from neurovascular causes. This constellation supports a diagnosis involving obstruction or malformation of the ejaculatory pathway, which are common causes of male infertility with abnormal semen parameters.\n\nChecklist:\n- No diagnostic uncertainty remaining: No\n- No further clarification needed: No\n\nANSWER:\nCongenital or acquired ejaculatory duct obstruction / seminal vesicle abnormality END",
    "output": "THINKING: Given the diagnosis of congenital or acquired ejaculatory duct obstruction potentially associated with seminal vesicle or ductal anomalies, the primary goals are to confirm the diagnosis and address the obstruction to improve semen parameters and alleviate symptoms. Since the patient presents with symptoms indicative of blockage, initial management should include referral for additional diagnostic evaluation, such as transrectal ultrasound (TRUS) to visualize the seminal vesicles and ejaculatory ducts, and possibly a semen analysis to confirm the severity of the obstruction. Pharmacologic therapy is generally limited in cases of mechanical obstruction; thus, the mainstay treatment is usually surgical. However, in some cases, if partial obstruction or inflammation is suspected, medications such as alpha-blockers may be employed temporarily to help relax smooth muscle and improve flow. Non-pharmacological interventions include counseling and reproductive options, such as assisted reproductive techniques, if fertility is a concern. A referral to a urologist specializing in male infertility is essential for definitive management, which may involve minimally invasive procedures such as transurethral resection of the ejaculatory ducts (TURED). Supportive care addressing urinary symptoms and counseling regarding fertility options should be integrated into the management plan. \n\nANSWER: The initial treatment approach involves referral to a urologist specializing in male infertility for comprehensive assessment, including transrectal ultrasound to visualize the ejaculatory ducts and seminal vesicles. Depending on findings, surgical intervention such as transurethral resection of the ejaculatory ducts (TURED) may be indicated to relieve the obstruction. Symptomatic management of urinary issues can be pursued with alpha-blockers if appropriate, but these are adjuncts rather than definitive treatment. Counseling about fertility options, including assisted reproductive techniques like sperm retrieval combined with in vitro fertilization (IVF), should be provided if obstructive correction is not feasible or if fertility remains compromised. Follow-up should include repeat semen analysis and monitoring of urinary and ejaculatory symptoms post-intervention."
  }
]