[
  {
    "vignette_index": 78,
    "input": "Limb-Girdle Muscular Dystrophy END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\n- Primary diagnosis confidence: The diagnosis of scapuloperoneal muscular \nANSWER: Based on the diagnosis of scapuloperoneal muscular dystrophy, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes regular physical and occupational therapy focused on strengthening and maintaining functional capacity, along with routine monitoring of muscle strength and respiratory function. Emphasis is placed on patient education about disease progression, activity modification, and safety, with tailored lifestyle modifications such as low-impact exercise and energy conservation. Pharmacological treatments currently do not alter disease progression but may include symptomatic management if needed in the future. Follow-up should occur every 3 to 6 months, with prompt attention to any signs of rapid decline or respiratory issues. Clear communication, involving the patient actively and including family support, will guide adherence and optimize quality of life. Coordination with neurology specialists and community resources completes the multidisciplinary approach aimed at preserving function and preventing complications.",
    "thinking": "Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\n- Primary diagnosis confidence: The diagnosis of scapuloperoneal muscular",
    "answer": "Based on the diagnosis of scapuloperoneal muscular dystrophy, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes regular physical and occupational therapy focused on strengthening and maintaining functional capacity, along with routine monitoring of muscle strength and respiratory function. Emphasis is placed on patient education about disease progression, activity modification, and safety, with tailored lifestyle modifications such as low-impact exercise and energy conservation. Pharmacological treatments currently do not alter disease progression but may include symptomatic management if needed in the future. Follow-up should occur every 3 to 6 months, with prompt attention to any signs of rapid decline or respiratory issues. Clear communication, involving the patient actively and including family support, will guide adherence and optimize quality of life. Coordination with neurology specialists and community resources completes the multidisciplinary approach aimed at preserving function and preventing complications.",
    "gold_diagnosis": "Scapuloperoneal muscular dystrophy"
  }
]