[
  {
    "vignette_index": 833,
    "input": "Severe Major Depressive Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop my treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High, given clinical presentation aligned with severe MDD without psychotic features. - Severity classification: Severe, evidenced by persistent low mood, anhedonia, cognitive impairment, passive suicidal thoughts, and functional impairment. - Urgency level: Urgent, due to passive suicidal ideation and significant risk factors needing prompt safety assessment and intervention. - Differential considerations still requiring monitoring: Possible comorbid anxiety, substance use, or subthreshold psychotic features, but current evidence favors severe primary depression.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Pharmacotherapy with an antidepressant plus psychotherapy. - Supporting evidence: SSRIs or SNRIs have robust efficacy in severe depression; combination with psychotherapy improves outcomes. - Patient-specific considerations: Woman, tangential storyteller—may benefit from structured psychotherapy (e.g., CBT or IPT) for engagement. - Contraindications or cautions: Monitor for medication side effects, assess suicide risk closely, avoid alcohol or sedatives that may worsen depression.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Sertraline 50 mg once daily, titrate as tolerated. - Rationale for selection: Well-established efficacy, favorable side effect profile, and minimal weight gain. - Expected timeline for improvement: Some symptom relief in 2-4 weeks; full response typically in 6-8 weeks. - Key side effects to monitor: GI upset, insomnia or sedation, sexual dysfunction, initial increases in anxiety. - Alternative medications if first-line fails: Escitalopram, venlafaxine, or mirtazapine.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Initiate psychotherapy (CBT or IPT) as adjunct. - Patient education priorities: Explain depression nature, treatment rationale, importance of adherence, safety monitoring. - Lifestyle modifications: Encourage routine exercise, sleep regulation, balanced diet, and stress reduction techniques. - Behavioral interventions: Consider a referral to a mental health therapist; discuss safety planning and coping strategies.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Reassess in 2 weeks for medication tolerability and safety; then at 4 and 8 weeks. - Monitoring parameters: Symptom severity (using PHQ-9), risk of suicidality, medication side effects, functional status. - Red flag symptoms: Worsening suicidal thoughts, emergence of psychosis, significant increase in agitation or hopelessness requiring immediate care. - Treatment response assessment: Use standardized scales and patient report to gauge progress.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (tangential storyteller), how should I communicate this plan? - Communication approach: Present plan in simple, structured steps, using visual aids or written summaries. - Addressing patient concerns: Reassure about safety, clarify expectations, validate feelings. - Adherence strategies: Engage her in shared decision-making, set realistic goals, offer consistent support. - Family involvement: With patient consent, involve loved ones for support and safety monitoring.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Psychiatrist for medication management; ideally within 1-2 weeks. - Other healthcare team members: Psychotherapist, possibly social worker for social support. - Community resources: Support groups for depression, educational materials, crisis lines. - Insurance/cost considerations: Verify coverage for medication, therapy, and follow-up appointments; discuss financial concerns openly.\nANSWER: Based on the diagnosis of Severe Major Depressive Disorder, I recommend a comprehensive treatment approach that combines evidence-based pharmacotherapy with psychotherapy and safety planning, tailored to the patient's needs. Initiate an SSRI such as sertraline 50 mg daily, with close monitoring for side effects and efficacy. Concurrently, arrange psychotherapy (CBT or IPT) to enhance engagement and coping skills. Prioritize urgent follow-up within 2 weeks to monitor safety, medication tolerability, and symptom progression. Educate the patient about her illness, emphasizing the importance of adherence and safety measures, including safety planning for passive suicidal thoughts. Involve her family or support system with consent to assist in monitoring and providing emotional support. Coordinate with a psychiatrist for medication management and ensure access to community mental health resources. This integrated approach aims to reduce symptom severity, improve functioning, and mitigate suicide risk while maintaining safety and fostering ongoing recovery.",
    "gold_diagnosis": "Single episode depressive disorder, severe, without psychotic symptoms"
  }
]