[
  {
    "vignette_index": 35,
    "input": "Exertional Syncope END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary \nANSWER: Based on the diagnosis of exertional syncope secondary to confirmed polymorphic ventricular tachycardia, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate placement of a cardiovascular implantable defibrillator (ICD) to prevent sudden cardiac death, initiation of beta-blocker therapy for arrhythmia suppression, and lifestyle modifications to avoid triggers. Patient education on symptom recognition and medication adherence is emphasized, alongside careful monitoring of device function and arrhythmia recurrence through regular follow-up. Long-term management will focus on ongoing ICD surveillance, medication adjustments, and psychological support as needed. This approach aims to reduce mortality risk, improve quality of life, and ensure sustainable management while minimizing procedural and medication-related risks.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Arrange urgent consultation with an electrophysiologist for ICD implantation; start beta-blocker therapy after pre-procedure assessment.\n- Short-term goals (1-4 weeks): Complete ICD placement, optimize medical therapy, educate patient about warning signs and device use.\n- Long-term objectives (3-6 months): Monitor for arrhythmia recurrence, assess medication tolerance, and evaluate for any structural or inherited conditions.\n- Patient handout summary: Key points on arrhythmia risks, medication adherence, activity restrictions, signs warranting urgent care, and follow-up schedule.",
    "thinking": "Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary",
    "answer": "Based on the diagnosis of exertional syncope secondary to confirmed polymorphic ventricular tachycardia, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate placement of a cardiovascular implantable defibrillator (ICD) to prevent sudden cardiac death, initiation of beta-blocker therapy for arrhythmia suppression, and lifestyle modifications to avoid triggers. Patient education on symptom recognition and medication adherence is emphasized, alongside careful monitoring of device function and arrhythmia recurrence through regular follow-up. Long-term management will focus on ongoing ICD surveillance, medication adjustments, and psychological support as needed. This approach aims to reduce mortality risk, improve quality of life, and ensure sustainable management while minimizing procedural and medication-related risks.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Arrange urgent consultation with an electrophysiologist for ICD implantation; start beta-blocker therapy after pre-procedure assessment.\n- Short-term goals (1-4 weeks): Complete ICD placement, optimize medical therapy, educate patient about warning signs and device use.\n- Long-term objectives (3-6 months): Monitor for arrhythmia recurrence, assess medication tolerance, and evaluate for any structural or inherited conditions.\n- Patient handout summary: Key points on arrhythmia risks, medication adherence, activity restrictions, signs warranting urgent care, and follow-up schedule.",
    "gold_diagnosis": "Polymorphic ventricular tachycardia"
  }
]