[
  {
    "vignette_index": 98,
    "input": "Angiosarcoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: Very uncertain; the provided initial diagnosis is angiosarcoma, but the \"Gold Standard\" diagnosis listed as Merkel cell carcinoma conflicts with that. Given the lesion's characteristics (shiny, pinkish-purple, rapid growth), both are concerning, but the context suggests reevaluation is necessary. - Severity classification: Severe, as angiosarcoma is an aggressive malignancy with high metastatic potential. - Urgency level: Immediate, due to rapid lesion growth and high malignancy risk. - Differential considerations still requiring monitoring: Other cutaneous malignancies such as melanoma, Kaposi's sarcoma, or metastasis.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Wide surgical excision with clear margins; adjunct radiotherapy often recommended. - Supporting evidence: Surgical resection offers the best chance for local control; radiotherapy reduces recurrence, especially in high-grade lesions. - Patient-specific considerations: Age (68) may influence surgical risk; lesion location (arm) affects surgical planning. - Contraindications or cautions: Delay in definitive treatment increases metastasis risk; consider comorbidities.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Not first-line; systemic therapy considered if unresectable or metastatic disease. - Rationale for selection: Chemotherapy (e.g., paclitaxel) or targeted agents may be used but are adjuncts. - Expected timeline for improvement: Several weeks for systemic therapy response. - Key side effects to monitor: Myelosuppression, neuropathy, mucositis. - Alternative medications: Immunotherapy agents like pembrolizumab may be considered in advanced cases.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Wound care post-surgery; pain management if needed. - Patient education priorities: Nature of the disease, importance of early treatment. - Lifestyle modifications: Minimize UV exposure; skin monitoring. - Behavioral interventions: Support for coping with cancer diagnosis; referral to counseling if anxious.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Every 2-4 weeks initially, then every 3-6 months after definitive treatment. - Monitoring parameters: Wound healing, recurrence signs, regional lymph nodes, systemic symptoms. - Red flag symptoms: New or enlarging lesions, bleeding, systemic symptoms. - Treatment response assessment: Clinical examination; imaging as indicated.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Clear, empathetic explanation emphasizing urgency and treatment goals. - Addressing patient concerns: Worries about treatment risks, prognosis. - Adherence strategies: Regular follow-up, providing educational materials. - Family involvement: Encourage family support in decision-making and care.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Surgical oncologist or dermatologist with dermatologic oncology expertise, and possibly medical oncology. - Other healthcare team members: Nursing support for wound care, physiotherapy if needed. - Community resources: Support groups for skin cancer patients. - Insurance/cost considerations: Discuss coverage and assistance programs upfront.\nANSWER: Based on the diagnosis of angiosarcoma, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes urgent surgical excision with clear margins, followed by adjuvant radiotherapy to minimize recurrence risk. In cases where the tumor is unresectable or shows metastasis, systemic therapies such as immunotherapy (e.g., pembrolizumab) or chemotherapy (e.g., paclitaxel) should be considered. Additionally, diligent wound care, pain management, and close multidisciplinary follow-up are essential. Patient education should emphasize the aggressive nature of this malignancy, the importance of timely treatment, and skin monitoring practices. The plan aims to achieve local control, prevent metastasis, and support the patient’s psychological well-being while minimizing treatment-related risks. Immediate next steps include confirming diagnosis via biopsy, surgical consult, and initiating staging investigations. Short-term goals focus on lesion removal and recovery, with long-term surveillance for recurrence or metastasis over 3-6 months. A patient handout outlining the condition, treatment options, and follow-up schedule should be provided to ensure understanding and adherence.",
    "gold_diagnosis": "Merkel cell carcinoma"
  }
]