[
  {
    "vignette_index": 489,
    "input": "Placental Abruption END",
    "output": "THINKING: Use systematic reasoning to confirm diagnosis and determine severity. The patient presents with profuse vaginal bleeding, severe abdominal pain, weakness, shakiness, and recent decreased fetal movement, which are highly suggestive of placental abruption. Vital signs and physical exam are critical—even if not yet available—to assess hemodynamic stability and fetal status, thus classifying the severity as potentially severe due to the extent of bleeding and fetal compromise. Immediate intervention is warranted given the signs of maternal and fetal distress. Differential diagnoses such as uterine rupture should continue to be monitored.  In terms of treatment, the primary focus is on stabilizing the mother, evaluating fetal wellbeing, and preparing for delivery—typically cesarean section in such emergencies. Evidence supports rapid stabilization, corticosteroids if preterm, and transfer to a facility with obstetric surgical capabilities. Pharmacologic options include blood products for maternal stabilization, and antibiotics if infection risk is suspected. Non-pharmacological management centers on fluid resuscitation, continuous fetal monitoring, and readiness for emergency delivery.  Clear communication tailored to her baseline behavioral profile involves straightforward information, reassurance about urgent care, and involving her in decision-making. Coordination with obstetrics, anesthesiology, and neonatology teams is essential. Follow-up hinges on maternal and fetal stability post-intervention, with ongoing assessment and counseling.\nANSWER: Based on the diagnosis of placental abruption, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate stabilization of maternal vital signs with IV fluids and blood transfusions if necessary, rapid fetal assessment via continuous monitoring, and preparation for urgent delivery—most likely via cesarean section—to prevent maternal and fetal morbidity and mortality. Supportive care involves monitoring for signs of hemorrhagic shock and fetal distress, administering corticosteroids if preterm birth is anticipated, and ensuring multidisciplinary team involvement. Initial management focuses on stabilizing the mother and securing fetal wellbeing while arranging swift transfer to a facility equipped for obstetric emergency interventions. Follow-up care will include close maternal and fetal monitoring during the perioperative period, postpartum evaluation for ongoing bleeding or complications, and counseling regarding future pregnancy risks. This approach aims for prompt resolution of hemorrhage, stabilization of the mother, and optimal fetal outcomes while minimizing risks associated with hemorrhagic shock or delayed intervention.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Initiate IV access, begin fluid resuscitation, obtain maternal vital signs, prepare blood products if indicated, begin continuous fetal monitoring, notify obstetric and surgical teams, and arrange for urgent transfer if not already in a capable facility. - Short-term goals (1-4 weeks): Monitor maternal recovery post-delivery, assess for complications such as infection or coagulopathy, provide psychological support, and plan for follow-up obstetric care. - Long-term objectives (3-6 months): Ensure maternal recovery, monitor for any subsequent pregnancy risks, and provide counseling on future pregnancies. - Patient handout summary: - Placental abruption is a serious condition requiring urgent medical attention. - Immediate treatment involves stabilization and often emergency delivery to protect both mother and baby. - Expect close monitoring and support throughout hospitalization. - Follow-up care includes postpartum assessment and future pregnancy planning.",
    "gold_diagnosis": "Intrapartum haemorrhage resulting from obstructed labour with uterine rupture"
  }
]