[
  {
    "vignette_index": 729,
    "input": "Intraocular melanoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: The diagnosis was initially carcinoma in situ of the cornea, but the final diagnosis is intraocular melanoma, which suggests that further ophthalmologic assessment confirmed intraocular melanoma. Given the presentation described, suspicion is high, but definitive diagnosis requires ocular imaging and possibly biopsy. - Severity classification: The lesion's slow growth and visual disturbances suggest a moderate severity, but intraocular melanoma can be potentially life-threatening if metastasized, thus requiring urgent attention. - Urgency level: Urgent care is needed to confirm diagnosis and initiate management, given risk of metastasis. - Differential considerations still requiring monitoring: Other ocular tumors, inflammatory processes, or retinal detachment could mimic symptoms; ongoing assessment is essential.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Enucleation or radiotherapy (plaque brachytherapy) depending on tumor size and location. - Supporting evidence: Surgical removal (enucleation) is performed for large, unresectable tumors; brachytherapy is preferred for smaller tumors with eye preservation intent. - Patient-specific considerations: Her age and the risk of vision loss need balancing; absence of pain/redness suggests no immediate ocular inflammation. - Contraindications or cautions: Avoid biopsy if it risks tumor seeding; careful consideration before invasive procedures.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: While systemic medications are limited, adjunctive therapies may include. - Primary medication choice: Not typically primary; possibly systemic therapy if metastasis occurs (e.g., immunotherapy). - Rationale for selection: Focused local treatment first; systemic therapies considered upon metastasis. - Expected timeline for improvement: Post-local therapy, follow-up imaging to assess response occurs over months. - Key side effects to monitor: For radiotherapy or surgery, monitor for ocular inflammation, secondary glaucoma, or tissue necrosis. - Alternative medications if first-line fails: Systemic immunotherapy (e.g., checkpoint inhibitors) if metastasis develops.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions. - Primary non-drug interventions: Educate on tumor nature, importance of follow-up; vision rehabilitation if needed. - Patient education priorities: Risks of metastasis, signs of recurrence, need for regular ophthalmic exams. - Lifestyle modifications: Avoid smoking, maintain good overall health to improve outcomes. - Behavioral interventions: Stress management, emotional support for coping with diagnosis.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish proper follow-up care. - Follow-up timeline: Every 3 months initially for ocular assessments, imaging, and systemic workup. - Monitoring parameters: Tumor size, ocular symptoms, intraocular pressure, metastasis signs. - Red flag symptoms: New pain, sudden vision loss, floaters with pain, systemic symptoms like weight loss. - Treatment response assessment: Serial imaging (ultrasound, MRI), ocular exams.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (baseline), how should I communicate this plan? - Communication approach: Clear, straightforward, emphasizing the importance of follow-up and monitoring. - Addressing patient concerns: Anxiety about vision and metastasis; provide reassurance and support. - Adherence strategies: Simplify schedule, involve family, provide written info. - Family involvement: Encourage support, involve family in education and follow-up.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Oncology and ocular tumor specialist, ophthalmic oncologist within 1 week. - Other healthcare team members: Radiologists, possibly radiation oncologists. - Community resources: Support groups for ocular cancer, patient education materials. - Insurance/cost considerations: Verify coverage for imaging, surgery, radiotherapy; discuss costs upfront.\nANSWER: Based on the diagnosis of intraocular melanoma, I recommend a comprehensive treatment approach that combines evidence-based local tumor management with ongoing systemic monitoring and patient support. The initial focus should be on confirming the diagnosis with advanced ocular imaging (e.g., ultrasound biomicroscopy, MRI) and consulting an ocular oncology specialist promptly. Treatment options include plaque brachytherapy for small to medium-sized tumors or enucleation for large or unamenable lesions, with the goal of local tumor control and preservation of vision if possible.  In addition, systemic evaluation for metastasis (liver imaging and baseline labs) is essential, given the metastatic potential of intraocular melanoma. Adjunctive care involves patient education about the disease, prognosis, and signs to monitor, along with psychological support since emotional distress may be present. Follow-up will include regular ocular exams and imaging every 3 months initially, with adjustments based on disease progression or response.  This treatment plan aims to maximize local control, assess and address systemic risks, and support the patient emotionally and physically, minimizing risks of delayed intervention and optimizing quality of life.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange urgent ophthalmology consultation, schedule ocular imaging studies, and initiate discussion with oncology for systemic assessment. - Short-term goals (1-4 weeks): Confirm diagnosis histologically if biopsy is indicated, finalize local treatment planning, and establish a follow-up schedule. - Long-term objectives (3-6 months): Achieve local tumor control, reassess for metastasis, and provide ongoing support and education. - Patient handout summary: Explain intraocular melanoma, treatment options, importance of follow-up, and early signs of metastasis, emphasizing adherence and support resources.",
    "gold_diagnosis": "Carcinoma in situ of the cornea"
  }
]