[
  {
    "vignette_index": 1156,
    "input": "Colorectal cancer END",
    "output": "THINKING: Use systematic clinical reasoning to develop your plan. STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: The primary diagnosis of colorectal cancer is highly certain given her rectal bleeding, weight loss, and systemic symptoms. Severity appears moderate to severe due to ongoing symptoms, systemic signs, and concern about possible tumor progression. Urgency is urgent as colon cancer can be progressive and may require prompt intervention. Differential considerations include other causes of rectal bleeding such as hemorrhoids or anal fissures, but the systemic features push toward malignancy. STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: The first-line approach involves confirming diagnosis via colonoscopy with biopsy. Supportive therapies include nutritional support and symptom management. The ultimate goal is timely diagnosis to guide definitive treatment, typically surgery with possible adjuvant therapy depending on staging. STEP 3 - PHARMACOLOGICAL INTERVENTIONS: Pharmacologic management before definitive treatment may include analgesics and antiemetics as needed. Specific anti-cancer medications are usually initiated after staging, not prior. STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: Dietary modifications to support nutrition, stress management, and patient education on disease process are crucial. Psychological support is particularly important given her anxiety. STEP 5 - MONITORING & FOLLOW-UP STRATEGY: Prioritize prompt colonoscopy within days to weeks, with close follow-up on symptoms, nutritional status, and readiness for definitive therapy. Watch for worsening symptoms such as severe bleeding, obstruction, or perforation. STEP 6 - PATIENT COMMUNICATION STRATEGY: Given her anxiety, communicate clearly, empathetically, and with reassurance regarding the diagnostic process and next steps. Address fears, explain the purpose of procedures, and involve her in decision-making to enhance compliance. STEP 7 - COORDINATION & REFERRALS: Immediate referral to a gastroenterologist for colonoscopy, surgical oncology for definitive treatment planning, and psychological support services are essential. Coordination with multidisciplinary teams will optimize care.\nANSWER: Based on the diagnosis of colorectal cancer, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes prompt diagnostic colonoscopy with biopsy confirmation, followed by appropriate staging to guide definitive treatment, typically surgical resection with possible adjuvant therapy. Supportive care will involve nutritional assessment, symptom management, and psychological support to address her anxiety. Initial management prioritizes urgent diagnostic evaluation and symptom control, while long-term management focuses on surgical and oncological intervention, ongoing monitoring, and psychosocial support. Follow-up care will include close observation of symptoms, adherence to treatment, and addressing any emerging complications. This approach aims to optimize outcomes, minimize risks, and ensure informed patient engagement in her care.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange urgent colonoscopy and biopsy; provide supportive care for pain and nausea; reassure and educate the patient about upcoming evaluations. - Short-term goals (1-4 weeks): Complete diagnostic staging; initiate multidisciplinary treatment planning; provide psychological support; optimize nutritional status. - Long-term objectives (3-6 months): Complete definitive surgical treatment; assess for adjuvant therapy; monitor for recurrence or complications; provide ongoing psychosocial support. - Patient handout summary: Key points include importance of timely diagnosis, upcoming procedures, symptom management, and available support resources.",
    "gold_diagnosis": "Sarcoma, not elsewhere classified of retroperitoneum or peritoneum, unspecified"
  }
]