[
  {
    "vignette_index": 106,
    "input": "Adrenal androgen-secreting tumor END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High—based on imaging, biochemical testing, and clinical presentation supporting an adrenal cortical adenoma secreting androgens. - Severity classification: Moderate—significant hyperandrogenism signs with systemic symptoms like weight gain, oily skin, and mild fatigue, but no evidence of adrenal crisis or mass invasion. - Urgency level: Routine care needed—urgent intervention not required unless rapid symptom progression or adrenal crisis. - Differential considerations still requiring monitoring: Other causes of hyperandrogenism (e.g., ovarian tumors, exogenous androgen use), adrenal carcinoma, or pheochromocytoma if systemic symptoms develop.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Surgical removal of the adrenal tumor (adrenalectomy). - Supporting evidence: Surgical excision is the definitive treatment for adrenal cortical adenoma secreting excess androgens, normalizes hormone levels, and resolves clinical symptoms. - Patient-specific considerations: Given her age, symptom severity, and tumor size/characteristics, surgery is appropriate; her emotional distress warrants counseling. - Contraindications or cautions: Medical optimization if comorbidities increase surgical risk; assessment for possible adrenocortical carcinoma should be confirmed prior to surgery.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If surgery is delayed or contraindicated, pharmacologic therapy may be adjunctive. - Primary medication choice: Consider spironolactone or oral antiandrogens (e.g., flutamide) as temporizing agents; however, these are secondary to definitive surgery. - Rationale for selection: These medications reduce androgen effects and symptoms temporarily; spironolactone also helps with hyperandrogenism. - Expected timeline for improvement: Symptom improvement in 2-4 weeks with antiandrogens. - Key side effects to monitor: Electrolyte disturbances, liver function, hormonal side effects. - Alternative medications if first-line fails: Ketoconazole or metyrapone (for cortisol precursors), but less specific and with more side effects.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions. - Primary non-drug interventions: Educate on skin care, weight management, and stress reduction. - Patient education priorities: Nature of adrenal tumors, treatment options, and expectations. - Lifestyle modifications: Healthy diet, regular physical activity, sleep hygiene, and stress management techniques. - Behavioral interventions: Psychological support or counseling for body image concerns and emotional distress.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: Establish follow-up care. - Follow-up timeline: Re-evaluate in 2-4 weeks post-treatment initiation, especially if medication is used; post-surgical follow-up at 1 month and then periodically. - Monitoring parameters: Serum androgen levels, adrenal imaging as needed, assessment of symptom progression or resolution. - Red flag symptoms: Rapid tumor growth, new systemic symptoms, signs of adrenal crisis, severe pain, or signs of metastasis—immediate care required. - Treatment response assessment: Symptom resolution, normalization of androgen levels, and imaging as indicated.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given her baseline communication style, I will be empathetic and clear. - Communication approach: Use simple, compassionate language emphasizing that her symptoms are manageable and treatable with a clear plan. - Addressing patient concerns: Reassure about the effectiveness of treatment, acknowledge her distress, and involve her in decision-making. - Adherence strategies: Provide written summaries, schedule regular follow-ups, and reinforce the importance of medication compliance and lifestyle changes. - Family involvement: With her consent, involve family members to support her understanding and adherence.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Endocrinologist for hormonal management and adrenal tumor assessment; surgeon for evaluation and planning of adrenalectomy. - Other healthcare team members: Primary care provider for overall health, possibly a mental health professional for emotional support. - Community resources: Patient support groups for adrenal tumors and hyperandrogenism. - Insurance/cost considerations: Verify coverage for imaging, surgery, and medications; provide assistance with financial counseling if needed.\nANSWER: Based on the diagnosis of an adrenal androgen-secreting tumor, I recommend a comprehensive treatment approach that combines surgical intervention with supportive care strategies. The primary intervention is planned surgical removal of the adrenal adenoma via adrenalectomy, which offers definitive resolution of hormone excess and associated symptoms. Preoperative assessment will include detailed imaging, hormonal profiling, and evaluation of surgical candidacy. If surgery is not immediately feasible, pharmacological agents such as antiandrogens may be used to manage symptoms temporarily.  This approach includes patient education on her condition, lifestyle modifications to support her overall health, and emotional support to address distress. Follow-up will be scheduled at 2-4 weeks post-treatment initiation to monitor hormonal levels and symptom changes, with ongoing assessment for potential complications or recurrence. Clear instructions will be provided about warning signs requiring urgent medical attention.  Immediate actions today include scheduling surgical consultation, initiating preoperative assessments, and providing supportive counseling. Short-term goals within 1-4 weeks focus on completing diagnostic workup, optimizing her health status, and preparing for surgery. Long-term objectives involve regular monitoring for recurrence, managing residual symptoms, and supporting her psychological well-being to improve quality of life.  This integrated, patient-centered plan aims to normalize her hormonal milieu, resolve physical signs, and enhance her emotional health, while minimizing surgical and medication risks.",
    "gold_diagnosis": "Adrenal cortical adenoma, clear cell"
  }
]