[
  {
    "vignette_index": 58,
    "input": "Supraventricular Tachycardia (SVT) END",
    "output": "THINKING: STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: The primary diagnosis is supraventricular tachycardia (SVT), confirmed likely through ECG documentation during episodes or electrophysiological studies. The severity appears moderate given the recurrent episodes that cause symptomatic distress but are self-limited, with no current mention of hemodynamic instability. Urgency level is routine; however, if the patient experiences sustained episodes, syncope, or signs of instability, prompt evaluation is necessary. Differential considerations include polymorphic ventricular tachycardia, which is more dangerous and warrants immediate attention, but the clinical context suggests SVT is the main concern currently needing management.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: First-line treatment for SVT in adolescents includes vagal maneuvers for acute management; if unsuccessful or episodes are frequent, pharmacologic therapy (e.g., AV nodal blocking agents like adenosine) is indicated. Long-term management may involve catheter ablation if episodes are frequent, recurrent, or severely impairing. These guidelines are supported by evidence demonstrating high success rates and low complication risk for ablation in this age group. The patient's behavioral tendency to minimize symptoms underscores the need for thorough education and engagement in treatment.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: Initial pharmacologic intervention: Adenosine 6 mg IV rapid bolus, repeat every 1-2 minutes up to 12 mg if needed. This provides immediate termination of re-entrant SVT. If episodes recur or adenosine is contraindicated or ineffective, beta-blockers such as propranolol (e.g., 1 mg/kg/day divided BID) can be considered. Expect onset of effect within minutes with adenosine; beta-blockers may take days to weeks for full efficacy. Monitor for side effects like bradyarrhythmias, bronchospasm, or hypotension. Backup options include calcium channel blockers (e.g., verapamil) if beta-blockers are contraindicated or ineffective.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: Encourage recognition and avoidance of possible triggers (stress, caffeine, dehydration). Educate about vagal maneuvers (valsalva, carotid sinus massage) for acute episodes. Stress management techniques and reassurance to reduce anxiety. Emphasize regular sleep and hydration to minimize episodes. Consider referral to a behavioral therapist if anxiety exacerbates symptoms.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: Schedule follow-up within 2-4 weeks after starting medications or initial episodes to assess frequency, severity, and therapy tolerability. Regular ECGs and symptom diaries help monitor efficacy. Watch for signs of recurrent tachycardia, worsening symptoms, or adverse medication effects. Immediate care is warranted if the patient develops syncope, chest pain, or worsening symptoms. Response assessments include symptom resolution and decreased episode frequency.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's stoic minimizer style, approach explanations empathetically, emphasizing reassurance and validation of their experience. Use clear, simple language, and involve the patient in decision-making to foster trust. Address concerns about medication side effects openly, and stress the importance of reporting new symptoms. Reinforce that understanding and managing episodes will improve quality of life. Use written materials or visual aids to support understanding and adherence.  STEP 7 - COORDINATION & REFERRALS: Refer the patient to a pediatric electrophysiologist for potential catheter ablation evaluation, especially if episodes persist or increase despite medical therapy. Collaborate with primary care and possibly a mental health professional to address any anxiety or stress. Provide educational resources and connect with local support groups if applicable. Consider insurance coverage and costs for procedures early to ensure access.\nANSWER: Based on the diagnosis of supraventricular tachycardia (SVT), I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initial use of vagal maneuvers for acute episodes, followed by pharmacologic therapy with adenosine for immediate termination. If episodes recur frequently or are bothersome, initiation of beta-blockers such as propranolol will be considered for longer-term control. For patients with persistent or severe episodes, referral for electrophysiological evaluation and potential catheter ablation should be planned. Educating the patient on trigger avoidance, recognition of episodes, and vagal maneuvers is essential, along with reassurance and behavioral support to address emotional distress. Close follow-up within a few weeks will monitor treatment response, symptom frequency, and side effects, with ongoing assessment to optimize management. The goal is to reduce episode frequency and severity, improve quality of life, and prevent complications, while minimizing medication risks and ensuring sustainable, patient-coordinated care.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Perform vagal maneuvers during episodes if possible; prepare to administer adenosine if appropriate. - Short-term goals (1-4 weeks): Initiate appropriate medication, educate patient and family, and arrange follow-up. - Long-term objectives (3-6 months): Achieve symptom control, evaluate the need for ablation, and support psychological well-being. - Patient handout summary: Recognize SVT symptoms, use vagal maneuvers, follow prescribed medication regimen, attend scheduled follow-up, and seek urgent care if severe symptoms occur.",
    "gold_diagnosis": "Polymorphic ventricular tachycardia"
  }
]