[
  {
    "vignette_index": 912,
    "input": "Endogenous Cushing syndrome END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: High, given confirmatory adrenal cortical adenoma (glomerulosa cell) and classic clinical signs of Cushing syndrome. - Severity classification: Moderate to severe, as the patient exhibits significant physical and systemic symptoms, including hypertension, weight gain, skin changes, and emotional symptoms, indicating a substantial impact on health. - Urgency level: Urgent care needed due to elevated blood pressure, systemic effects, and potential cardiovascular risk. - Differential considerations still requiring monitoring: Other causes of hypercortisolism (e.g., ectopic ACTH), but imaging and lab results support endogenous Cushing's from adrenal adenoma.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Surgical removal of the adrenal adenoma (adrenalectomy). - Supporting evidence: Adrenalectomy is curative and recommended for unilateral adrenal adenomas secreting cortisol. - Patient-specific considerations: The patient's age, health status, and minimal emotional expression may influence perioperative management and support. - Contraindications or cautions: Be cautious with perioperative corticosteroid management to prevent adrenal insufficiency; evaluate cardiovascular risks pre-surgery.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Ketoconazole or metyrapone, to control cortisol levels pre-operatively if surgery is delayed or as adjunct. - Rationale for selection: Effective for cortisol suppression; ketoconazole has a well-established profile but requires liver function monitoring. - Expected timeline for improvement: Cortisol levels may decrease within days to weeks of medication initiation. - Key side effects to monitor: Liver function (for ketoconazole), hypertension, electrolyte disturbances, and GI symptoms. - Alternative medications if first-line fails: Mitotane or etomidate infusion in severe cases.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Dietary counseling for weight management, salt restriction, and blood pressure control. - Patient education priorities: Understanding the condition, importance of adherence, surgical options, and lifestyle modifications. - Lifestyle modifications: Regular physical activity, balanced diet, stress reduction strategies, adequate sleep. - Behavioral interventions: Referral to counseling or support groups for emotional health and stress management.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Reassess in 1-2 weeks post-intervention, then every 3-6 months. - Monitoring parameters: Serum cortisol, ACTH levels, blood pressure, weight, glucose, electrolytes, and signs of cortisol deficiency. - Red flag symptoms: Sudden worsening hypertension, severe headache, chest pain, signs of adrenal crisis. - Treatment response assessment: Symptom resolution, normalization of cortisol levels, blood pressure stabilization.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Use empathetic, clear language emphasizing the curative potential of surgery, validate concerns, and encourage openness. - Addressing patient concerns: Worry about surgical risks, recovery, and impact on lifestyle. - Adherence strategies: Establish trust, provide written materials, involve family support, and schedule regular follow-ups. - Family involvement: Engage family members in education and postoperative support if the patient consents.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Endocrinologist for pre-op management, surgeon for adrenalectomy. - Other healthcare team members: Anesthesiologist, primary care physician, mental health support if needed. - Community resources: Support groups for hormonal disorders, patient education materials. - Insurance/cost considerations: Verify coverage for surgery and medications; discuss financial planning with patient.\nANSWER: Based on the diagnosis of endogenous Cushing syndrome due to an adrenal cortical adenoma, I recommend a comprehensive treatment approach that combines evidence-based surgical management with appropriate pre- and post-operative care. The primary intervention is adrenalectomy, which offers the potential for cure. Prior to surgery, pharmacological agents such as ketoconazole or metyrapone may be used to control hypercortisolism and mitigate systemic effects. Concurrently, implement lifestyle modifications focusing on weight management, blood pressure control, healthy diet, exercise, and stress reduction. Pharmacological and surgical interventions will be complemented by patient education emphasizing disease understanding, adherence, and symptom monitoring. Close follow-up in 1-2 weeks post-intervention, then every 3-6 months, will be essential to assess treatment effectiveness and detect any complications. The overall goal is to restore hormonal balance, reduce cardiovascular and metabolic risks, and improve quality of life, while minimizing treatment-related side effects through careful monitoring and supportive care.",
    "gold_diagnosis": "Adrenal cortical adenoma, glomerulosa cell"
  }
]