[
  {
    "vignette_index": 728,
    "input": "Intraocular melanoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: Moderate to high; intraocular melanoma is a serious diagnosis suspected based on pigmented ocular lesion and progression. - Severity classification: Likely severe, given suspicion of intraocular melanoma which can threaten vision and metastasize if untreated. - Urgency level: Urgent, requiring prompt specialist evaluation due to risk of metastasis and potential for ocular destruction. - Differential considerations still requiring monitoring: Choroidal nevus, amelanotic melanoma, metastasis to eye, other pigmented lesions.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Enucleation or plaque radiotherapy for intraocular melanoma. - Supporting evidence: These are established treatments that can control local tumor growth and prevent metastasis. - Patient-specific considerations: Visual acuity, lesion location, patient preferences, overall health. - Contraindications or cautions: Prior ocular trauma, comorbidities affecting anesthesia or radiotherapy.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: No systemic drugs are primary; local treatments or surgery are mainstays. - Rationale for selection: Pharmacotherapy alone is insufficient; localized radiation or surgical removal is standard. - Expected timeline for improvement: Visual and tumor control outcomes over weeks to months post-treatment. - Key side effects to monitor: Radiation toxicity, surgical complications, vision loss. - Alternative medications if first-line fails: Systemic therapies generally not first-line; some experimental options include immunotherapy if metastasis occurs.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Protecting the eye from trauma, ensuring adequate follow-up. - Patient education priorities: Importance of treatment, recognizing symptoms of recurrence or complications. - Lifestyle modifications: Avoidance of ocular trauma, general health maintenance. - Behavioral interventions: Counseling on prognosis and emotional support.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Within 1-2 weeks post-intervention, then every 3 months initially. - Monitoring parameters: Tumor size via imaging, intraocular pressure, visual acuity, symptoms. - Red flag symptoms: Sudden vision loss, pain, new floaters, flashes, ocular redness, or swelling. - Treatment response assessment: Stability or reduction of tumor size, no new metastasis signs.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (chronology_confused), how should I communicate this plan? - Communication approach: Use simple, structured explanations with visual aids or written summaries. - Addressing patient concerns: Clarify the seriousness of the diagnosis, treatment options, and prognosis. - Adherence strategies: Reinforce follow-up importance, involve family or support persons. - Family involvement: Offer to include family in discussions for support and understanding.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Urgent referral to ocular oncologist or ophthalmic surgeon. - Other healthcare team members: Oncology, radiology, counseling services if needed. - Community resources: Connect with support groups for ocular cancer. - Insurance/cost considerations: Discuss coverage options and assist with scheduling.\nANSWER: Based on the diagnosis of intraocular melanoma, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes urgent referral for ocular oncology evaluation, likely surgical removal (enucleation) or plaque radiotherapy, and ongoing local surveillance. Initial management focuses on prompt specialist assessment to confirm diagnosis and determine treatment modality, followed by definitive therapy aimed at local tumor control and preventing metastasis. Follow-up care will include regular ocular imaging and clinical examinations at 1- to 3-month intervals, with patient education on symptom monitoring and importance of adherence. This approach is designed to maximize tumor control and preserve quality of life while minimizing risks such as vision loss or metastasis. Practical counseling with clear explanations, visual aids, and involving supportive family members will enhance adherence, especially given the patient's chronicity confusion. Coordination with ocular oncology, radiology, and supportive services is essential to ensure comprehensive care.",
    "gold_diagnosis": "Carcinoma in situ of the cornea"
  }
]