[
  {
    "vignette_index": 286,
    "input": "Substance-Induced Psychotic Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \n- Primary diagnosis confidence: High, based on recent substance use hist\nANSWER: Based on the diagnosis of Substance-Induced Psychotic Disorder (synthetic cathinone-induced), I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating antipsychotic medication such as risperidone for symptom stabilization, coupled with supportive environment and monitoring. Immediate management focuses on ensuring safety, reducing agitation, and controlling hallucinations. Long-term management should involve ongoing psychiatric follow-up, substance use counseling, and psychoeducation. Close monitoring of symptoms, side effects, and substance use is essential, with prompt re-evaluation if symptoms worsen. Engage the patient with clear communication, involve family if possible, and coordinate care with psychiatric and substance use specialists to support recovery. This plan aims to rapidly stabilize symptoms, prevent complications, and facilitate sustained abstinence, ultimately improving the patient’s mental health and safety.",
    "thinking": "Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \n- Primary diagnosis confidence: High, based on recent substance use hist",
    "answer": "Based on the diagnosis of Substance-Induced Psychotic Disorder (synthetic cathinone-induced), I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating antipsychotic medication such as risperidone for symptom stabilization, coupled with supportive environment and monitoring. Immediate management focuses on ensuring safety, reducing agitation, and controlling hallucinations. Long-term management should involve ongoing psychiatric follow-up, substance use counseling, and psychoeducation. Close monitoring of symptoms, side effects, and substance use is essential, with prompt re-evaluation if symptoms worsen. Engage the patient with clear communication, involve family if possible, and coordinate care with psychiatric and substance use specialists to support recovery. This plan aims to rapidly stabilize symptoms, prevent complications, and facilitate sustained abstinence, ultimately improving the patient’s mental health and safety.",
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  }
]