[
  {
    "vignette_index": 410,
    "input": "Panic Disorder with Substance-Induced Exacerbation END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \n- Primary diagnosis confidence: High; the patient's recent cannabis use \nANSWER: Based on the diagnosis of Panic Disorder with Substance-Induced Exacerbation, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating an SSRI (fluoxetine 10 mg daily) for anxiety management, coupled with psychoeducation about panic and substance use effects. Supportive behavioral therapy such as CBT should be prioritized, along with lifestyle modifications including stress reduction and abstinence from cannabis. Immediate management focuses on patient safety and symptom stabilization, while long-term strategies involve ongoing medication titration, psychotherapy, and substance counseling. Follow-up will occur within 1-2 weeks to assess medication tolerance and early response, with regular monitoring of symptoms, side effects, and substance use. Clear patient education emphasizes the importance of adherence, lifestyle changes, and avoiding triggers. Coordination with mental health specialists and support resources will enhance sustained recovery, aiming for symptom reduction, improved functioning, and prevention of recurrence.",
    "thinking": "Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \n- Primary diagnosis confidence: High; the patient's recent cannabis use",
    "answer": "Based on the diagnosis of Panic Disorder with Substance-Induced Exacerbation, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating an SSRI (fluoxetine 10 mg daily) for anxiety management, coupled with psychoeducation about panic and substance use effects. Supportive behavioral therapy such as CBT should be prioritized, along with lifestyle modifications including stress reduction and abstinence from cannabis. Immediate management focuses on patient safety and symptom stabilization, while long-term strategies involve ongoing medication titration, psychotherapy, and substance counseling. Follow-up will occur within 1-2 weeks to assess medication tolerance and early response, with regular monitoring of symptoms, side effects, and substance use. Clear patient education emphasizes the importance of adherence, lifestyle changes, and avoiding triggers. Coordination with mental health specialists and support resources will enhance sustained recovery, aiming for symptom reduction, improved functioning, and prevention of recurrence.",
    "gold_diagnosis": "Cannabis-induced anxiety disorder"
  }
]