[
  {
    "vignette_index": 766,
    "input": "Viral conjunctivitis END",
    "output": "THINKING: STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: I am confident in the diagnosis of viral conjunctivitis given the acute onset, eye redness, tearing, swelling, and recent activity. The severity appears mild to moderate, as symptoms are recent and not described as significantly impairing vision or causing pain beyond discomfort, and there's no mention of secondary complications. The urgency is routine care: no signs of vision loss, significant pain, or concern for secondary bacterial infection. Differential diagnoses to monitor include bacterial conjunctivitis (which might warrant antibiotics if symptoms worsen) and allergic conjunctivitis.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: First-line treatment involves supportive care with artificial tears to alleviate dryness and hyperemia, along with education on hygiene to prevent spread. Evidence supports conservative management because viral conjunctivitis is self-limited. Patient-specific factors include anxiety, making reassurance key. No contraindications to supportive care.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: Medications are generally not necessary unless symptoms worsen; if needed, lubricating drops are preferred. No antibiotics are indicated at this stage unless bacterial superinfection occurs. Monitoring for secondary bacterial infection (e.g., increased purulence) is essential.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: Recommend frequent handwashing, avoiding touching eyes, and not sharing towels or pillows. Educate the patient on the contagious nature and importance of hygiene. Stress the importance of avoiding contact sports until symptoms resolve. Sleep hygiene and stress management may help reduce anxiety.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: Follow-up in 3-5 days if symptoms persist or worsen. Advise immediate return if vision changes, severe pain, persistent purulent discharge, or increased redness. Regular assessment of symptom progression and signs of secondary infection will guide ongoing management.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the anxious nature, communicate with reassurance, emphasizing the viral origin and self-limited course. Use simple, clear language and validate concerns. Provide written instructions. Encourage questions and explain why antibiotics are unnecessary now. Reinforce hygiene practices and set expectations for recovery timeline.  STEP 7 - COORDINATION & REFERRALS: Referral to an ophthalmologist if symptoms persist beyond 7-10 days, worsen, or if complications arise. Engage the primary care team for ongoing support. Provide educational materials on conjunctivitis hygiene. Consider social support if anxiety impacts compliance.\nANSWER: Based on the diagnosis of viral conjunctivitis, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes supportive care with artificial tears and enhanced hygiene practices to reduce contagiousness, along with reassurance and education tailored to the patient's anxiety. Immediate management focuses on symptomatic relief and infection control, with follow-up scheduled within a few days to monitor progress. Long-term management ensures patient understanding of the benign course and prevention strategies. Follow-up care will include ongoing assessment of symptoms, vigilance for signs of bacterial superinfection or complications, and timely referral to ophthalmology if indicated. This approach aims to promote symptom resolution, prevent transmission, and address patient concerns effectively, minimizing unnecessary medication use and supporting recovery.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Educate the patient on hygiene, start artificial tears as needed, and reassure about the viral nature. Advise on protective measures and symptom monitoring. - Short-term goals (1-4 weeks): Symptom resolution, patient adherence to hygiene, and reduction of anxiety. Schedule follow-up for reassessment. - Long-term objectives (3-6 months): Prevent recurrence and ensure the patient understands contagiousness and hygiene practices. - Patient handout summary: Emphasize hygiene, symptom monitoring, when to seek urgent care, and reassurance about the self-limited nature.",
    "gold_diagnosis": "Leigh syndrome"
  }
]