[
  {
    "vignette_index": 3768,
    "input": "THINKING:\nDiagnosis: Progressive Supranuclear Palsy (PSP)\nJustification: The patient's presentation of vertical gaze palsy, especially difficulty looking up and down, along with slowed or abnormal eye movements (drifting, crossing, difficulty with smooth pursuit), is characteristic of PSP. Her gait instability, frequent falls, and axial rigidity further support this. The absence of autonomic symptoms like orthostatic hypotension or urinary incontinence reduces likelihood of other neurodegenerative conditions such as Parkinson's disease with autonomic failure. Cognitive impairment or changes in behavior are not prominently noted, consistent with early-to-moderate PSP. The combination of ocular motor abnormalities and gait disturbances aligns with the clinical diagnosis of PSP.\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nProgressive Supranuclear Palsy (PSP) END",
    "output": "THINKING: Progressive Supranuclear Palsy (PSP) is a neurodegenerative disorder characterized by ocular motor dysfunction, gait instability, and axial rigidity. Since there is no curative treatment available, management focuses on symptom relief and improving quality of life. Pharmacological options are limited but can include medications such as levodopa or amantadine, which may provide modest improvements in axial rigidity and parkinsonian features. Non-pharmacological approaches include physical therapy to address gait and balance issues, occupational therapy for assistance with daily activities, and speech therapy for dysarthria or swallowing difficulties. Educating the patient and caregivers about disease progression and safety precautions to prevent falls is also crucial. Given the progressive nature, multidisciplinary management aiming at symptomatic improvement and fall prevention is essential.\n\nANSWER: Initiate a multidisciplinary approach focusing on symptomatic management. Start with a trial of levodopa or amantadine to assess potential benefits in rigidity and functional mobility, closely monitoring for efficacy and side effects. Refer the patient to physical therapy to develop a tailored program aimed at improving gait stability and balance, including fall prevention strategies. Engage occupational therapy for assessments related to daily functioning and adaptive strategies. Consult speech therapy if any speech or swallowing difficulties emerge. Educate the patient and caregivers about the expected progression of PSP, emphasizing safety measures to prevent falls. Regular follow-up should be scheduled to reassess symptoms and adjust interventions as needed."
  }
]