[
  {
    "vignette_index": 741,
    "input": "Soft tissue sarcoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop a treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: Moderate to high certainty; soft tissue mass enlarging over two weeks with pain suggests a high suspicion of soft tissue sarcoma, but confirmation via biopsy is needed. - Severity classification: Moderate to severe; rapid growth, associated pain, and concern for malignancy indicate a potentially aggressive tumor requiring prompt assessment. - Urgency level: Urgent; suspicious for malignancy, so timely surgical evaluation and biopsy are warranted. - Differential considerations still requiring monitoring: Benign soft tissue tumors (e.g., lipoma, schwannoma), infection, or other neoplastic processes.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Surgical excision with appropriate margins, followed by histopathological diagnosis and staging. - Supporting evidence: Wide local excision is standard for soft tissue sarcomas to ensure complete removal; adjunct therapies depend on stage. - Patient-specific considerations: Anxiety may predispose to increased concern; precise communication vital. - Contraindications or cautions: Avoid biopsy delay; ensure imaging prior to definitive surgery for planning.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Not primarily medicinal at this stage; pain management may involve NSAIDs, but definitive treatment is surgical. - Rationale for selection: To control discomfort pre-operatively if needed. - Expected timeline for improvement: Relief within days with NSAIDs. - Key side effects to monitor: Gastrointestinal irritation; monitor renal function. - Alternative medications if first-line fails: Acetaminophen or opioids if NSAIDs contraindicated or insufficient.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions. - Primary non-drug interventions: Avoid pressure or trauma to the lesion; activity modification to prevent discomfort. - Patient education priorities: Understanding the benign vs. malignant importance; importance of timely diagnosis. - Lifestyle modifications: Maintain normal activity levels unless contraindicated post-surgery. - Behavioral interventions: Address anxiety with reassurance; consider referral for counseling if anxiety impairs decision-making.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: Establish appropriate follow-up. - Follow-up timeline: Schedule biopsy results and surgical consultation within 1-2 weeks. - Monitoring parameters: Symptom progression, signs of hemorrhage, infection, or recurrence. - Red flag symptoms: Increasing pain, rapid growth, neurovascular compromise, systemic symptoms. - Treatment response assessment: Pathology report post-biopsy; post-surgical margins; presence of residual disease.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's anxious_amplifier profile. - Communication approach: Use clear, empathetic, and reassuring language; validate concerns. - Addressing patient concerns: Explain diagnosis, prognosis, and need for prompt evaluation. - Adherence strategies: Encourage questions; provide written information; involve family. - Family involvement: Involve trusted family members during discussions for support.  STEP 7 - COORDINATION & REFERRALS: Additional care coordination. - Specialist referrals needed: Surgical oncologist or sarcoma specialist within 1 week. - Other healthcare team members: Oncology teams if malignant confirmed; radiology, pathology. - Community resources: Support groups for sarcoma patients; educational materials. - Insurance/cost considerations: Discuss coverage for biopsy, imaging, surgical procedure; provide guidance on accessing financial assistance if needed.\nANSWER: Based on the diagnosis of soft tissue sarcoma, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes prompt surgical excision with appropriate margins, coordinated with definitive biopsy and imaging to confirm diagnosis and staging. Initial management focuses on scheduling a biopsy and surgical consultation within the next 1-2 weeks, using pain control as needed. Follow-up care will include pathology review, monitoring for signs of recurrence or complications, and supportive care. Clear communication with the patient emphasizing the importance of timely intervention and addressing anxiety is essential, as well as involving family if desired. This approach aims to achieve complete tumor removal, optimize outcomes, and maintain patient well-being while minimizing risks associated with delayed treatment.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange for urgent imaging (MRI or ultrasound) to characterize the lesion; schedule biopsy and surgical consultation. - Short-term goals (1-4 weeks): Complete biopsy and imaging; confirm diagnosis; proceed with definitive surgical excision. - Long-term objectives (3-6 months): Achieve clear surgical margins, histologically confirm diagnosis, monitor for recurrence, and plan adjunct treatments if indicated. - Patient handout summary: \"Your health team is working quickly to diagnose and treat your soft tissue tumor. You will have imaging and a biopsy soon, followed by surgical removal. We'll support your pain and anxiety throughout. Regular follow-up after treatment is essential for your recovery.\"",
    "gold_diagnosis": "Fibroblastic or myofibroblastic tumour of skin"
  }
]