[
  {
    "vignette_index": 922,
    "input": "Substance-Induced Psychotic Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High confidence, as symptoms align with stimulant-induced psychosis following recent substance use. - Severity classification: Moderate to severe, considering the presence of hallucinations, paranoia, agitation, and sleep disturbances impacting functional capacity. - Urgency level: Urgent care needed to ensure safety and facilitate symptom stabilization. - Differential considerations still requiring monitoring: Schizophrenia or other primary psychotic disorders, mood disorders with psychotic features, or medical causes like neurological or metabolic disturbances.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Discontinue any ongoing stimulant use, supportive care, and consider antipsychotic medication if symptoms are severe. - Supporting evidence: Antipsychotics are effective in managing stimulant-induced psychosis, especially with persistent or severe hallucinations and paranoia. - Patient-specific considerations: Given the hesitance and information_withholder behavior, clear explanation and reassurance are necessary; monitor for medication adherence. - Contraindications or cautions: Be vigilant about potential side effects of antipsychotics, especially metabolic effects, cardiac issues, or extrapyramidal symptoms.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Low-dose risperidone (e.g., 1 mg daily), titrated as needed. - Rationale for selection: Risperidone is effective for psychotic symptoms with a relatively favorable side effect profile. - Expected timeline for improvement: Symptoms may improve within days to a week with medication; some residual symptoms could persist longer. - Key side effects to monitor: Weight gain, extrapyramidal symptoms, sedation, metabolic changes; periodic assessment recommended. - Alternative medications if first-line fails: Olanzapine, quetiapine, or aripiprazole, based on side effect profile and patient tolerance.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Psychoeducation about substance use and psychosis, ensuring a safe environment. - Patient education priorities: Risks of substance use, importance of abstinence, and understanding of symptoms. - Lifestyle modifications: Encourage sleep hygiene, stress reduction, and abstinence from substances. - Behavioral interventions: Motivational interviewing to support substance cessation; consider referral to counseling or substance abuse programs.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Re-evaluate within 1 week to assess symptom progression and medication tolerance. - Monitoring parameters: Symptom severity, medication side effects, sleep patterns, substance use status. - Red flag symptoms: Worsening psychosis, suicidal ideation, rapid mood shifts, or emergent aggressive behavior—seek immediate care. - Treatment response assessment: Clinical interviews and standardized scales (e.g., Brief Psychiatric Rating Scale) to measure symptom improvement.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (information_withholder), how should I communicate this plan? - Communication approach: Use simple, concrete language; provide written information; be patient-centered and non-confrontational. - Addressing patient concerns: Validate distress, clarify that symptoms are understandable responses to substance use, and reassure about treatment goals. - Adherence strategies: Involve the patient in decision-making, emphasize the importance of follow-up, and consider involving a trusted family member if appropriate. - Family involvement: With consent, include family or support persons to reinforce understanding and adherence.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Psychiatry consultation for medication management and ongoing psychiatric assessment. - Other healthcare team members: Primary care provider for general health and substance use management, social services for support. - Community resources: Substance abuse counseling, mental health support groups, educational materials. - Insurance/cost considerations: Ensure medication coverage, facilitate access to outpatient services and follow-up appointments.\nANSWER: Based on the diagnosis of Substance-Induced Psychotic Disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes discontinuation of stimulant use, initiation of low-dose risperidone for psychotic symptoms, supportive psychoeducation, and lifestyle modifications aimed at abstinence and stabilization. Immediate management focuses on ensuring patient safety, symptom stabilization, and preventing escalation. Long-term management emphasizes substance cessation, mental health monitoring, and psychosocial support. Follow-up will be scheduled within one week to assess medication efficacy, side effects, and substance use status, with ongoing adjustments as needed.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Discontinue stimulant use, initiate risperidone 1 mg daily, provide psychoeducation, and arrange psychiatric consultation. - Short-term goals (1-4 weeks): Observe for symptom improvement, assess medication tolerability, and support abstinence from substances. - Long-term objectives (3-6 months): Achieve sustained remission of psychosis, maintain abstinence, and develop a relapse prevention plan. - Patient handout summary: Key points include the importance of medication adherence, substance abstinence, monitoring symptoms, and seeking help if symptoms worsen or side effects occur.",
    "gold_diagnosis": "Stimulant-induced delirium including amphetamines, methamphetamine or methcathinone"
  }
]