[
  {
    "vignette_index": 122,
    "input": "Inflammatory breast carcinoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment plan.  \nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \nLet me first confirm the diagnosis and assess severity/urgency.  \n- Primary\nANSWER: Based on the diagnosis of inflammatory breast carcinoma, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating neoadjuvant chemotherapy (e.g., anthracycline and taxane-based regimens) to reduce tumor burden, followed by surgical intervention—typically a modified radical mastectomy—and subsequent radiation therapy. Supportive care measures will address skin integrity, nutrition, and psychological well-being. The plan emphasizes prompt monitoring through clinical assessments, imaging, and lab tests, with close follow-up during and after treatment. Patient education will focus on understanding the disease, managing side effects, and recognizing warning signs that require urgent attention. This multidisciplinary, aggressive strategy aims to optimize survival outcomes, control local and regional disease, and support her through this complex treatment journey.\n- Immediate actions (today): Confirm staging with imaging, arrange referral to oncology and surgery teams, initiate discussion about chemotherapy options.\n- Short-term goals (1-4 weeks): Start neoadjuvant chemotherapy, monitor for side effects and response, prepare for definitive surgery.\n- Long-term objectives (3-6 months): Complete primary treatment, evaluate for additional adjuvant therapies, and establish ongoing surveillance.\n- Patient handout summary: Clear, written overview of diagnosis, treatment steps, side effect management, and when to seek urgent care.",
    "thinking": "Use systematic clinical reasoning to develop your treatment plan.  \nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \nLet me first confirm the diagnosis and assess severity/urgency.  \n- Primary",
    "answer": "Based on the diagnosis of inflammatory breast carcinoma, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating neoadjuvant chemotherapy (e.g., anthracycline and taxane-based regimens) to reduce tumor burden, followed by surgical intervention—typically a modified radical mastectomy—and subsequent radiation therapy. Supportive care measures will address skin integrity, nutrition, and psychological well-being. The plan emphasizes prompt monitoring through clinical assessments, imaging, and lab tests, with close follow-up during and after treatment. Patient education will focus on understanding the disease, managing side effects, and recognizing warning signs that require urgent attention. This multidisciplinary, aggressive strategy aims to optimize survival outcomes, control local and regional disease, and support her through this complex treatment journey.\n- Immediate actions (today): Confirm staging with imaging, arrange referral to oncology and surgery teams, initiate discussion about chemotherapy options.\n- Short-term goals (1-4 weeks): Start neoadjuvant chemotherapy, monitor for side effects and response, prepare for definitive surgery.\n- Long-term objectives (3-6 months): Complete primary treatment, evaluate for additional adjuvant therapies, and establish ongoing surveillance.\n- Patient handout summary: Clear, written overview of diagnosis, treatment steps, side effect management, and when to seek urgent care.",
    "gold_diagnosis": "Malignant neoplasm metastasis in axillary lymph nodes"
  }
]