[
  {
    "vignette_index": 533,
    "input": "Cutaneous squamous cell carcinoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop a treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: The lesion appears characteristic of cutaneous squamous cell carcinoma (cSCC) based on clinical features: ulceration, erythema, firm texture, rapid growth over three weeks, and bleeding. - Severity classification: Likely moderate to severe, considering rapid progression, ulceration, and bleeding, which suggest invasive disease. - Urgency level: Urgent; skin cancers like cSCC require prompt evaluation to prevent local invasion or metastasis. - Differential considerations still requiring monitoring: Other possibilities include basal cell carcinoma, melanoma, or infectious/inflammatory processes, but clinical suspicion remains high for cSCC.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Surgical excision with appropriate margins. - Supporting evidence: Surgical excision is the gold standard for localized cSCC with high cure rates (~95%) and allows histopathological assessment. - Patient-specific considerations: The patient’s lesion location, size, and histopathologic features (once confirmed) guide margin determination. - Contraindications or cautions: Avoiding incomplete excision to reduce recurrence risk; consider patient comorbidities affecting anesthesia.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Not primarily pharmacological; surgical excision is first-line. - Rationale for selection: Surgery provides the most definitive treatment and tissue diagnosis. - Expected timeline for improvement: Complete removal ideally within days to weeks; monitor wound healing. - Key side effects to monitor: Surgical site infection, bleeding, delayed wound healing. - Alternative medications if first-line fails: For unresectable tumors or high surgical risk, options include radiotherapy or topical agents (e.g., 5-FU, imiquimod), but these are secondary.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Wound care, sun protection, and lesion site hygiene. - Patient education priorities: Importance of early diagnosis, wound management, and sun avoidance. - Lifestyle modifications: Sun safety behaviors, smoking cessation if relevant. - Behavioral interventions: Address patient concerns about biopsy results and treatment options, provide reassurance.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Re-evaluate in 1-2 weeks post-surgery to assess wound healing. - Monitoring parameters: Wound status, signs of infection, lymphadenopathy, new skin lesions. - Red flag symptoms: Increased pain, bleeding, signs of infection, new or enlarging lymph nodes, or systemic symptoms. - Treatment response assessment: Complete wound healing, absence of residual or recurrent tumor.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Use clear, straightforward language; provide written summaries; be empathetic and listen carefully. - Addressing patient concerns: Explain diagnosis, treatment rationale, and prognosis in simple terms; alleviate fears about cancer spread. - Adherence strategies: Emphasize follow-up importance, wound care instructions, and sun protection. - Family involvement: Encourage patient to involve trusted family members for support and assistance with post-operative care.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Dermatologic surgeon or surgical oncologist within 1-2 weeks. - Other healthcare team members: Wound care nurse, primary care provider. - Community resources: Patient education materials, skin cancer support groups if desired. - Insurance/cost considerations: Discuss coverage for surgical procedures and follow-up; consider financial counseling if needed.\nANSWER: Based on the diagnosis of cutaneous squamous cell carcinoma, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes urgent surgical excision with clear margins as the primary intervention, supported by appropriate wound care and patient education. Initial management focuses on prompt removal of the lesion to prevent further invasion, followed by close monitoring of wound healing and potential recurrence. Follow-up care will include re-evaluation within 1-2 weeks post-surgery, with ongoing surveillance for new lesions or signs of recurrence. Patient education will emphasize sun protection, wound management, and recognizing warning signs of complications. This approach is designed to achieve tumor clearance, minimize the risk of recurrence, and improve long-term outcomes while reducing potential surgical or wound-related side effects.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange urgent surgical consultation for lesion excision; provide wound care instructions. - Short-term goals (1-4 weeks): Complete surgical removal, ensure proper wound healing, and educate the patient on sun safety and follow-up. - Long-term objectives (3-6 months): Monitor for recurrence or new lesions; reinforce risk reduction strategies. - Patient handout summary: Clear explanation of diagnosis, treatment plan, importance of follow-up, wound care, and sun protection measures.",
    "gold_diagnosis": "Nodular melanoma"
  }
]