[
  {
    "vignette_index": 4169,
    "input": "THINKING:\nDiagnosis: Vestibular migraine\nJustification: The patient's symptoms of sudden-onset spinning sensations, persistent dizziness, difficulty focusing, balance issues, and visual disturbances are characteristic of vestibular migraines. The presence of dull, nagging headaches along with nausea and the episodes being triggered or worsened by movement and visual focus further supports this diagnosis. The episodes last a few minutes and are exacerbated by positional changes, which are typical features. Importantly, there are no reports of neurological deficits such as weakness outside of the episodes or confusion, making other neurological causes less likely. The absence of progressive neurological deficits, the episodic nature, and associated migraine-like features strongly suggest vestibular migraine.\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nVestibular migraine END",
    "output": "THINKING: The treatment for vestibular migraine focuses on reducing the frequency and severity of episodes through a combination of lifestyle modifications and medication management. Since symptoms are triggered or worsened by movement and visual stimuli, identifying and avoiding specific triggers is essential. Non-pharmacological strategies such as maintaining regular sleep patterns, staying well-hydrated, managing stress, and avoiding known triggers like certain foods or bright lights can be beneficial. Pharmacologically, prophylactic medications such as low-dose beta-blockers (e.g., propranolol), calcium channel blockers, or antiepileptic agents like topiramate may be effective in reducing the frequency of episodes. During acute episodes, symptomatic relief can be achieved with medications like triptans or vestibular suppressants such as meclizine or diazepam, though these should be used judiciously. The overall approach should be individualized, aiming to minimize medication side effects while effectively controlling symptoms.\n\nANSWER: The treatment plan for this vestibular migraine includes implementing non-pharmacological strategies such as maintaining a consistent sleep schedule, staying well-hydrated, engaging in stress management techniques, and avoiding known migraine and vestibular triggers like bright lights and certain foods. Pharmacologically, initiating a prophylactic agent such as propranolol or topiramate can help decrease episodic frequency, with careful monitoring for side effects. During acute episodes, symptomatic relief can be provided with vestibular suppressants like meclizine or, if appropriate, a triptan, especially if associated with headache features. Patients should also be advised to keep a symptom diary to identify individual triggers and respond promptly to early symptoms. Regular follow-up will be important to assess treatment effectiveness and make adjustments as needed."
  }
]