[
  {
    "vignette_index": 352,
    "input": "Postpartum hemorrhage END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \n- Primary diagnosis confidence: Highly confident; clinical presentation \nANSWER: Based on the diagnosis of postpartum hemorrhage, I recommend a comprehensive treatment approach that combines prompt physiological stabilization with specific medical management and patient-centered care strategies. The initial focus is on rapid fluid resuscitation with IV fluids, administration of uterotonics such as oxytocin, and close monitoring of hemodynamic stability. If bleeding continues, surgical consultation and possible intervention should follow. Throughout, clear communication and emotional support are essential, especially considering her worries and family involvement. Follow-up will include ongoing assessment of vital signs, bleeding, and lab values to ensure complete stabilization and recovery. This plan aims to minimize maternal morbidity, prevent shock, and support psychological well-being.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Establish IV access, begin fluid resuscitation, administer oxytocin infusion, and perform initial vital signs assessment.\n- Short-term goals (1-4 weeks): Achieve hemodynamic stability, control bleeding, and monitor for postpartum recovery complications.\n- Long-term objectives (3-6 months): Ensure physical and emotional recovery, provide postpartum counseling, and plan outpatient follow-up.\n- Patient handout summary: \"We are working quickly to stop your bleeding using medications and fluids. You will be monitored closely, and additional interventions are ready if needed. Keep us informed of any new symptoms, and rest as advised.\"",
    "thinking": "Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \n- Primary diagnosis confidence: Highly confident; clinical presentation",
    "answer": "Based on the diagnosis of postpartum hemorrhage, I recommend a comprehensive treatment approach that combines prompt physiological stabilization with specific medical management and patient-centered care strategies. The initial focus is on rapid fluid resuscitation with IV fluids, administration of uterotonics such as oxytocin, and close monitoring of hemodynamic stability. If bleeding continues, surgical consultation and possible intervention should follow. Throughout, clear communication and emotional support are essential, especially considering her worries and family involvement. Follow-up will include ongoing assessment of vital signs, bleeding, and lab values to ensure complete stabilization and recovery. This plan aims to minimize maternal morbidity, prevent shock, and support psychological well-being.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Establish IV access, begin fluid resuscitation, administer oxytocin infusion, and perform initial vital signs assessment.\n- Short-term goals (1-4 weeks): Achieve hemodynamic stability, control bleeding, and monitor for postpartum recovery complications.\n- Long-term objectives (3-6 months): Ensure physical and emotional recovery, provide postpartum counseling, and plan outpatient follow-up.\n- Patient handout summary: \"We are working quickly to stop your bleeding using medications and fluids. You will be monitored closely, and additional interventions are ready if needed. Keep us informed of any new symptoms, and rest as advised.\"",
    "gold_diagnosis": "Intrapartum haemorrhage resulting from obstructed labour with uterine rupture"
  }
]