[
  {
    "vignette_index": 57,
    "input": "Substance-Induced Psychosis (Methamphetamine-Related) END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary \nANSWER: Based on the diagnosis of Substance-Induced Psychosis (Methamphetamine-Related), I recommend a comprehensive treatment approach that combines supportive management, psychiatric intervention, substance use counseling, and patient-centered education. The initial focus should be on ensuring a safe environment, facilitating abstinence from methamphetamine, and using low-dose atypical antipsychotics such as risperidone to control symptoms. Close monitoring for side effects and symptom progression is essential, with follow-up in 1-2 weeks for ongoing assessment. The plan involves collaborating with psychiatric, addiction, and primary care teams, and engaging community resources to support long-term recovery. Education will emphasize the temporary nature of substance-induced psychosis, risks of ongoing drug use, and importance of adherence to treatment and abstinence measures. The ultimate goal is symptom resolution, substance cessation, and prevention of relapse, while safeguarding the patient's safety and well-being.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Complete initial assessment, start risperidone 1 mg daily if symptoms are severe, ensure a safe environment, and involve multidisciplinary team.\n- Short-term goals (1-4 weeks): Achieve symptom stabilization, confirm abstinence from methamphetamine, and initiate substance use counseling.\n- Long-term objectives (3-6 months): Maintain abstinence, prevent relapse, and monitor for any emerging primary psychotic disorders if symptoms persist beyond substance effects.\n- Patient handout summary: Key points include avoiding drug use, medication adherence, recognizing warning signs, and following up regularly with healthcare providers.",
    "thinking": "Use systematic clinical reasoning to develop your treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary",
    "answer": "Based on the diagnosis of Substance-Induced Psychosis (Methamphetamine-Related), I recommend a comprehensive treatment approach that combines supportive management, psychiatric intervention, substance use counseling, and patient-centered education. The initial focus should be on ensuring a safe environment, facilitating abstinence from methamphetamine, and using low-dose atypical antipsychotics such as risperidone to control symptoms. Close monitoring for side effects and symptom progression is essential, with follow-up in 1-2 weeks for ongoing assessment. The plan involves collaborating with psychiatric, addiction, and primary care teams, and engaging community resources to support long-term recovery. Education will emphasize the temporary nature of substance-induced psychosis, risks of ongoing drug use, and importance of adherence to treatment and abstinence measures. The ultimate goal is symptom resolution, substance cessation, and prevention of relapse, while safeguarding the patient's safety and well-being.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Complete initial assessment, start risperidone 1 mg daily if symptoms are severe, ensure a safe environment, and involve multidisciplinary team.\n- Short-term goals (1-4 weeks): Achieve symptom stabilization, confirm abstinence from methamphetamine, and initiate substance use counseling.\n- Long-term objectives (3-6 months): Maintain abstinence, prevent relapse, and monitor for any emerging primary psychotic disorders if symptoms persist beyond substance effects.\n- Patient handout summary: Key points include avoiding drug use, medication adherence, recognizing warning signs, and following up regularly with healthcare providers.",
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  }
]