[
  {
    "vignette_index": 58,
    "input": "Substance-Induced Psychotic Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment plan:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\n- Primary diagnosis confidence: High, given recent drug use and relevant sympt\nANSWER: Based on the diagnosis of Substance-Induced Psychotic Disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes supporting abstinence from substances through psychoeducation and supportive counseling, with close monitoring of symptoms. Pharmacological intervention is not initially indicated but will be considered if hallucinations persist or worsen. The focus will be on behavioral interventions, sleep hygiene, and motivational engagement to promote sobriety and recovery. Follow-up care should include regular reassessment of symptoms and substance use, with a low threshold for psychiatric referral if necessary. This approach aims to resolve current symptoms, prevent recurrence, and support long-term sobriety, while minimizing unnecessary medication exposure and side effects.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Facilitate patient understanding of the link between recent drug use and hallucinations; advise abstinence; monitor for worsening symptoms.\n- Short-term goals (1-4 weeks): Achieve abstinence, observe symptom resolution, and establish consistent follow-up.\n- Long-term objectives (3-6 months): Maintain sobriety, prevent recurrence of psychotic symptoms, and provide ongoing support for mental health and substance use.\n- Patient handout summary: Emphasize the importance of sobriety, explain that symptoms are likely due to recent drug use, and outline steps for support and follow-up.",
    "thinking": "Use systematic clinical reasoning to develop your treatment plan:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\n- Primary diagnosis confidence: High, given recent drug use and relevant sympt",
    "answer": "Based on the diagnosis of Substance-Induced Psychotic Disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes supporting abstinence from substances through psychoeducation and supportive counseling, with close monitoring of symptoms. Pharmacological intervention is not initially indicated but will be considered if hallucinations persist or worsen. The focus will be on behavioral interventions, sleep hygiene, and motivational engagement to promote sobriety and recovery. Follow-up care should include regular reassessment of symptoms and substance use, with a low threshold for psychiatric referral if necessary. This approach aims to resolve current symptoms, prevent recurrence, and support long-term sobriety, while minimizing unnecessary medication exposure and side effects.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Facilitate patient understanding of the link between recent drug use and hallucinations; advise abstinence; monitor for worsening symptoms.\n- Short-term goals (1-4 weeks): Achieve abstinence, observe symptom resolution, and establish consistent follow-up.\n- Long-term objectives (3-6 months): Maintain sobriety, prevent recurrence of psychotic symptoms, and provide ongoing support for mental health and substance use.\n- Patient handout summary: Emphasize the importance of sobriety, explain that symptoms are likely due to recent drug use, and outline steps for support and follow-up.",
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  }
]