[
  {
    "vignette_index": 745,
    "input": "Functional neurological disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: Moderate to high certainty, considering the presentation aligns with functional neurological disorder and the known familial pseudohyperkalaemia as a confounding factor. - Severity classification: Moderate, as she has significant muscle weakness and tremors affecting daily function, but no life-threatening features currently. - Urgency level: Routine care needed; no immediate danger indicated at present. - Differential considerations still requiring monitoring: Organic neurological causes (e.g., seizure activity, electrolyte imbalances), medication effects, or other psychogenic conditions.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Education, reassurance, and watchful waiting; possibly cognitive-behavioral therapy (CBT) if appropriate. - Supporting evidence: Strong evidence supports multidisciplinary approach emphasizing psychological support, symptom management, and education for FND. - Patient-specific considerations: Emotional distress and symptom magnification suggest psychological interventions may be beneficial. - Contraindications or cautions: Avoid unnecessary medications that may reinforce somatic focus; delay invasive procedures.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: None indicated solely for FND; pharmacotherapy reserved for comorbid conditions (e.g., anxiety or depression if present). - Rationale for selection: No specific drugs approved for FND; symptomatic medications may include low-dose antidepressants if mood or anxiety are contributing. - Expected timeline for improvement: Varies; psychological interventions often take weeks to months. - Key side effects to monitor: For antidepressants, monitor for gastrointestinal, sleep, or mood changes. - Alternative medications if first-line fails: Consider referral for specialized psychological therapy before adding pharmacotherapy.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Referral to behavioral therapy, specifically cognitive-behavioral therapy targeting symptom management and emotional regulation. - Patient education priorities: Explain that symptoms are real but are functional (not due to structural neurological damage); reassurance is key. - Lifestyle modifications: Encourage stress reduction techniques, regular sleep, and balanced activity. - Behavioral interventions: Facilitate functional movement retraining, avoid reinforcing illness behaviors.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Every 2-4 weeks initially to assess symptom progression and psychological well-being. - Monitoring parameters: Symptom severity, functional status, emotional health, and patient-reported stress. - Red flag symptoms: Sudden worsening, new neurological deficits, or signs of underlying medical illness. - Treatment response assessment: Improvement in function and reduction in symptom severity over time.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Use empathetic, validation-focused language emphasizing the legitimacy of her experience and the effectiveness of psychological interventions. - Addressing patient concerns: Reinforce that symptoms are real but manageable, and that psychological therapies are evidence-based. - Adherence strategies: Establish outpatient follow-up, involve the patient actively in planning, and normalize psychological treatment. - Family involvement: With patient consent, involve family members for support and understanding.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Neurology consultation to rule out organic causes, psychiatry or psychology for therapy. - Other healthcare team members: Physical therapists trained in FND, mental health professionals. - Community resources: FND support groups, patient education websites. - Insurance/cost considerations: Verify coverage for therapy and specialist visits; provide resources accordingly.\nANSWER: Based on the diagnosis of functional neurological disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes patient education emphasizing that symptoms are real but functional, referral to cognitive-behavioral therapy, and supportive symptom management. Initial management focuses on reassurance, psychological support, and functional rehabilitation while monitoring symptoms closely. Follow-up care will involve regular reassessment, symptom tracking, and adjustment of therapy as needed. This approach aims to improve her functional abilities, reduce distress, and promote long-term adaptation, while minimizing risks and fostering collaboration.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Provide empathetic explanation of the diagnosis, reassure her about prognosis, and coordinate first psychological therapy appointment. - Short-term goals (1-4 weeks): Initiate CBT, monitor symptom progression, and address any emerging concerns. - Long-term objectives (3-6 months): Achieve stabilization or improvement of symptoms, enhance coping strategies, and establish sustainable routines. - Patient handout summary: Explain FND as a real and treatable condition, outline therapy options, stress the importance of active participation, and provide contact information for support resources.",
    "gold_diagnosis": "Familial pseudohyperkalaemia"
  }
]