[
  {
    "vignette_index": 543,
    "input": "Choroidal melanoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: Moderate to high. The presentation with an enlarging intraocular pigmented lesion, visual disturbances, and eye ache suggests choroidal melanoma, especially given the concerning features and rapid growth. - Severity classification: Likely severe due to characteristic features of melanoma, which require prompt evaluation and management to prevent metastasis. - Urgency level: Urgent. Choroidal melanoma warrants prompt ophthalmologic and oncologic assessment to confirm diagnosis and plan definitive treatment. - Differential considerations still requiring monitoring: Other intraocular pigmented lesions such as choroidal nevus (less likely given enlargement), metastasis, or other melanocytic tumors.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Enucleation or plaque brachytherapy are standard treatments for confirmed choroidal melanoma, depending on tumor size and location. - Supporting evidence: These approaches aim for local control and potential survival benefit; plaque radiotherapy is often preferred for tumors amenable to eye-preserving therapy. - Patient-specific considerations: Patient's age, lesion size, visual acuity, and overall health will influence the choice. - Contraindications or cautions: Careful assessment to avoid radiation-induced damage to surrounding structures if radiotherapy is chosen; enucleation may be indicated for large or unsuitable tumors.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are necessary prior to definitive treatment, they include: - Primary medication choice: None specifically for tumor but control of symptoms—NSAIDs like ibuprofen for eye ache (dose as tolerated), corticosteroids if significant inflammation - Rationale for selection: Assist symptom relief while awaiting definitive intervention - Expected timeline for improvement: Within days for pain relief - Key side effects to monitor: Gastrointestinal discomfort, gastrointestinal bleeding, or corticosteroid side effects if used - Alternative medications if first-line fails: Analgesics or ocular-specific interventions as advised by ophthalmology  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions: - Primary non-drug interventions: Eye rest and protection; avoid activities risking ocular trauma. - Patient education priorities: Urgency of follow-up, seriousness of diagnosis, potential for metastasis, and importance of treatment. - Lifestyle modifications: Avoid smoking, maintain balanced nutrition to support overall health. - Behavioral interventions: Stress reduction techniques; counseling if emotional distress is evident.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: Establish follow-up care: - Follow-up timeline: Immediate ophthalmology consultation today; post-treatment follow-up at 1 week, then every 3 months for the first year. - Monitoring parameters: Tumor size via imaging, visual acuity, ocular symptoms, and detection of metastasis signs. - Red flag symptoms: Sudden vision loss, new floaters, eye pain worsening, or systemic symptoms like weight loss. - Treatment response assessment: Imaging, visual function, and physical exam findings.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's stoic minimizer personality: - Communication approach: Use clear, compassionate, and straightforward language; emphasize urgency and importance of follow-up without overwhelming. - Addressing patient concerns: Gently explore fears about treatment and prognosis; provide reassurance about the multidisciplinary approach. - Adherence strategies: Emphasize the importance of prompt treatment; involve family or support system if appropriate. - Family involvement: Encourage bringing a trusted person to appointments to support understanding and compliance.  STEP 7 - COORDINATION & REFERRALS: Additional care coordination: - Specialist referrals needed: Immediate referral to ophthalmic oncologist or ocular tumor specialist; possible consultation with ocular radiotherapy and oncology teams. - Other healthcare team members: Oncology, possibly a radiation oncologist; nursing support for education. - Community resources: Support groups for ocular melanoma; educational materials. - Insurance/cost considerations: Discuss coverage for treatments and imaging; arrange financial counseling if needed.\nANSWER: Based on the diagnosis of choroidal melanoma, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes urgent ophthalmologic evaluation with confirmatory imaging and biopsy if indicated, followed by definitive treatment with plaque brachytherapy or enucleation depending on tumor size and location. Symptom management with analgesics and anti-inflammatory agents can be employed temporarily. Emphasis is placed on patient education regarding the seriousness of the condition, the importance of timely intervention, and follow-up care. Regular monitoring with ocular imaging and systemic assessment for metastasis will be essential. This approach aims to achieve local tumor control, preserve vision if possible, and detect metastasis early, while addressing the patient's emotional needs through clear communication and support.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange urgent ophthalmology referral for detailed assessment and imaging. - Short-term goals (1-4 weeks): Complete diagnostic confirmation; initiate definitive treatment; provide symptom relief and patient education. - Long-term objectives (3-6 months): Achieve tumor control; monitor for metastasis; support visual and emotional recovery. - Patient handout summary: \"Urgent eye evaluation, treatment options available, importance of follow-up, and support resources.\"  STOP HERE.",
    "gold_diagnosis": "Melanoma of conjunctiva"
  }
]