[
  {
    "vignette_index": 107,
    "input": "Retinal tear or detachment END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach for retinal tear or detachment in this adolescent patient. First, confirm the diagnosis and understand the severity to determine urgency. The presentation of floaters, shadow phenomena, and flickering suggests retinal pathology. Since a retinal detachment can progress quickly and cause permanent vision loss, immediate ophthalmologic evaluation is critical. Management typically involves surgical intervention, but initial steps include confirming the diagnosis. Addressing systemic concerns may be secondary but still relevant given her overall health context. The patient's baseline behavioral profile indicates need for clear, compassionate communication. Follow-up must be prompt to prevent vision loss.\nANSWER: Based on the diagnosis of retinal tear or detachment, I recommend a comprehensive treatment approach that combines urgent ophthalmologic intervention with supportive care strategies. The treatment plan includes immediate specialist evaluation and surgical management, with careful attention to patient education, symptom monitoring, and systemic health considerations. Initial management focuses on rapid confirmation of diagnosis through ophthalmologic assessment and imaging, followed by appropriate surgical repair if confirmed. Long-term management involves regular follow-up to monitor for re-detachment or complications, along with instructions for prompt reporting of visual changes. This approach aims to preserve visual function while minimizing risks associated with delayed treatment.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange urgent ophthalmology consultation for dilated fundus examination and OCT imaging if available. - Short-term goals (1-4 weeks): Confirm diagnosis, perform surgical repair as indicated, and educate patient about symptom recognition and post-operative care. - Long-term objectives (3-6 months): Ensure retinal stability through scheduled follow-ups, monitor for recurrence, and support systemic health management. - Patient handout summary: Emphasize urgency of treatment, importance of follow-up visits, symptom vigilance, and avoidance of activities increasing intraocular pressure until cleared.  STOP HERE.",
    "gold_diagnosis": "Adrenal cortical adenoma, clear cell"
  }
]