[
  {
    "vignette_index": 6030,
    "input": "THINKING:\nDiagnosis: Polymyositis\nJustification: The patient exhibits proximal muscle weakness, persistent and more pronounced at rest, accompanied by muscle soreness and deep tenderness, which are characteristic features of inflammatory myopathies, particularly polymyositis. The presence of numbness and tingling suggests concurrent sensory involvement, which can occasionally be seen in polymyositis or overlapping syndromes. The absence of skin rashes, joint swelling, systemic symptoms like fever, or weight loss makes dermatomyositis less likely. The gradual progression over months without skin or systemic signs still aligns with polymyositis, especially given the chronicity and severity of muscle symptoms. Since the patient is not on medications known to cause myopathy, drug-induced causes are less likely.\n\nChecklist:\n- No diagnostic uncertainty remaining: Yes (sufficient clinical features support polymyositis)\n- No further clarification needed: Yes (clinical presentation is sufficiently detailed for diagnosis)\n\nANSWER:\nPolymyositis END",
    "output": "THINKING: Given the diagnosis of polymyositis, the primary goal is to reduce inflammation and preserve muscle strength while monitoring for potential complications. Since the patient presents with proximal muscle weakness, soreness, and tenderness, pharmacological therapy with corticosteroids remains the first-line treatment. Early initiation of immunosuppressive agents may be considered if corticosteroids are insufficient or contraindicated. Non-pharmacological measures such as physical therapy are essential to maintain muscle function, prevent contractures, and promote recovery. Additionally, assessing and addressing any associated symptoms or comorbidities, including nutrition and screening for potential interstitial lung disease or cardiac involvement, is important. Regular monitoring of muscle strength, enzyme levels (e.g., CK), and overall functional status will guide treatment adjustments.\n\nANSWER: The treatment plan should begin with initiating high-dose corticosteroids, such as prednisone at 1 mg/kg/day, to control inflammation. Concurrently, the patient should be referred to a physical or occupational therapist to develop a tailored exercise program aimed at maintaining muscle strength and function. Laboratory tests, including CK, liver function tests, and inflammatory markers, should be periodically monitored to assess response to therapy. If there is inadequate response or corticosteroids cause significant side effects, consider adding a steroid-sparing immunosuppressant such as methotrexate or azathioprine. The patient should also be advised on maintaining adequate nutrition and activity levels within tolerance, and be monitored for potential complications like pulmonary or cardiac involvement. Regular follow-up to adjust therapy based on clinical response and side effects is essential for optimal management."
  }
]