[
  {
    "vignette_index": 620,
    "input": "Social Anxiety Disorder with Panic Features END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High; presentation with classic social anxiety symptoms and panic features strongly supports this diagnosis. - Severity classification: Moderate to severe; due to the duration (2 years), the impact on social functioning, and the presence of panic symptoms which may be underreported but are significant. - Urgency level: Routine care needed; no immediate crisis noted, but ongoing assessment is important. - Differential considerations still requiring monitoring: Other anxiety disorders (e.g., panic disorder without social phobia), depression, or other somatic conditions like hyperthyroidism or cardiac issues should be monitored if symptoms evolve or worsen.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Cognitive-behavioral therapy (CBT) focusing on social skills and anxiety management, combined with selective serotonin reuptake inhibitors (SSRIs). - Supporting evidence: CBT has demonstrated efficacy in reducing social anxiety symptoms; SSRIs, such as paroxetine or sertraline, are backed by strong evidence for panic and social anxiety features. - Patient-specific considerations: The patient's underreporting suggests the need for a gentle, supportive approach while encouraging engagement in therapy and medication adherence. - Contraindications or cautions: Be cautious of medication side effects and ensure the patient understands side effect profiles; monitor for worsening depression or suicidality.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Sertraline, starting at 25 mg daily, titrated up to 50-100 mg over 4-6 weeks as tolerated. - Rationale for selection: Sertraline has a favorable side effect profile, evidence for treating social anxiety and panic symptoms, and is well-tolerated in young adults. - Expected timeline for improvement: Initial benefits may be seen within 4-6 weeks; full symptom relief may take up to 12 weeks. - Key side effects to monitor: Gastrointestinal symptoms, sleep disturbances, sexual dysfunction, and mood changes; encourage patient to report any worsening symptoms. - Alternative medications if first-line fails: Other SSRIs (e.g., paroxetine) or SNRI (venlafaxine), with consideration for augmentation or different approaches if needed.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Structured CBT focusing on exposure and cognitive restructuring; social skills training. - Patient education priorities: Explanation of anxiety mechanisms, treatment rationale, and importance of consistent therapy and medication. - Lifestyle modifications: Regular physical activity, proper sleep hygiene, and stress reduction practices like mindfulness or relaxation techniques. - Behavioral interventions: Exposure exercises gradually facing feared social situations; possibly referral to a cognitive-behavioral therapist specializing in anxiety disorders.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Reassess in 4 weeks to evaluate medication tolerability and early response; then every 6-8 weeks pending progress. - Monitoring parameters: Symptom severity (social anxiety and panic), medication side effects, mood symptoms. - Red flag symptoms: Suicidality, worsening depression, or emergent substance misuse; instruct patient to seek immediate care if these occur. - Treatment response assessment: Use validated scales (e.g., Liebowitz Social Anxiety Scale) during follow-up visits to quantify change.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (information_withholder), how should I communicate this plan? - Communication approach: Use straightforward, empathetic language; provide information in manageable segments; validate her feelings and concerns. - Addressing patient concerns: Reassure about the safety and efficacy of treatments; discuss potential side effects openly. - Adherence strategies: Emphasize the importance of consistent treatment, schedule regular follow-up, and involve the patient in decision-making. - Family involvement: With her consent, consider involving trusted family members or significant others to support adherence and understanding.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Consider referral to a mental health professional with expertise in anxiety disorders for CBT, ideally within 4-6 weeks. - Other healthcare team members: Collaboration with therapists, psychologists, or counselors; possibly a psychiatrist if medication adjustments are needed. - Community resources: Support groups for social anxiety and panic; educational material on anxiety management. - Insurance/cost considerations: Discuss medication costs, therapy coverage, and explore low-cost or community-based services as needed.\nANSWER: Based on the diagnosis of social anxiety disorder with panic features, I recommend a comprehensive treatment approach that combines evidence-based cognitive-behavioral therapy and pharmacotherapy with patient-centered strategies. The initial management emphasizes initiating sertraline 25 mg daily, titrated as tolerated, along with scheduling CBT focused on exposure and cognitive restructuring. This combination aims to reduce social avoidance, panic symptoms, and improve social functioning.  We will closely monitor her symptoms, medication side effects, and mood at follow-up visits scheduled at 4-week intervals. Education will focus on explaining her condition, treatment rationale, and the importance of adherence while respecting her tendency to withhold information. Coordination with mental health specialists for ongoing therapy and potential medication adjustments will be arranged. Support groups and community resources will be introduced to enhance social skills and reduce isolation.  Immediate actions today include discussing the treatment plan with her, addressing concerns about medication, and arranging follow-up and referral. Short-term goals involve medication titration and initial engagement in CBT within 4-6 weeks. Long-term objectives aim for sustained symptom remission, improved social interactions, and coping skills over 3-6 months.  This integrated approach is designed to optimize her recovery, minimize risks, and establish a foundation for long-term management.",
    "gold_diagnosis": "Social anxiety disorder"
  }
]