[
  {
    "vignette_index": 381,
    "input": "THINKING:\nDiagnosis: Ovarian Torsion\nJustification: The patient is a young woman presenting with sudden-onset, unilateral pelvic pain that worsens with movement, along with nausea and vomiting. These features are characteristic of ovarian torsion, which commonly occurs in reproductive-aged women and often presents with intermittent pain that can become severe. The absence of fever and the lack of signs pointing to infection or other causes make ovarian torsion a high priority differential. The recent sexual activity raises concern over ovarian cyst formation, which can predispose to torsion. Irregular menses may also suggest underlying ovarian cysts or functional ovarian issues contributing to the torsion risk. The symptom pattern and presentation strongly support this diagnosis.\n\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nOvarian Torsion END",
    "output": "THINKING: Ovarian torsion is a surgical emergency that requires prompt intervention to prevent ovarian necrosis and preserve ovarian function. The immediate priority is to confirm the diagnosis and facilitate timely surgical management, typically via laparoscopic detorsion. While imaging studies such as ultrasound with Doppler flow assessment are essential for confirmation, primary care physicians or psychiatrists may not be able to perform definitive diagnostics but can initiate initial steps. Pharmacological management primarily involves pain control to stabilize the patient. Non-pharmacological interventions include advising the patient to rest and avoid activities that might worsen symptoms. Given the urgency, the plan should include rapid referral to the emergency department or gynecology specialist for definitive diagnosis and management, including surgical intervention. Pain relief can be provided with appropriate analgesics such as NSAIDs or opioids if necessary, and antiemetics can be administered to manage nausea. It is crucial to educate the patient on the importance of urgent evaluation and not delay seeking specialized care.\n\nANSWER: The primary care or psychiatric clinician should prioritize immediate referral to the emergency department for urgent gynecologic evaluation, including pelvic ultrasound to assess ovarian blood flow. Initiate adequate pain management with NSAIDs or opioids as needed, along with antiemetics to control nausea. Advise the patient to rest and avoid activities that could exacerbate symptoms. Emphasize the urgency of seeking prompt surgical assessment to confirm diagnosis and proceed with necessary intervention (typically surgical detorsion). Close follow-up should be scheduled once the patient is stabilized, and further management will be determined by the gynecology team."
  }
]