[
  {
    "vignette_index": 451,
    "input": "Substance-Induced Psychotic Disorder (Hallucinogen/Psychostimulant-Induced) END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment plan:  \nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \n- Primary diagnosis confidence: High; based on recent synthetic cannabinoid\nANSWER: Based on the diagnosis of Synthetic cannabinoid-induced psychotic disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes starting a low-dose antipsychotic such as risperidone 1-2 mg daily (adjusted as needed) coupled with psychoeducation about the effects of synthetic cannabinoids, the importance of abstinence, and symptom expectations. Supportive counseling, including cognitive-behavioral therapy focusing on substance use and coping skills, should be initiated. The patient should be monitored regularly—initially every 1-2 weeks for symptom response and medication tolerance, then at progressively longer intervals. Family involvement can be beneficial once consented. Coordination with psychiatric services and community support groups will facilitate recovery and prevent relapse. Initial management focuses on symptom stabilization while emphasizing the importance of abstaining from psychoactive substances, with the goal of symptom resolution over the coming weeks to months. Follow-up will ensure medication effectiveness, monitor side effects, and support ongoing recovery efforts.",
    "thinking": "Use systematic clinical reasoning to develop your treatment plan:  \nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:  \n- Primary diagnosis confidence: High; based on recent synthetic cannabinoid",
    "answer": "Based on the diagnosis of Synthetic cannabinoid-induced psychotic disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes starting a low-dose antipsychotic such as risperidone 1-2 mg daily (adjusted as needed) coupled with psychoeducation about the effects of synthetic cannabinoids, the importance of abstinence, and symptom expectations. Supportive counseling, including cognitive-behavioral therapy focusing on substance use and coping skills, should be initiated. The patient should be monitored regularly—initially every 1-2 weeks for symptom response and medication tolerance, then at progressively longer intervals. Family involvement can be beneficial once consented. Coordination with psychiatric services and community support groups will facilitate recovery and prevent relapse. Initial management focuses on symptom stabilization while emphasizing the importance of abstaining from psychoactive substances, with the goal of symptom resolution over the coming weeks to months. Follow-up will ensure medication effectiveness, monitor side effects, and support ongoing recovery efforts.",
    "gold_diagnosis": "Synthetic cannabinoid-induced psychotic disorder"
  }
]