[
  {
    "vignette_index": 3023,
    "input": "THINKING:\nDiagnosis: Benign Paroxysmal Positional Vertigo (BPPV)\nJustification: The patient's symptoms of brief episodes of dizziness, imbalance, nausea, and involuntary eye movements triggered by rapid head movements, especially positional changes, are characteristic of BPPV. The episodes last approximately 10-15 minutes and are relieved by rest, which aligns with typical BPPV presentation. The presence of nystagmus during episodes further supports this diagnosis. Normal MRI findings and lack of other neurological deficits indicate a peripheral vestibular disorder rather than central pathology.\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nBenign Paroxysmal Positional Vertigo (BPPV) END",
    "output": "THINKING: BPPV is primarily managed with canalith repositioning maneuvers, which are highly effective and non-invasive, making them suitable for primary treatment by a primary care physician or psychiatrist with appropriate training or referral. These maneuvers, such as the Epley or Semont, aim to move displaced otoconia out of the semicircular canals back to the utricle where they no longer cause symptoms. Pharmacologic options are generally adjunctive and limited to symptomatic relief for severe nausea or vertigo, and should be used cautiously given their limited efficacy in resolving the underlying causation of BPPV. Since the diagnosis is confirmed and there are no contraindications, the first-line treatment involves patient education about benign and positional nature of the condition, followed by instruction on canalith repositioning maneuvers. Pharmacological therapy can be considered if symptoms are severe or persistent, with vestibular suppressants such as meclizine or promethazine used short-term.\n\nANSWER: The treatment plan includes performing Epley or Semont maneuvers to reposition the otoliths and eliminate vertigo episodes. The patient should be instructed on how to perform or where to receive these maneuvers, either in-office or through supervised instructions for self-administration if comfortable. To assist with immediate symptom relief, a short course of vestibular suppressants like meclizine can be considered, but only for a few days to prevent dependency. The patient should be advised to avoid rapid head movements during episodes, and provided with reassurance about the typically favorable prognosis. Follow-up should be scheduled to assess symptom resolution and consider additional sessions if needed."
  }
]