[
  {
    "vignette_index": 772,
    "input": "THINKING:\nDiagnosis: Hypothalamic Amenorrhea (functional hypothalamic amenorrhea)\nJustification: The patient presents with primary amenorrhea (absence of periods in someone attempting conception), feelings of fatigue and anxiety, pelvic sensations, and recent stress—all factors suggestive of hypothalamic suppression of the menstrual cycle. She reports no significant weight changes but mentions being less active and experiencing stress, both of which can impact hypothalamic function. The absence of menopausal symptoms like hot flashes, and no significant thyroid or other hormonal symptoms, further supports a functional hypothalamic cause. Baseline hormonal labs including TSH and free T4 will help rule out thyroid dysfunction, but the clinical picture is most consistent with hypothalamic amenorrhea due to stress or functional suppression.\n\nChecklist:\n- No diagnostic uncertainty remaining: No\n- No further clarification needed: Yes\n\nANSWER:\nHypothalamic Amenorrhea END",
    "output": "THINKING: Given the diagnosis of functional hypothalamic amenorrhea, the primary goals are to restore normal hypothalamic-pituitary-ovarian axis function and resume menstruation. Since the patient reports stress and reduced activity levels without significant weight loss, psychological stress reduction and lifestyle modifications are the first-line approaches. Increasing adequate caloric intake, reducing physical and emotional stress, and ensuring sufficient sleep can help alleviate hypothalamic suppression. Encouraging a balanced diet with appropriate nutrition and considering stress management techniques such as mindfulness or counseling may be beneficial. Pharmacological options are generally reserved for cases where lifestyle modifications are insufficient, but in this scenario, reinforcing behavioral changes is appropriate initially; hormonal therapy is not routinely recommended unless other causes are ruled out or if menstruation does not resume after lifestyle changes. Laboratory evaluation of thyroid function (TSH, free T4) and prolactin should be performed to exclude other causes. If after lifestyle modification there is no improvement in menstrual function over several months, a consultation with an endocrinologist may be warranted, possibly considering hormonal therapy such as low-dose combined oral contraceptives to regulate menses temporarily, but only after trying non-pharmacological measures.\n\nANSWER: The treatment plan involves educating the patient about hypothalamic amenorrhea and emphasizing the importance of stress reduction, adequate nutrition, and restoring a healthy activity level. Initiate lifestyle modifications by increasing caloric intake if appropriate, reducing intense physical activity, and incorporating stress management techniques such as counseling, mindfulness, or relaxation exercises. Reassure her that menstruation often resumes with these adjustments, and schedule follow-up in 3-6 months to assess menstrual status. Conduct baseline hormonal labs including TSH, free T4, prolactin, and androgens to exclude other causes. Consider a referral to a gynecologist or endocrinologist if menstruation does not resume or if symptoms persist. Pharmacological treatment with hormonal therapy is generally not first-line but may be considered later if lifestyle changes fail to restore menses, and in such cases, low-dose oral contraceptives could be used temporarily to regulate cycles."
  }
]