[
  {
    "vignette_index": 3035,
    "input": "THINKING:\nDiagnosis: Vestibular Migraine (Migraine-Associated Vestibulopathy)\nJustification: The patient's episodic vertigo lasting approximately 10-15 minutes, triggered or worsened by head movements and physical activity, aligns with migraine-related vertigo. The presence of migraine-like features such as throbbing or pressure sensations and sensitivity to light and sound further supports this diagnosis. Despite no formal migraine diagnosis, the history of similar symptoms and family history (mother with dizziness and clumsiness) point toward migraines as an underlying cause. The episodes are inconsistent with BPPV, which typically presents with positional triggers but often shorter and with specific movement-induced nystagmus. TIA is less likely given the patient's age, absence of stroke risk factors, and episodic duration. Seizures are less probable without stereotyped visual or speech episodes confirming ictal activity.\n\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nVestibular Migraine (Migraine-Associated Vestibulopathy) END",
    "output": "THINKING: Given the diagnosis of Vestibular Migraine, the primary goals are to reduce the frequency and severity of vertigo episodes and to manage underlying migraine symptoms. Non-pharmacological strategies such as lifestyle modifications—including identifying and avoiding potential triggers like stress, certain foods, and irregular sleep patterns—are essential. Patients should be advised on maintaining a regular sleep schedule, staying well-hydrated, and managing stress through relaxation techniques. Pharmacologically, prophylactic migraine medications such as low-dose amitriptyline, nortriptyline, propranolol, or topiramate can be considered to decrease the frequency of migraines and associated vertigo episodes. Acute management may involve triptans if migraines are also present, but these are not typically used solely for vertigo. Given the patient's presentation and family history, initiating prophylactic therapy with a medication like amitriptyline (starting at a low dose) alongside lifestyle modifications can be effective. Regular follow-up is recommended to assess response and adjust treatment as needed.\n\nANSWER: The treatment plan should include implementing lifestyle modifications such as maintaining regular sleep, hydration, and stress management to reduce triggers. Pharmacologically, initiation of a prophylactic migraine medication like low-dose amitriptyline (e.g., starting at 10-25 mg at bedtime), with close monitoring for effectiveness and side effects, should be considered. Patients should be educated about the nature of vestibular migraines and advised to avoid known triggers. If episodic symptoms persist or worsen, or if migraines become more frequent or severe, further medication adjustments or referrals to a specialist may be necessary. In addition, vestibular rehabilitation therapy can be considered if vertigo significantly affects daily function."
  }
]