[
  {
    "vignette_index": 713,
    "input": "Substance-Induced Psychotic Disorder (Stimulant-Induced Psychosis) END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: High confidence that the patient is experiencing substance-induced psychotic disorder related to recent methamphetamine use, given the temporal relationship of symptoms to drug use and absence of prior episodes. - Severity classification: Moderate—The presence of active hallucinations, delusions, paranoia, and cognitive disorganization indicate significant impairment, but the absence of immediate danger or self-harm suggests moderate severity. - Urgency level: Urgent care needed—The psychotic symptoms require prompt evaluation to ensure safety, address substance use, and initiate supportive treatment. - Differential considerations still requiring monitoring: Underlying primary psychotic disorders (e.g., schizophrenia), comorbid mood or anxiety disorders, and potential intoxication or withdrawal effects.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Abstinence from stimulants, psychoeducation, and symptomatic management. - Supporting evidence: Discontinuation or reduction of stimulant use is essential; antipsychotics can be used temporarily to control severe psychosis, especially when symptoms threaten safety. - Patient-specific considerations: Recent heavy methamphetamine use, potential underlying paranoid tendencies, baseline emotional instability, and the patient’s baseline functional status. - Contraindications or cautions: Avoid polypharmacy without clear indication; monitor for adverse effects of antipsychotics; consider the possibility of precipitating a primary psychotic disorder if symptoms persist after substance clearance.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Low-dose atypical antipsychotic, such as risperidone 1-2 mg daily or aripiprazole 5-10 mg daily, titrated as needed. - Rationale for selection: These agents have efficacy for stimulant-induced psychosis and a manageable side effect profile, and they are less likely to cause sedation or metabolic adverse effects. - Expected timeline for improvement: Symptoms often improve within days to weeks after detoxification; antipsychotics may be tapered as symptoms resolve. - Key side effects to monitor: Extrapyramidal symptoms, metabolic changes, sedation, andQT prolongation; baseline and periodic ECG and metabolic panels. - Alternative medications if first-line fails: Clozapine (reserved for refractory cases), or short-term benzodiazepines for agitation if necessary.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Psychoeducation about substance effects, the importance of abstinence, and relapse prevention. - Patient education priorities: Risks of stimulant use, recognition of early warning signs of relapse, and the nature of substance-induced psychosis. - Lifestyle modifications: Encouraging regular sleep, balanced nutrition, stress management, and avoidance of triggers. - Behavioral interventions: Motivational interviewing, cognitive-behavioral therapy (CBT) for substance use, and referral to outpatient addiction counseling.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Reassess in 1 week to evaluate symptom resolution and medication tolerance; then monthly until stabilization. - Monitoring parameters: Psychiatric status (hallucinations, delusions, paranoia), medication side effects, substance use status, and psychosocial functioning. - Red flag symptoms: Worsening psychosis, suicidal thoughts, self-harm, aggression, or signs of primary psychiatric disorder develop. - Treatment response assessment: Reduction in psychotic symptoms, improved insight, maintained abstinence from stimulants.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Use clear, non-judgmental language; validate concerns; emphasize that symptoms are temporary and treatable. - Addressing patient concerns: Reassure that treatment aims to improve functioning and safety; address fears of medication dependence. - Adherence strategies: Simplify medication regimen, involve patient in shared decision-making, and provide consistent follow-up. - Family involvement: With patient consent, include family members or support persons to reinforce treatment adherence and provide support.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Psychiatrist for medication management and ongoing psychiatric care. - Other healthcare team members: Substance use counselor, social worker for psychosocial support. - Community resources: Addiction recovery programs, mental health support groups, educational materials on substance use and mental health. - Insurance/cost considerations: Discuss coverage options for medications and counseling; provide low-cost or community-based resources as needed.\nANSWER: Based on the diagnosis of Substance-Induced Psychotic Disorder (Stimulant-Induced Psychosis), I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating a low-dose atypical antipsychotic such as risperidone or aripiprazole to control acute psychotic symptoms, coupled with immediate efforts to promote abstinence from methamphetamine and substance use counseling. Psychoeducation about the effects of stimulants, lifestyle modifications, and psychosocial interventions will support long-term recovery. Regular follow-up within one week to monitor response and side effects, with ongoing assessments every month to ensure symptom resolution and prevent relapse, are crucial. Communication will focus on validation, reassurance, and collaborative planning, with involvement of family if appropriate. Coordination with psychiatry, addiction services, and community resources will facilitate sustainable recovery. This integrated approach aims to resolve current symptoms, minimize risks, and support the patient’s functional stability over time.",
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with delusions"
  }
]