[
  {
    "vignette_index": 395,
    "input": "THINKING:\nDiagnosis: Major Depressive Disorder with somatic symptoms\nJustification: The patient's persistent fatigue, sense of overwhelm, feelings of being not herself, anxiety, and sleep disturbances are characteristic features of depression. The subjective abdominal sensations, especially as they worsen with stress and activity, may represent somatic manifestations commonly associated with depression or anxiety disorders. The absence of physical signs such as skin or thyroid abnormalities suggests a primary psychiatric etiology rather than an organic GI or endocrine disorder. The lack of significant weight change and absence of physical signs also diminish likelihood of purely physical illnesses; instead, mental health conditions should be strongly considered.\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nMajor Depressive Disorder with somatic symptoms END",
    "output": "THINKING: Given the diagnosis of Major Depressive Disorder with somatic symptoms, the treatment plan should address both the core depressive symptoms and the somatic manifestations. Non-pharmacological approaches such as cognitive-behavioral therapy (CBT) are beneficial for managing depressive thoughts, reducing anxiety, and improving coping skills, which can help mitigate stress-related somatic complaints. Pharmacologically, initiating an evidence-based antidepressant, such as an SSRI (e.g., sertraline or escitalopram), is appropriate for depression, as these have a favorable side effect profile and are effective in reducing mood symptoms and associated somatic complaints. Considering the patient's sleep disturbances, choosing an antidepressant with sedative properties, if appropriate, or addressing sleep issues separately with sleep hygiene strategies, can also be helpful. The plan should include close follow-up to monitor response and any side effects, and reinforce psychoeducation about depression and the importance of treatment adherence.\n\nANSWER: The treatment plan involves starting the patient on a selective serotonin reuptake inhibitor (such as sertraline or escitalopram) to target depressive symptoms, alongside recommending engaging in psychotherapy, particularly cognitive-behavioral therapy, to address cognitive and emotional aspects of depression and reduce somatic distress. Additionally, advise on sleep hygiene measures and stress management techniques. Schedule a follow-up appointment within 2-4 weeks to assess medication tolerability and initial response, with ongoing monitoring and support tailored to the patient’s progress."
  }
]