[
  {
    "vignette_index": 832,
    "input": "Major Depressive Disorder, Severe END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High, based on clinical presentation of persistent depressive symptoms, function impairment, passive suicidal ideation without plan. - Severity classification: Severe, because of significant functional impairment, passive suicidal ideation, and feelings of hopelessness. - Urgency level: Urgent care needed, given the severity, passive suicidal thoughts, and functional decline; immediate risk warrants prompt intervention. - Differential considerations still requiring monitoring: Monitor for active suicidal ideation, potential psychosis, or bipolar features.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Pharmacotherapy with an SSRI (e.g., sertraline) combined with psychotherapy, specifically cognitive-behavioral therapy (CBT). - Supporting evidence: SSRIs are first-line agents for severe depression; combined with psychotherapy shows superior outcomes. - Patient-specific considerations: Female adult with potential communication hesitancy, so clear explanations and supportive engagement are needed. - Contraindications or cautions: Monitor for medication side effects; assess for any contraindications like pregnancy or comorbid conditions.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Sertraline 50 mg once daily, titrate as tolerated. - Rationale for selection: Well-studied, tolerable SSRI with a favorable side-effect profile, safe in severe depression without psychosis. - Expected timeline for improvement: Noticeable benefits often begin within 2-4 weeks; full effects may take 6-8 weeks. - Key side effects to monitor: GI symptoms, sexual dysfunction, sleep disturbances, suicidal ideation escalation (especially early in treatment). - Alternative medications if first-line fails: Escitalopram, fluoxetine, or venlafaxine; consider augmentation with psychotherapy or other agents if partial response after 4-6 weeks.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Initiate weekly CBT sessions; encourage gradual activity resumption. - Patient education priorities: Inform about depression symptoms, expectations from treatment, importance of adherence. - Lifestyle modifications: Regular physical activity, sleep hygiene, balanced diet, stress reduction techniques. - Behavioral interventions: Behavioral activation strategies, social engagement encouragement.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Reassess in 2 weeks to monitor medication tolerance and early response; then every 4 weeks. - Monitoring parameters: Symptom severity (using depression scales), side effects, suicidal thoughts, functional status. - Red flag symptoms: Increased suicidal ideation, emergence of psychosis, worsening mood, or self-harm behaviors prompt immediate reassessment. - Treatment response assessment: Use standardized scales (e.g., PHQ-9), patient reports, and functional evaluation.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (information_withholder), how should I communicate this plan? - Communication approach: Use clear, simple language; allow time for questions; reassure that treatment is gradual and supportive. - Addressing patient concerns: Emphasize safety, confidentiality, and collaborative decision-making. - Adherence strategies: Schedule regular follow-ups; address potential side effects promptly; involve patient in goals. - Family involvement: If appropriate, involve family members with patient's consent to support adherence and safety.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Psychiatry consultation for medication management, particularly if comorbidities emerge or response is inadequate. - Other healthcare team members: Psychologist for CBT, primary care for overall health monitoring. - Community resources: Support groups for depression, educational materials from mental health organizations. - Insurance/cost considerations: Verify medication coverage, access to therapy, and consider sliding scale options if necessary.\nANSWER: Based on the diagnosis of Major Depressive Disorder, Severe, I recommend a comprehensive treatment approach that combines evidence-based pharmacotherapy with structured psychotherapy, specifically initiating sertraline 50 mg once daily alongside weekly cognitive-behavioral therapy. This plan addresses both immediate symptom relief and long-term functional recovery. The patient’s severity and passive suicidal thoughts necessitate urgent care, close monitoring, and safety planning.  Initial management includes starting medication today, educating the patient about treatment expectations and side effects, and engaging her in behavioral activation strategies. Follow-up should occur in 2 weeks to assess medication tolerability and early response, with ongoing evaluations every 4 weeks thereafter. Monitoring includes symptom severity scales, safety check-ins, and addressing any adverse effects.  Effective communication will involve straightforward explanations, reassurance, and collaborative goal setting to accommodate her tendency to withhold information. Family involvement will be considered per her comfort level to support adherence and safety. Coordination with psychiatric services and community resources will be integral to ensure comprehensive care.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Initiate sertraline 50 mg; schedule first follow-up in 2 weeks; provide psychoeducation and safety planning. - Short-term goals (1-4 weeks): Monitor for medication side effects, early symptom improvement, and safety; reinforce engagement in therapy and lifestyle modifications. - Long-term objectives (3-6 months): Achieve significant symptom reduction, improved functioning, and prevention of relapse through ongoing therapy, medication management, and support. - Patient handout summary: Include key points on medication use, warning signs, importance of therapy, lifestyle changes, and safety resources.",
    "gold_diagnosis": "Single episode depressive disorder, severe, without psychotic symptoms"
  }
]