[
  {
    "vignette_index": 156,
    "input": "Avoidant Personality Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop my treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\n- Primary diagnosis confidence: Moderate to high, given presentation of avoi\nANSWER: Based on the diagnosis of Avoidant Personality Disorder, I recommend a comprehensive treatment approach that combines evidence-based psychotherapy, pharmacotherapy, and supportive strategies tailored to the patient's behavioral presentation. The plan includes initiating cognitive-behavioral therapy focused on social skills, exposure, and cognitive restructuring, complemented by low-dose SSRI medication (e.g., sertraline 25-50 mg daily) to reduce social anxiety and improve mood. The patient should be engaged with gradual exposure and support in building trust and social confidence. Regular follow-up every 4-6 weeks will monitor symptom changes, medication tolerability, and engagement. Education will emphasize that progress is slow but achievable, with a focus on patience and consistency. Family involvement may be considered with consent, and referrals to specialized mental health providers will be arranged if needed. This integrated approach aims to improve social functioning and reduce avoidance behaviors over time, while minimizing adverse effects and promoting sustainable recovery.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Establish rapport, educate about avoidant personality traits and treatment expectations, and initiate the first therapy session plans.\n- Short-term goals (1-4 weeks): Initiate therapy and medication, start social engagement exercises, monitor side effects.\n- Long-term objectives (3-6 months): Achieve increased social participation, reduced avoidance, and improved mood and self-esteem.\n- Patient handout summary: Emphasize the importance of ongoing therapy, medication adherence, patience with the process, and strategies for gradual social exposure.",
    "thinking": "Use systematic clinical reasoning to develop my treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\n- Primary diagnosis confidence: Moderate to high, given presentation of avoi",
    "answer": "Based on the diagnosis of Avoidant Personality Disorder, I recommend a comprehensive treatment approach that combines evidence-based psychotherapy, pharmacotherapy, and supportive strategies tailored to the patient's behavioral presentation. The plan includes initiating cognitive-behavioral therapy focused on social skills, exposure, and cognitive restructuring, complemented by low-dose SSRI medication (e.g., sertraline 25-50 mg daily) to reduce social anxiety and improve mood. The patient should be engaged with gradual exposure and support in building trust and social confidence. Regular follow-up every 4-6 weeks will monitor symptom changes, medication tolerability, and engagement. Education will emphasize that progress is slow but achievable, with a focus on patience and consistency. Family involvement may be considered with consent, and referrals to specialized mental health providers will be arranged if needed. This integrated approach aims to improve social functioning and reduce avoidance behaviors over time, while minimizing adverse effects and promoting sustainable recovery.\nIMPLEMENTATION GUIDANCE:\n- Immediate actions (today): Establish rapport, educate about avoidant personality traits and treatment expectations, and initiate the first therapy session plans.\n- Short-term goals (1-4 weeks): Initiate therapy and medication, start social engagement exercises, monitor side effects.\n- Long-term objectives (3-6 months): Achieve increased social participation, reduced avoidance, and improved mood and self-esteem.\n- Patient handout summary: Emphasize the importance of ongoing therapy, medication adherence, patience with the process, and strategies for gradual social exposure.",
    "gold_diagnosis": "Frotteuristic disorder"
  }
]