[
  {
    "vignette_index": 197,
    "input": "Infectious Keratitis END",
    "output": "THINKING: Use systematic clinical reasoning to develop a treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: Moderate to high, given the presentation of acute eye redness, pain, photophobia, and visual disturbance consistent with infectious keratitis. - Severity classification: Likely moderate to severe, as symptoms are recent onset with rapid symptom progression and severe pain, indicating urgent intervention. - Urgency level: Immediate referral to ophthalmology is warranted due to the risk of corneal perforation and potential vision loss. - Differential considerations still requiring monitoring: Ulcer size, depth, presence of hypopyon, corneal melting, or perforation signs.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Empirical topical antimicrobial therapy targeting likely pathogens (bacterial keratitis) and urgent ophthalmological assessment. - Supporting evidence: Prompt antimicrobial therapy reduces tissue destruction and preserve vision. - Patient-specific considerations: Severity, possible contact lens history, autoimmunity, or trauma. Watch for allergy or intolerance to medications. - Contraindications or cautions: Avoid corticosteroids until infection is controlled; consider potential tissue toxicity.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Empirical broad-spectrum topical antibiotics, e.g., fortified cefazolin 5% and fortified tobramycin 1.3% eye drops, every 1 hour initially. - Rationale for selection: Broad coverage for common bacterial pathogens; fortified preparations provide high local concentrations. - Expected timeline for improvement: Signs of clinical improvement expected within 48–72 hours; however, therapy may continue for 7–14 days or as directed. - Key side effects to monitor: Allergic reactions, corneal toxicity, local irritation. - Alternative medications if first-line fails: Adjust based on culture results—consider fluoroquinolones (e.g., moxifloxacin) or antifungal agents if fungi are suspected.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Avoid contact lenses, minimize eye rubbing, keep the eye protected, and maintain good hygiene. - Patient education priorities: Importance of medication adherence, recognizing worsening symptoms, avoidance of scratching or touching the eye. - Lifestyle modifications: Rest eye as recommended, avoid contaminants, and use protective eye wear if relevant. - Behavioral interventions: Stress management if anxiety impairs compliance; consider counseling support if needed.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Reassess within 24–48 hours in an ophthalmology setting; then as advised by ophthalmology. - Monitoring parameters: Symptom progression, visual acuity, ulcer size, signs of infiltrate or perforation. - Red flag symptoms: Sudden worsening pain, vision decrease, new or enlarging perforation, hypopyon, or significant eye swelling. - Treatment response assessment: Clinical inspection of ulcer size, infiltrate resolution, symptom improvement.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Use clear, simple language acknowledging patient's concerns; provide written instructions. - Addressing patient concerns: Reassure about prompt, targeted therapy and importance of follow-up. - Adherence strategies: Emphasize the critical timing of medication administration; possibly involve family or caregivers. - Family involvement: Encourage family support in medication administration and symptom monitoring as appropriate.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Urgent ophthalmology consultation within 24 hours. - Other healthcare team members: Nursing staff for medication administration support and education. - Community resources: Provide educational materials on eye health and contact lens hygiene if relevant. - Insurance/cost considerations: Discuss medication affordability and possible assistance programs with support services if needed.\nANSWER: Based on the diagnosis of infectious keratitis, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate initiation of broad-spectrum topical antibiotics, such as fortified cefazolin and tobramycin eye drops, with urgent referral to ophthalmology for specialized assessment and possible hospitalization. Early management focuses on controlling infection to prevent tissue destruction and preserve vision, while establishing close follow-up to monitor response and detect complications. Patient education emphasizes medication adherence, recognizing worsening symptoms, and avoiding behaviors that worsen the condition. Follow-up involves reassessment within 24–48 hours and ongoing monitoring of clinical signs and symptoms, with prompt escalation if deterioration occurs. This approach aims to optimize outcomes, minimize risks of perforation or irreversible vision loss, and ensure sustainable long-term management of the condition.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Administer the first dose of fortified antibiotics, arrange urgent ophthalmology referral, educate the patient about symptoms to watch for, and ensure the patient understands the importance of follow-up. - Short-term goals (1-4 weeks): Achieve resolution of infection, prevent complications, and restore or preserve visual acuity. - Long-term objectives (3-6 months): Complete treatment, monitor for recurrences, and prevent residual visual impairment. - Patient handout summary: Emphasize adherence to prescribed eye drops, avoid contact lenses and eye rubbing, seek immediate care if symptoms worsen, and attend all follow-up appointments.",
    "gold_diagnosis": "Primary anterior uveitis"
  }
]