[
  {
    "vignette_index": 885,
    "input": "Subconjunctival hemorrhage END",
    "output": "THINKING: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: Given the description of redness, swelling, tearing after playing soccer, and the known presentation of subconjunctival hemorrhage, I am confident in this diagnosis, although I will consider trauma-related causes. - Severity classification: Typically, subconjunctival hemorrhages are mild unless accompanied by pain, vision changes, or signs of trauma. Since no mention of pain or vision issues, classify as mild. - Urgency level: Most subconjunctival hemorrhages are benign and self-limited; therefore, routine care is sufficient unless signs of deeper injury are present, so I consider urgency as routine. - Differential considerations still requiring monitoring: Watch for signs of globe rupture, hyphema, or orbital fracture if trauma is significant.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment: Reassurance and observation, as subconjunctival hemorrhages usually resolve spontaneously within 1-2 weeks. - Supporting evidence: Literature indicates no specific medical therapy accelerates resolution, and interventions like artificial tears help with comfort. - Patient-specific considerations: The patient has baseline health and no current ocular pathology, so conservative management is appropriate. - Contraindications or cautions: Avoid topical steroids or anticoagulants unless indicated; monitor for signs of progression or complications.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Artificial tears (e.g., preservative-free lubricating drops) applied as needed for ocular comfort. - Rationale: Enhances comfort, reduces irritation associated with tearing. - Expected timeline for improvement: Symptoms generally resolve within 1-2 weeks. - Key side effects: Minimal; monitor for allergy or irritation. - Alternative medications: None typically needed unless symptoms worsen.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Avoid rubbing the eye, protect the eye from further trauma, and rest. - Patient education priorities: Explain that the condition is benign, common after trauma, and typically resolves spontaneously. - Lifestyle modifications: No specific changes required; advise moderation in strenuous activities if concerned about recurrence. - Behavioral interventions: Not applicable unless trauma-related activity needs to be avoided temporarily.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Reassess in 1-2 weeks or sooner if symptoms worsen. - Monitoring parameters: Watch for increasing redness, pain, visual changes, or any signs of worsening injury. - Red flag symptoms: Severe pain, vision loss, persistent or increasing hemorrhage, or signs of globe rupture warrant immediate evaluation. - Treatment response assessment: Resolution of redness and swelling, no new symptoms.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Clearly explain that this is a common, benign condition that will resolve and that no aggressive medications are needed. - Addressing patient concerns: Reassure that no serious underlying disease is indicated unless symptoms change. - Adherence strategies: Encourage timely follow-up if symptoms persist or worsen; reinforce importance of avoiding eye trauma. - Family involvement: Not essential unless patient requests support, but informing family about signs needing urgent care can be helpful.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Not typically required unless complications or signs of other ocular trauma arise. - Other healthcare team members: Advise patient to see primary care provider if systemic symptoms occur or for routine follow-up. - Community resources: Provide eye safety education if injury was sports-related. - Insurance/cost considerations: Basic reassurance and minimal medication costs; ensure follow-up appointments are accessible.\nANSWER: Based on the diagnosis of subconjunctival hemorrhage, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes reassurance and observation, use of artificial tears for comfort, and avoidance of eye rubbing or trauma. Initial management focuses on educating the patient about the benign nature of the condition and setting expectations for spontaneous resolution within 1-2 weeks. Follow-up will be scheduled in 1-2 weeks to monitor healing, with instructions to seek immediate care if symptoms worsen, such as increasing pain, vision changes, or signs of trauma. This approach aims to ensure rapid symptom relief, prevent complications, and provide reassurance, all while minimizing unnecessary interventions.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Educate the patient about the diagnosis, recommend artificial tears, advise to avoid eye rubbing, and schedule follow-up. - Short-term goals (1-4 weeks): Achieve resolution of hemorrhage and comfort, monitor for signs of complications or worsening. - Long-term objectives (3-6 months): Ensure complete resolution; reinforce protective eye habits if trauma was involved. - Patient handout summary: Explain that subconjunctival hemorrhage is common, safe, and usually resolves on its own; advise on symptom monitoring and when to seek urgent care.",
    "gold_diagnosis": "Small cell carcinoma, NOS"
  }
]