[
  {
    "vignette_index": 4161,
    "input": "THINKING:\nDiagnosis: Meniere's disease\nJustification: The patient's symptoms of episodic vertigo triggered by head movements, tinnitus, imbalance, and aural fullness suggest inner ear involvement. Meniere's disease classically presents with episodic vertigo, tinnitus, a feeling of fullness in the ear, and fluctuating hearing loss. The worsening dizziness and balance issues with head position changes, along with associated auditory symptoms, support this diagnosis. Although she reports no recent infections, Meniere's can occur independently. The absence of neurological deficits like weakness or coordination problems makes central causes less likely.\n\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nMeniere's disease END",
    "output": "THINKING: The diagnosis of Meniere's disease, characterized by episodic vertigo, tinnitus, aural fullness, and imbalance, suggests an inner ear etiology involving endolymphatic fluid regulation. Management aims to reduce symptom frequency and severity, improve quality of life, and prevent disease progression. Non-pharmacologic measures such as dietary modifications—particularly reducing salt intake—to decrease endolymphatic fluid retention are foundational. Patient education about avoiding triggers like rapid head movements and managing stress may help diminish episodes. Pharmacologically, acute vertigo episodes can be controlled with vestibular suppressants such as meclizine or dimenhydrinate, while diuretics like low-dose betahistine (if available) can be employed for prophylactic prevention of attacks; however, be aware of regional availability and patient's tolerability. In some regions, betahistine is the first-line prophylactic medication. It’s also important to counsel the patient on gradual hearing loss, the potential need for audiology follow-up, and safety measures to prevent injury during vertigo episodes. Referral to an ENT specialist may be warranted if symptoms persist or worsen, or if alternative treatments are necessary.\n\nANSWER: Initiate a low-sodium diet (less than 2 grams per day) to help control endolymphatic fluid pressure. Educate the patient about avoiding caffeine, alcohol, and caffeine-containing foods, which can exacerbate symptoms. For acute vertigo attacks, prescribe vestibular suppressants such as meclizine or dimenhydrinate, taken as needed. Consider starting a trial of low-dose betahistine (e.g., 24 mg daily in divided doses) for prophylaxis if available, and monitor for effectiveness and side effects. Advise the patient on safety precautions during episodes, including avoiding driving or operating machinery. Schedule follow-up to assess symptom control, hearing status, and consider referral to ENT specialist if symptoms persist or worsen."
  }
]