[
  {
    "vignette_index": 383,
    "input": "Substance-Induced Psychotic Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High confidence based on recent synthetic cathinone use and clinical presentation consistent with substance-induced psychosis. - Severity classification: Moderate to severe, given the presence of persistent visual and auditory hallucinations, paranoid delusions, and significant distress, with some symptoms ongoing even without recent substance use, indicating potential persistence. - Urgency level: Urgent care needed due to ongoing hallucinations, paranoia, and distress, with risk of self-harm or harm to others if symptoms worsen. - Differential considerations still requiring monitoring: Primary psychotic disorders (e.g., schizophrenia), other substance-related causes, or medical conditions (e.g., neurological or metabolic causes).  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Supportive care with antipsychotic medication alongside substance cessation and psychoeducation. - Supporting evidence: Antipsychotics are effective in managing substance-induced psychosis, with most symptoms resolving within weeks after detoxification, but may be necessary if symptoms persist. - Patient-specific considerations: The patient's ongoing hallucinations, distress, and tangential communication suggest need for medication to improve insight and reduce symptoms. - Contraindications or cautions: Caution with medication side effects, especially metabolic syndrome, extrapyramidal symptoms, and interaction with ongoing substance use.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Risperidone 1 mg orally once daily, titrating up as tolerated. - Rationale for selection: Risperidone has a favorable efficacy profile and manageable side effects; it is commonly used for acute psychosis. - Expected timeline for improvement: Symptoms may begin to improve within 1-2 weeks; full stabilization may take 4-6 weeks. - Key side effects to monitor: Weight gain, extrapyramidal symptoms, sedation, metabolic changes; regular monitoring of metabolic parameters is suggested. - Alternative medications if first-line fails: Olanzapine, quetiapine, or aripiprazole.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Psychoeducation about substance use and psychosis; motivational interviewing for substance cessation. - Patient education priorities: Risks of synthetic cathinone use, potential for mental health deterioration, importance of adherence. - Lifestyle modifications: Establishing regular sleep patterns, avoiding illicit substances, stress management. - Behavioral interventions: Engagement with counseling or therapy (e.g., cognitive-behavioral therapy) for coping skills and relapse prevention.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Re-assessment in 1-2 weeks to monitor symptom progression and medication tolerability. - Monitoring parameters: Symptom severity, side effects, substance use status, safety (risk of self-harm). - Red flag symptoms: Worsening hallucinations, suicidal ideation, agitation, or violent behavior—prompt immediate evaluation. - Treatment response assessment: Use clinical scales for psychosis symptoms and substance use self-report.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (tangential_storyteller), how should I communicate this plan? - Communication approach: Use clear, simple language, emphasizing key points, and check for understanding; consider visual or written summaries. - Addressing patient concerns: Likely to worry about symptom persistence, medication side effects, and substance cravings; address these proactively. - Adherence strategies: Motivational interviewing, involving patient in decision-making, emphasizing benefits of treatment. - Family involvement: With consent, involve family or support persons to reinforce treatment plan and monitor safety.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Psychiatry consultation for medication management and ongoing psychiatric care. - Other healthcare team members: Support from social workers, therapists for substance use counseling. - Community resources: Substance use support groups, mental health education programs. - Insurance/cost considerations: Confirm coverage for medications and mental health services; explore assistance programs if needed.\nANSWER: Based on the diagnosis of Synthetic cathinone-induced psychotic disorder with delusions, I recommend a comprehensive treatment approach that combines evidence-based antipsychotic medication, substance cessation support, psychoeducation, and behavioral therapy. The key interventions include initiating risperidone 1 mg daily, closely monitoring symptom response and side effects, and providing psychoeducation regarding substance use and mental health. Supportive care with supervision for safety, together with motivational interviewing, aims to promote substance abstinence and symptom resolution. Regular follow-up within 1-2 weeks is essential to assess progress and adjust treatment as needed. Engaging family members or support persons (with patient consent) will enhance adherence and safety. Coordination with psychiatric and substance use specialists is critical for sustained recovery, along with connection to community resources. This plan seeks to reduce hallucinations and paranoia, promote recovery, and prevent relapse, while carefully managing medication side effects and addressing the patient's specific communication style to ensure understanding and engagement.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Conduct a detailed psychiatric assessment, assess for safety concerns, and initiate risperidone with patient education. - Short-term goals (1-4 weeks): Observe for improvement in hallucinations/delusions, ensure substance abstinence, and monitor medication tolerability. - Long-term objectives (3-6 months): Achieve sustained symptom remission, complete substance abstinence, and establish ongoing psychiatric care. - Patient handout summary: Include key points about medication purpose, importance of abstaining from substances, recognizing warning signs, and follow-up appointments.",
    "gold_diagnosis": "Synthetic cathinone-induced psychotic disorder with delusions"
  }
]