[
  {
    "vignette_index": 894,
    "input": "Structural brain lesion (likely neoplasm or hemorrhage) END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: High; clinical presentation with headache, visual disturbances, and seizure strongly suggest cerebral venous thrombosis. - Severity classification: Moderate to severe, given progression over days, seizure occurrence, and focal neurological symptoms. - Urgency level: Urgent; IV anticoagulation and neuroimaging are needed immediately to prevent progression or complications. - Differential considerations still requiring monitoring: Hemorrhagic transformation, increased intracranial pressure, other intracranial hemorrhages, or secondary neoplasm if imaging suggests.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Initiate anticoagulation therapy with low molecular weight heparin (LMWH). - Supporting evidence: LMWH is standard for cerebral venous thrombosis, reducing clot propagation and recurrence. - Patient-specific considerations: Ensure no contraindications such as active bleeding or high bleeding risk; recent seizure warrants control but not delay anticoagulation. - Contraindications or cautions: Bleeding, thrombocytopenia, or recent surgery.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: LMWH (e.g., enoxaparin 1 mg/kg subcutaneously every 12 hours). - Rationale for selection: Effective, predictable pharmacokinetics, easy to administer, lower monitoring requirements than IV heparin. - Expected timeline for improvement: Symptomatic relief in days; radiological resolution may take weeks. - Key side effects to monitor: Bleeding, heparin-induced thrombocytopenia (HIT); monitor platelets and signs of bleeding. - Alternative medications if first-line fails: Unfractionated heparin infusion or warfarin (after initial stabilization), considering bleeding risks.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Head elevation, neurological rest, and seizure precautions. - Patient education priorities: Recognize signs of worsening such as increased headache, new deficits, or bleeding. - Lifestyle modifications: Avoid activities increasing intracranial pressure; rest appropriately. - Behavioral interventions: Anxiety management to reduce symptom perception and aid recovery.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Reassess in 24-48 hours in hospital; outpatient follow-up in 1 week, then regularly. - Monitoring parameters: Neurological status, signs of bleeding, platelet counts, and repeat brain imaging as indicated. - Red flag symptoms: Sudden worsening of neurological status, new or ongoing bleeding, severe headache—seek immediate care. - Treatment response assessment: Symptom stabilization or improvement, radiological assessments showing clot resolution.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Clearly explain diagnosis, treatment rationale, and importance of adherence with empathetic, standard language. - Addressing patient concerns: Anxiety, bleeding fears, seizure management. - Adherence strategies: Involve patient in decision-making, provide written instructions, arrange support systems. - Family involvement: Educate family members about warning signs and support.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Neurologist for ongoing management; hematologist if underlying coagulopathy or thrombophilia suspected. - Other healthcare team members: Nursing staff for anticoagulation monitoring, physiotherapy if deficits develop. - Community resources: Support groups for neurological disorders, educational materials. - Insurance/cost considerations: Ensure medication affordability and coverage; arrange assistance if needed.\nANSWER: Based on the diagnosis of cerebral venous thrombosis, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating anticoagulation therapy with low molecular weight heparin to prevent clot extension and facilitate recanalization, while carefully monitoring for bleeding and neurological status. Short-term management involves seizure control with appropriate anticonvulsants, symptomatic relief, and supportive measures such as head elevation and activity modification. Long-term management will be guided by follow-up imaging, neurological assessment, and potential hematology consultation for underlying coagulopathy evaluation. Education about symptom recognition and adherence is crucial. Coordination with neurology and hematology specialists, along with regular follow-up, will optimize recovery and prevent recurrence. This approach aims to stabilize neurological function, reduce complications, and support the patient's return to baseline health.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Admit the patient for close neurological monitoring; start LMWH after ruling out contraindications; obtain urgent brain imaging to confirm extent and nature of thrombosis. - Short-term goals (1-4 weeks): Achieve clot stabilization, seizure control, and symptom relief; monitor for bleeding and adverse effects; initiate supportive care. - Long-term objectives (3-6 months): Transition to oral anticoagulation if indicated; assess for underlying causes; ensure full neurological recovery and stability. - Patient handout summary: \"Your diagnosis requires anticoagulation to prevent clot progression; monitor for bleeding; manage seizures as prescribed; attend all follow-up appointments; watch for worsening symptoms such as severe headache or new neurological deficits.\"",
    "gold_diagnosis": "Cerebral venous thrombosis"
  }
]