[
  {
    "vignette_index": 157,
    "input": "Paraphilic Disorder, NOS with impulsive featuresEND",
    "output": "THINKING: Use systematic clinical reasoning to develop a treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary dia\nANSWER: Based on the diagnosis of Paraphilic Disorder, NOS with impulsive features, I recommend a comprehensive treatment approach that combines evidence-based psychotherapy with pharmacotherapy as indicated, tailored to the patient's clinical presentation. Initiate cognitive-behavioral therapy focused on impulse control and relapse prevention, complemented by SSRIs such as fluoxetine 20 mg daily to help reduce urges. Regular follow-up should occur every 4-6 weeks to monitor symptom progression, side effects, and treatment adherence. Patient education will emphasize understanding the disorder, managing triggers, and the importance of ongoing therapy and medication compliance.\nImplementation guidelines include starting today with psychoeducation, establishing a therapy appointment with a psychologist or psychiatrist, and considering medication initiation pending psychiatric evaluation. Short-term goals involve initial engagement and symptom assessment within 4 weeks, while long-term objectives aim for sustained impulse control, reduced acting on urges, and improved quality of life over 3-6 months. Close monitoring for emergent risks or side effects is essential, with contingency plans for medication adjustments or intensified therapy if needed. Confidential, empathetic communication will foster trust and adherence, with potential family involvement only upon patient consent. Coordination with mental health specialists and accessibility to community resources will support ongoing management and risk mitigation.",
    "thinking": "Use systematic clinical reasoning to develop a treatment approach:\n\nSTEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT:\nLet me first confirm the diagnosis and assess severity/urgency.\n- Primary dia",
    "answer": "Based on the diagnosis of Paraphilic Disorder, NOS with impulsive features, I recommend a comprehensive treatment approach that combines evidence-based psychotherapy with pharmacotherapy as indicated, tailored to the patient's clinical presentation. Initiate cognitive-behavioral therapy focused on impulse control and relapse prevention, complemented by SSRIs such as fluoxetine 20 mg daily to help reduce urges. Regular follow-up should occur every 4-6 weeks to monitor symptom progression, side effects, and treatment adherence. Patient education will emphasize understanding the disorder, managing triggers, and the importance of ongoing therapy and medication compliance.\nImplementation guidelines include starting today with psychoeducation, establishing a therapy appointment with a psychologist or psychiatrist, and considering medication initiation pending psychiatric evaluation. Short-term goals involve initial engagement and symptom assessment within 4 weeks, while long-term objectives aim for sustained impulse control, reduced acting on urges, and improved quality of life over 3-6 months. Close monitoring for emergent risks or side effects is essential, with contingency plans for medication adjustments or intensified therapy if needed. Confidential, empathetic communication will foster trust and adherence, with potential family involvement only upon patient consent. Coordination with mental health specialists and accessibility to community resources will support ongoing management and risk mitigation.",
    "gold_diagnosis": "Frotteuristic disorder"
  }
]