[
  {
    "vignette_index": 153,
    "input": "Viral ConjunctivitisEND",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High certainty based on classic presentation with recent onset of redness, swelling, and tearing following contact or exposure. - Severity classification: Likely mild to moderate; symptoms involve superficial conjunctiva without visual impairment or significant pain. - Urgency level: Routine care needed; no signs of vision-threatening complications or systemic symptoms. - Differential considerations still requiring monitoring: Bacterial conjunctivitis (less likely given viral features), allergic conjunctivitis, and other ocular surface irritation.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Supportive care with artificial tears, cold compresses, and hygiene advice. - Supporting evidence: Viral conjunctivitis is self-limited; symptomatic relief improves comfort and reduces transmission risk. - Patient-specific considerations: Engagement in sports increases risk of spreading the virus; baseline behavioral stability suggests adherence can be optimized with clear instructions. - Contraindications or cautions: Avoid topical corticosteroids unless prescribed by specialist, due to potential prolongation of viral shedding.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Topical antibiotic eye drops (e.g., artificial tears with preservative-free lubricant); antibiotics only if bacterial superinfection suspected. - Rationale for selection: Viral conjunctivitis typically does not require antibiotics; supportive measures suffice. - Expected timeline for improvement: Symptoms usually resolve within 7-14 days; patient should observe improvement in redness and tearing within a few days. - Key side effects to monitor: Contact lens usage complications if applicable; advise against lens wear during infection. - Alternative medications if first-line fails: Consider gentle lubricants or referral if symptoms persist beyond 2 weeks.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Maintain good hygiene, avoid touching eyes, do not share towels or personal items. - Patient education priorities: Explain viral nature, contagiousness, and importance of hygiene to prevent spread. - Lifestyle modifications: Rest, avoid contact sports as needed, and use cold compresses for discomfort. - Behavioral interventions: Hand hygiene education, proper eyelid hygiene if necessary.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Reassess in 3-5 days if symptoms worsen or do not improve; otherwise, routine check-in in 1-2 weeks. - Monitoring parameters: Symptom persistence or worsening, visual changes, signs of secondary bacterial infection. - Red flag symptoms: Decreased vision, intense pain, photophobia, or eyelid swelling suggest need for urgent ophthalmology referral. - Treatment response assessment: Symptom resolution, reduction in redness, tearing, and swelling.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (baseline), how should I communicate this plan? - Communication approach: Clearly explain the benign nature of viral conjunctivitis and importance of hygiene. Use straightforward language, providing reassurance. - Addressing patient concerns: Address concerns about duration, contagiousness, and activity restrictions. - Adherence strategies: Simplify instructions, emphasize hygiene and symptom monitoring, schedule follow-up. - Family involvement: Educate family members about transmission precautions, especially if sharing living spaces.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Ophthalmology referral if symptoms worsen, vision changes, or no improvement after 2 weeks. - Other healthcare team members: None required immediately; primary care follow-up suffices. - Community resources: Provide educational materials on eye hygiene and viral infections. - Insurance/cost considerations: Ensure patient has access to prescribed supportive measures; advise on over-the-counter lubricants if affordable.\nANSWER: Based on the diagnosis of viral conjunctivitis, I recommend a comprehensive treatment approach that combines supportive care with patient education and monitoring. The key interventions include advising on excellent eye hygiene, cold compresses, and artificial tears to alleviate symptoms. I will instruct the patient on avoiding eye touching, sharing personal items, and contact lens use until resolution. The management focuses on symptom relief, preventing spread, and patient reassurance, while avoiding unnecessary antibiotics. Follow-up will be scheduled within 3-5 days to assess progress and identify any signs of worsening or secondary infection. This plan aims to promote symptomatic recovery, minimize transmission, and prevent complications, with careful attention to patient-specific factors such as engagement in sports and baseline behavioral stability.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Educate the patient on supportive measures, hygiene practices, and signs warranting return if symptoms worsen. - Short-term goals (1-4 weeks): Symptom resolution, prevention of transmission, and patient understanding of self-care. - Long-term objectives (3-6 months): Ensure complete recovery; monitor for possible recurrent episodes or complications. - Patient handout summary: Key points on hygiene, symptom monitoring, activity restrictions, and when to seek urgent care.",
    "gold_diagnosis": "Kleine-Levin syndrome"
  }
]