[
  {
    "vignette_index": 850,
    "input": "Acute angle-closure glaucoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment plan: STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: The presentation is highly suggestive of an acute angle-closure glaucoma (Glucomato-cyclitic crisis), characterized by sudden onset eye pain, redness, halos, and rapid symptom progression. While definitive confirmation requires intraocular pressure measurement and slit-lamp exam, the clinical picture is quite characteristic. - Severity classification: Severe, given the rapid onset, significant pain, visual disturbance, and risk of rapid visual loss. - Urgency level: Immediate intervention needed to prevent permanent optic nerve damage and vision loss. - Differential considerations still requiring monitoring: Other causes of red eye (e.g., uveitis, conjunctivitis), but these typically lack immediate IOP elevation.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Prompt reduction of intraocular pressure with medications, and definitive management via laser peripheral iridotomy. - Supporting evidence: Medical therapy to lower IOP is essential immediate step, followed by definitive procedure to prevent recurrence. - Patient-specific considerations: Rapid symptom onset necessitates urgent treatment, no contraindications noted. - Contraindications or cautions: Avoid medications that may exacerbate angle closure or have systemic side effects in certain patients.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Ocular timolol 0.5% drops, one drop every 12 hours; oral or IV acetazolamide 250 mg IV or orally (if available and no contraindications); topical pilocarpine 2% drops, 1-2 drops every 15 minutes up to 3 doses. - Rationale for selection: These reduce IOP rapidly. Acetazolamide decreases aqueous humor production; pilocarpine induces pupillary constriction to open angle. - Expected timeline for improvement: Notable IOP reduction within 1-2 hours. - Key side effects to monitor: Heart rate (timolol), systemic acidosis or electrolyte imbalance (acetazolamide), and miosis with pilocarpine. - Alternative medications if first-line fails: IV mannitol 20% solution, hyperosmotic agents.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Keep head elevated, avoid medications known to increase IOP, and ensure patient is in a calm environment. - Patient education priorities: Urgency of treatment, importance of adherence, and recognizing worsening symptoms. - Lifestyle modifications: Avoiding caffeine, managing systemic health, and stress reduction. - Behavioral interventions: None specific at this stage; focus on prompt treatment.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Reassess intraocular pressure and visual function within 24-48 hours after initial therapy. - Monitoring parameters: IOP measurements, visual acuity, slit-lamp examination, and symptom progression. - Red flag symptoms: Increasing pain, sudden visual deterioration, nausea, vomiting, or headache — seek immediate care. - Treatment response assessment: Decrease in IOP, symptom resolution, and preservation of visual acuity.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (baseline), how should I communicate this plan? - Communication approach: Clear, direct, emphasizing the urgency and importance of immediate treatment; provide reassurance and detailed explanation. - Addressing patient concerns: Explain potential side effects, prognosis, and necessity of follow-up. - Adherence strategies: Reinforce understanding through simple instructions, possibly involve family. - Family involvement: Educate family members to assist in monitoring symptoms and ensuring compliance.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Urgent referral to ophthalmology for definitive management, including laser iridotomy, ideally within 24-48 hours. - Other healthcare team members: Nursing staff for medication administration and monitoring. - Community resources: Patient education materials on glaucoma, support groups if applicable. - Insurance/cost considerations: Ensure patient has access to medications and understands potential costs; assist with pharmacy arrangements if needed.\nANSWER: Based on the diagnosis of acute angle-closure glaucoma (Glucomato-cyclitic crisis), I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes prompt administration of IOP-lowering medications—such as topical timolol, oral or IV acetazolamide, and pilocarpine—aimed at rapidly reducing intraocular pressure. An urgent referral to an ophthalmologist for definitive intervention, typically laser peripheral iridotomy, is essential to prevent recurrence and preserve vision. Initial management will focus on lowering IOP and alleviating symptoms while preparing for definitive care. Follow-up involves reassessment within 24-48 hours, monitoring symptom progression, visual acuity, and IOP, with clear instructions for the patient to seek immediate care if symptoms worsen. Patient education will emphasize the urgency, medication adherence, and recognizing warning signs. This approach aims to preserve visual function, minimize risks of permanent damage, and ensure long-term ocular health through collaborative care and timely specialist intervention.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Administer prescribed IOP-lowering medications, confirm diagnosis with slit-lamp exam and IOP measurement, and ensure urgent ophthalmology consultation. - Short-term goals (1-4 weeks): Achieve controlled IOP, undergo laser iridotomy, and address underlying risk factors. - Long-term objectives (3-6 months): Prevent recurrence, monitor for side effects, and educate on glaucoma management. - Patient handout summary: \"Emergency eye condition requiring urgent care. Follow medication instructions carefully, attend all follow-up appointments, and seek immediate help if vision worsens or symptoms return.\"",
    "gold_diagnosis": "Glaucomato-cyclitic crisis"
  }
]