[
  {
    "vignette_index": 137,
    "input": "Ectopic pregnancy END",
    "output": "THINKING: Use systematic clinical reasoning to develop a treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High certainty, as the presentation with pregnancy, severe abdominal pain, and vaginal bleeding is classic for ectopic pregnancy. - Severity classification: Severe, given the intensity of pain, vomiting, and worsening symptoms indicating possible rupture or hemoperitoneum. - Urgency level: Immediate, as ectopic pregnancy rupture can be life-threatening due to bleeding. - Differential considerations still requiring monitoring: threatened miscarriage, cervicitis, or other adnexal pathology, but high suspicion for rupture necessitates urgent intervention.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Emergency stabilization and surgical intervention if ruptured, or medical management with methotrexate if unruptured and patient stable. - Supporting evidence: Surgical removal (laparoscopy or laparotomy) is standard for ruptured ectopic pregnancy; methotrexate is effective for hemodynamically stable, unruptured cases. - Patient-specific considerations: Hemodynamic stability, desire for future fertility, and contraindications for methotrexate. - Contraindications or cautions: Hemodynamic instability, uncertain diagnosis needing immediate surgery, or contraindications to methotrexate (liver, renal disease, blood dyscrasias).  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If patient is stable and meets criteria: - Primary medication choice: Methotrexate 50 mg/m² IM as a single dose or multi-dose regimen per protocol. - Rationale for selection: Minimally invasive, preserves fertility, and has high success rate in stable, unruptured cases. - Expected timeline for improvement: β-hCG levels should decrease by at least 15% within 4-7 days. - Key side effects to monitor: Hepatotoxicity, stomatitis, gastrointestinal symptoms, blood counts. - Alternative medications if first-line fails: Repeated doses of methotrexate, or surgical intervention if no decline in β-hCG or clinical deterioration.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: IV fluids for hydration, pain management with appropriate analgesics, NPO until stabilization. - Patient education priorities: Warning signs of rupture, importance of immediate care if symptoms worsen. - Lifestyle modifications: Rest, avoid strenuous activity until stabilized. - Behavioral interventions: Anxiety management, reassurance, and clear communication about treatment plan.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Reassess in 24-48 hours, then weekly until β-hCG is non-detectable. - Monitoring parameters: Vital signs, abdominal exam, serial β-hCG levels, ultrasound as needed. - Red flag symptoms: Sudden worsening abdominal pain, dizziness, syncope, heavy bleeding. - Treatment response assessment: Sequential decline in β-hCG, resolution of symptoms, and ultrasound findings.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (information_withholder): - Communication approach: Use clear, straightforward language, provide written summaries, and verify understanding. - Addressing patient concerns: Emphasize safety, outline immediate steps, and reassure about monitoring. - Adherence strategies: Encourage questions, involve the patient in decision-making as appropriate. - Family involvement: With patient's consent, include family for support and information sharing.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Emergency/Gynecologic surgeon immediately for unstable or suspected rupture; obstetrician for follow-up. - Other healthcare team members: Nursing for care and education, social workers if additional support needed. - Community resources: Patient education materials, support groups for pregnancy complications. - Insurance/cost considerations: Discuss coverage for emergency, surgical, or medical management options, and ensure access to follow-up care.\nANSWER: Based on the diagnosis of ectopic pregnancy, I recommend a comprehensive treatment approach that combines urgent stabilization, potential surgical intervention or medical management with methotrexate, and careful ongoing monitoring. The immediate priority is to assess hemodynamic stability; if unstable or signs of rupture are present, proceed with emergency surgical management (laparoscopy or laparotomy). For stable patients meeting criteria, administer methotrexate while providing IV fluids, analgesics, and supportive care. Close follow-up with serial β-hCG testing and ultrasound is essential to confirm resolution. Patient education will focus on recognizing warning signs and understanding the treatment plan, with clear communication tailored to her information-withholder style. Coordination with gynecology specialists and emergency services is critical for optimal outcomes. This structured approach aims to prevent complications, preserve fertility when possible, and ensure patient safety throughout care.",
    "gold_diagnosis": "Diseases of the digestive system complicating pregnancy, childbirth or the puerperium"
  }
]