[
  {
    "vignette_index": 87,
    "input": "Substance-Induced Psychotic Disorder END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High, based on history of stimulant use, visual and auditory hallucinations, paranoid themes, and symptom persistence over weeks. - Severity classification: Moderate to severe, given the reported hallucinations impacting functioning, potential paranoia, and possible underreported symptom severity. - Urgency level: Urgent; psychotic symptoms with paranoid features necessitate prompt intervention to ensure safety. - Differential considerations still requiring monitoring: comorbid primary psychotic disorder, underlying mood disorder with psychotic features, or substance withdrawal effects.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Discontinuation of stimulant use, behavioral therapy, and pharmacological support targeting psychosis. - Supporting evidence: Abstinence from stimulants can reduce or resolve psychotic symptoms; antipsychotics are effective for persistent psychosis. - Patient-specific considerations: The patient's continuous substance use, potential confusion, and paranoid features require a tailored approach. - Contraindications or cautions: Avoid medications that lower the seizure threshold or have significant metabolic side effects; monitor for adverse reactions.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Low-dose atypical antipsychotic, e.g., risperidone 1-2 mg daily. - Rationale for selection: Risperidone has proven efficacy for stimulant-induced psychosis, manageable side effect profile, and quick onset of action. - Expected timeline for improvement: Symptoms may begin to improve within 1-2 weeks, with full resolution over 4-6 weeks following abstinence. - Key side effects to monitor: Extrapyramidal symptoms, metabolic changes, sedation; regular follow-up needed. - Alternative medications if first-line fails: Quetiapine or olanzapine, considering side effect profiles and patient tolerability.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Substance use counseling, cognitive-behavioral therapy focusing on substance avoidance, psychoeducation. - Patient education priorities: Risks of stimulant use, importance of abstinence, recognizing early warning signs of psychosis. - Lifestyle modifications: Establishing sleep, nutrition, stress management routines, and avoiding triggers. - Behavioral interventions: Motivational interviewing, referral to addiction specialists, engaging support networks.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Reassess in 1-2 weeks after initiation of pharmacotherapy and substance cessation efforts. - Monitoring parameters: Symptom severity, medication side effects, substance use continuity, safety assessments. - Red flag symptoms: Worsening hallucinations, suicidal ideation, suicidal or homicidal thoughts, worsening paranoia. - Treatment response assessment: Clinical scales (e.g., positive and negative syndrome scale), patient self-report, corroborative reports.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (chronology_confused), how should I communicate this plan? - Communication approach: Use clear, simple language, repeat information, involve written summaries or visual aids. - Addressing patient concerns: Reassure about the temporary nature of symptoms, emphasize safety, and clarify importance of abstinence. - Adherence strategies: Short, manageable steps; involve support persons; frequent follow-ups. - Family involvement: With patient consent, include family for support and monitoring.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Psychiatrist for medication management and substance treatment. - Other healthcare team members: Addiction counselor, psychologist for therapy. - Community resources: Support groups for substance use, psychoeducational programs, crisis lines. - Insurance/cost considerations: Verify coverage for medications, therapy, and addiction programs; explore low-cost options if needed.\nANSWER: Based on the diagnosis of Substance-Induced Psychotic Disorder, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes immediate discontinuation of stimulant use, initiation of a low-dose atypical antipsychotic such as risperidone, and behavioral interventions including counseling, psychoeducation, and support for substance abstinence. Initial management focuses on stabilizing psychotic symptoms, ensuring safety, and addressing ongoing substance use, while establishing long-term strategies for relapse prevention and mental health stability. Follow-up care will include regular assessments of psychotic symptoms, medication side effects, and substance use, with a plan to reassess in 1-2 weeks and adjust treatment accordingly. Patient education will emphasize the importance of abstinence, understanding symptoms, and seeking help early if symptoms recur or worsen. This integrated approach aims to promote symptom resolution, reduce relapse risk, and support recovery.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange hospital admission or intensive outpatient follow-up, start risperidone 1 mg daily, and initiate substance cessation counseling. - Short-term goals (1-4 weeks): Achieve symptom stabilization, improve insight, support abstinence, and monitor medication tolerance. - Long-term objectives (3-6 months): Confirm sustained abstinence, complete medication course, and incorporate ongoing psychotherapy and support groups. - Patient handout summary: Key points include avoiding stimulants, taking prescribed medications, attending follow-up appointments, and seeking help if symptoms worsen or safety is compromised.",
    "gold_diagnosis": "Stimulant-induced psychotic disorder including amphetamines, methamphetamine or methcathinone with hallucinations"
  }
]