[
  {
    "vignette_index": 4137,
    "input": "THINKING:\nDiagnosis: Functional (Psychogenic) Movement Disorder\nJustification: The patient's symptoms include involuntary movements such as twitching and jerks that are initially localized but have progressively generalized, which can be seen in functional movement disorders. The movements are described as unpredictable, worsened by stress or fatigue, and variable throughout the day—features characteristic of non-epileptic, psychogenic origins. Additionally, her emotional state—anxiety and sadness—may contribute or reflect underlying psychological factors. The early initiation of symptoms in the mornings when she feels anxious, with some fluctuation during the day, supports a functional etiology rather than neurodegenerative or primary neurological disorders, which typically have more consistent patterns. The absence of specific persistent neurological findings or objective signs of neurodegeneration further supports this diagnosis.\n\nChecklist:\n- No diagnostic uncertainty remaining: Yes\n- No further clarification needed: Yes\n\nANSWER:\nFunctional (Psychogenic) Movement Disorder END",
    "output": "THINKING: Given the diagnosis of a Functional (Psychogenic) Movement Disorder, the primary goal is to reduce symptoms by addressing psychological factors and improving coping strategies. Non-pharmacological approaches, such as psychoeducation, cognitive-behavioral therapy (CBT), and stress management techniques, are first-line and can help the patient understand the disorder, reduce anxiety, and develop healthier responses to stressors. Establishing a consistent routine and avoiding reinforcing attention to the movements are also crucial. Pharmacological treatments may be considered if comorbid anxiety or depression are significantly impacting functioning; selective serotonin reuptake inhibitors (SSRIs) are a reasonable choice, given their efficacy in anxiety and depressive symptoms. It’s essential to communicate to the patient that these movements are real but have a psychological basis, and that most cases improve with appropriate treatment and reassurance.\n\nANSWER: The treatment plan should begin with comprehensive psychoeducation about the nature of functional movement disorders, emphasizing that symptoms are real but treatable, and reinforcing that recovery is possible. Initiate cognitive-behavioral therapy to address underlying stress, anxiety, and maladaptive thought patterns contributing to the symptoms. Encourage stress management techniques such as relaxation exercises, mindfulness, and regular physical activity as tolerated. Consider starting an SSRI (e.g., sertraline or escitalopram) if the patient exhibits significant anxiety or depressive symptoms; this can help reduce emotional distress that may exacerbate movement symptoms. Regular follow-up should focus on symptom monitoring, ongoing psychoeducation, and evaluating the need for further psychological support or adjustments in pharmacotherapy, aiming to promote symptom reduction and improve overall functioning."
  }
]