[
  {
    "vignette_index": 660,
    "input": "Paroxysmal Supraventricular Tachycardia (SVT) END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: Moderate to high. The episodic nature, exertional triggers, and associated symptoms are consistent with paroxysmal SVT, but confirmation via ECG during an episode or Holter monitoring is needed. - Severity classification: Mild to moderate, given episodes are brief but symptomatic, impacting quality of life, with associated dizziness and fatigue. - Urgency level: Routine care needed; no immediate life-threatening features reported, but prompt evaluation is necessary. - Differential considerations still requiring monitoring: Other arrhythmias, structural cardiac abnormalities (like rheumatic pulmonary valve insufficiency), panic attacks, or exertional cardiac issues.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Acute vagal maneuvers, outpatient assessment, and consideration of medications if episodes are frequent or troublesome. - Supporting evidence: Vagal maneuvers are the first-line due to safety and efficacy in terminating SVT. - Patient-specific considerations: Anxiety may exacerbate symptoms; underlying valvular disease necessitates cautious approach. - Contraindications or cautions: Avoid medications that may depress myocardial conduction without proper supervision; careful monitoring during pharmacologic interventions.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Adenosine 6 mg IV rapid push, may repeat every 1-2 minutes up to 12 mg if ineffective. - Rationale for selection: Rapid onset, proven effectiveness for acute termination of SVT; short half-life minimizes prolonged side effects. - Expected timeline for improvement: Immediate response in most cases. - Key side effects to monitor: Transient chest discomfort, flushing, brief asystole, or arrhythmias. - Alternative medications if first-line fails: Beta-blockers (e.g., metoprolol), calcium channel blockers (e.g., verapamil) for longer-term control, with specialist input.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Education on recognizing episodes, avoiding known triggers, and stress management. - Patient education priorities: Explanation of benign nature, importance of timely response, medication use, and when to seek urgent care. - Lifestyle modifications: Adequate hydration, avoiding excessive caffeine/stimulants, gradual increase in physical activity with supervision. - Behavioral interventions: Relaxation techniques, cognitive behavioral therapy to manage anxiety that may worsen symptoms.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Re-evaluate in 1-2 weeks after initial management, then periodically based on symptom control. - Monitoring parameters: Frequency and severity of episodes, response to interventions, ECG/holter or event monitoring results. - Red flag symptoms: Syncope, sustained palpitations, chest pain at rest, or signs of worsening heart failure. - Treatment response assessment: Decreased frequency/intensity of episodes, improved activity tolerance, reduced anxiety.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Clear, compassionate explanation emphasizing the benign nature of SVT, reassurance, and engaging the patient in management. - Addressing patient concerns: Address anxiety, fears of arrhythmia worsening, and clarify treatment steps. - Adherence strategies: Simplify medication regimen, involve family for support, provide written instructions. - Family involvement: Educate family members on recognizing episodes, emergency response plan, and emotional support.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Cardiology consultation for definitive diagnosis, possible electrophysiology referral if episodes persist or worsen. - Other healthcare team members: Nurse educators, mental health professionals if anxiety significantly impacts management. - Community resources: Support groups for arrhythmias or adolescent cardiac patients, educational materials. - Insurance/cost considerations: Discuss medication costs, coverage for cardiology evaluations, and potential procedural interventions.\nANSWER: Based on the diagnosis of paroxysmal SVT, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initial vagal maneuvers for episode termination, outpatient diagnostic assessments such as ECG and Holter monitoring, and patient education to recognize and respond to episodes appropriately. Pharmacologic intervention with adenosine is indicated for acute episodes, with consideration of longer-term options like beta-blockers if episodes are frequent or disabling. Lifestyle modifications and anxiety management are crucial to improve quality of life. Ongoing follow-up will assess symptom control and guide further treatment, including possible referral to cardiology for advanced intervention if needed.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Educate the patient on vagal maneuvers, provide instructions on when to seek emergency care, and obtain baseline ECG. - Short-term goals (1-4 weeks): Complete diagnostic testing, start acute management plan, and address anxiety concerns. - Long-term objectives (3-6 months): Achieve symptom control, minimize episodes, and evaluate for possible electrophysiology study if recurring. - Patient handout summary: Explanation of SVT, safety tips like vagal maneuvers, medication info, activity recommendations, and when to seek help.",
    "gold_diagnosis": "Rheumatic pulmonary valve insufficiency"
  }
]