[
  {
    "vignette_index": 1,
    "input": "Infectious Keratitis END",
    "output": "THINKING: The diagnosis of infectious keratitis requires prompt and aggressive treatment to prevent corneal perforation and preserve vision. Although the initial point mentions acute epidemic haemorrhagic conjunctivitis, the final diagnosis is infectious keratitis, which is a potentially sight-threatening emergency. The severity appears high, given the rapid progression and symptoms like pain, redness, swelling, tearing, and visual impairment. This warrants immediate ophthalmologic evaluation and treatment. Considering the patient's stoic minimalism, careful patient education and reassurance will be vital for adherence.  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: High, based on clinical signs of infectious keratitis. - Severity classification: Severe, due to rapid progression, pain, visual impairment, and risk of corneal damage. - Urgency level: Immediate ophthalmological evaluation and initiation of treatment are critical. - Differential considerations: Corneal foreign body, herpetic keratitis, autoimmune keratoconjunctivitis (less likely but requires monitoring).  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Prompt initiation of topical broad-spectrum antimicrobial therapy, preferably fortified antibiotics for bacterial keratitis or antivirals if herpetic origin is suspected. - Supporting evidence: Timely antimicrobial therapy reduces corneal destruction and preserves vision; topical agents are standard. - Patient-specific considerations: No contraindication noted, but the immunocompetent status presumed; adherence may be challenging given stoic demeanor. - Contraindications or cautions: Avoid corticosteroids initially until infectious etiology is confirmed, as they can worsen infection.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: - If bacterial keratitis suspected: hourly fortified antibiotics such as vancomycin 50 mg/mL and ceftazidime 50 mg/mL, adjusted based on culture if available. - If herpetic keratitis suspected: topical antivirals like trifluridine 1% q2h. - Rationale: Fortified antibiotics cover common bacterial pathogens; antivirals address herpetic infections. - Expected timeline: Improvement expected within 48-72 hours; however, treatment duration may extend 1–2 weeks or longer. - Key side effects: Monitoring for corneal toxicity, hypersensitivity, and potential toxic keratopathy. - Alternative medications: Moxifloxacin or gatifloxacin eye drops for less severe cases or if fortified agents are unavailable.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: - Strict eye hygiene, avoiding contact lens wear until resolution. - Protect the eye from trauma or further contamination. - Patient education priorities: - Importance of adherence to medication schedule, eye protection, and follow-up visits. - Recognizing worsening symptoms like increased pain, vision loss, or new discharge requiring immediate attention. - Lifestyle modifications: - Rest and avoid eye rubbing. - Behavioral interventions: - Reinforce the need to report any deterioration promptly.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: - Reassess within 24-48 hours post-treatment initiation. - Weekly until resolution; then as advised. - Monitoring parameters: - Symptom resolution, visual acuity, size and recurrence of corneal infiltrates. - Red flag symptoms: - Worsening pain, decreasing vision, increasing redness, new hypopyon, or perforation signs. - Treatment response assessment: - Improvement in symptoms, decrease in infiltrate size, absence of progression.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: - Use clear, straightforward language emphasizing urgency and importance of adherence, while acknowledging stoic tendencies to minimize discomfort. - Addressing patient concerns: - Reassure about treatment effectiveness, address fears of vision loss, and involve patient in care plan. - Adherence strategies: - Simplify medication schedule with written instructions, stress importance of completing treatment. - Family involvement: - If appropriate, involve family for support and ensuring compliance.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: - Immediate ophthalmology consultation for diagnosis confirmation and possible inpatient management. - Other healthcare team members: - Eye care specialists, possibly infectious disease if atypical pathogens suspected. - Community resources: - Educational materials on eye health and infection prevention. - Insurance/cost considerations: - Discuss medication costs and prioritize affordable options if needed, facilitating access as feasible.\nANSWER: Based on the diagnosis of infectious keratitis, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes prompt initiation of broad-spectrum topical antibiotics, such as fortified vancomycin and ceftazidime, administered hourly initially, with close ophthalmologic follow-up within 24-48 hours. If herpetic keratitis is suspected, topical antivirals like trifluridine should be used. The key interventions also involve strict eye hygiene, patient education on medication adherence, warning signs for deterioration, and protection of the eye from trauma. Ongoing monitoring will focus on symptom progression, visual acuity, and signs of complications, with immediate referral to ophthalmology for specialized management. Clear communication tailored to the patient's stoic personality is essential, emphasizing the urgency of treatment, reassurance, and involving family support if possible. This approach aims to preserve vision, minimize complications, and ensure sustained recovery.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Arrange urgent ophthalmology consultation; start empirical topical antibiotics; educate the patient on eye hygiene and medication adherence. - Short-term goals (1-4 weeks): Achieve symptom resolution, reduce infiltrate size, monitor for side effects or complications, and ensure compliance. - Long-term objectives (3-6 months): Complete treatment, restore visual function, prevent recurrences, and educate the patient about eye health maintenance. - Patient handout summary: Emphasize the importance of medication adherence, watch for worsening symptoms, and schedule follow-up visits diligently.",
    "gold_diagnosis": "Acute epidemic haemorrhagic conjunctivitis"
  }
]