[
  {
    "vignette_index": 405,
    "input": "Soft tissue sarcoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: high, given histopathological confirmation of giant cell sarcoma. - Severity classification: likely severe due to size (enlarging, hard, tender mass), systemic symptoms (fatigue, weight loss), and rapid progression, indicating an aggressive tumor. - Urgency level: immediate, as soft tissue sarcomas require prompt treatment to prevent metastasis and improve prognosis. - Differential considerations still requiring monitoring: infection (abscess, cellulitis), other soft tissue tumors, or benign mimics, but current evidence points strongly toward malignancy.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: surgical resection with wide margins, followed by adjuvant radiotherapy; neoadjuvant or adjuvant chemotherapy depending on staging. - Supporting evidence: surgical excision offers best chance for local control; adjuvant radiotherapy reduces local recurrence; chemotherapy (if indicated) improves survival in high-grade or advanced cases. - Patient-specific considerations: young age (22), good functional status, but systemic symptoms and tumor size suggest need for aggressive multimodal treatment. - Contraindications or cautions: careful assessment regarding limb functionality, potential surgical morbidity, and chemotherapy tolerance.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: doxorubicin and ifosfamide combination, typically administered under oncologist supervision. - Rationale for selection: standard chemotherapeutic agents effective for high-grade soft tissue sarcomas. - Expected timeline for improvement: initial response often seen within 2-3 cycles (~6-8 weeks). - Key side effects to monitor: cardiotoxicity (doxorubicin), myelosuppression, nausea, alopecia, renal toxicity. - Alternative medications if first-line fails: gemcitabine-docetaxel, pazopanib (targeted therapy), or enrollment in clinical trials.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: physical therapy post-surgery, nutritional support, pain management. - Patient education priorities: importance of treatment adherence, recognizing signs of complications, understanding prognosis. - Lifestyle modifications: balanced diet to support healing, avoiding tobacco/alcohol, gentle activity within limits. - Behavioral interventions: psychological support, counseling to address emotional impact and minimization of stoic tendencies, ensuring open communication.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: every 3 months for the first 2 years, then every 6 months up to 5 years. - Monitoring parameters: physical exam, imaging (MRI or CT) for local recurrence, chest imaging for metastasis, laboratory evaluations for chemotherapy toxicity. - Red flag symptoms: new or worsening pain, swelling, neurological changes, systemic symptoms indicating progression or recurrence—patient should seek immediate care. - Treatment response assessment: imaging studies post-treatment cycles, functional assessment, quality of life evaluations.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (stoic_minimizer), how should I communicate this plan? - Communication approach: clear, compassionate, straightforward explanations emphasizing importance of early intervention, using normal language avoiding alarming terms, encouraging questions. - Addressing patient concerns: fears about surgery, disability, or side effects; reassure with information on limb-sparing options and support services. - Adherence strategies: involve patient actively in decision-making, set achievable goals, schedule regular follow-ups, provide written summaries. - Family involvement: with patient's consent, involve family or trusted contacts for emotional support and assistance with treatment adherence.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: orthopedic oncologist for surgical planning, medical oncologist for chemotherapy management, radiation oncologist if radiotherapy indicated. - Other healthcare team members: physical and occupational therapists, nutritionist, mental health counselor. - Community resources: support groups for sarcoma patients, educational materials about sarcoma. - Insurance/cost considerations: discuss coverage options early, involve social work to assist with financial or logistical barriers.\nANSWER: Based on the diagnosis of soft tissue sarcoma, I recommend a comprehensive treatment approach that combines evidence-based surgical, radiotherapeutic, and chemotherapeutic strategies with patient-centered supportive care. The plan includes prompt surgical excision with wide margins, followed by adjuvant radiotherapy to minimize local recurrence. Chemotherapy with doxorubicin and ifosfamide should be initiated in consultation with oncology, aiming to address potential systemic disease. Simultaneously, supportive measures such as physical therapy, nutritional optimization, and psychological support are essential. Close follow-up with regular imaging and clinical evaluations will monitor for recurrence or metastasis. Education will focus on the importance of treatment adherence and early detection of complications, tailored to the patient's stoic_minimizer personality by providing clear, compassionate explanations and encouraging open communication. This multidisciplinary approach aims to maximize functional and oncologic outcomes while safeguarding the patient's overall well-being.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): arrange urgent surgical consultation, initiate diagnostic staging (MRI, chest CT), discuss chemotherapeutic options with oncology, and initiate patient education. - Short-term goals (1-4 weeks): complete surgical planning and intervention, start chemotherapy if indicated, and begin supportive therapies. - Long-term objectives (3-6 months): ensure complete treatment, monitor for recurrence, rehabilitate limb function, and address psychological impact. - Patient handout summary: importance of early treatment, surgical and adjuvant therapies, follow-up schedule, signs of recurrence, and self-care tips.",
    "gold_diagnosis": "Giant cell sarcoma"
  }
]