[
  {
    "vignette_index": 511,
    "input": "Squamous Cell Carcinoma END",
    "output": "THINKING: Use systematic clinical reasoning to develop a treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: Very high, based on biopsy confirming squamous cell carcinoma. - Severity classification: Likely severe/advanced, given ulceration, bleeding, rapid growth, and symptoms. - Urgency level: Immediate, as the lesion is ulcerated, bleeding, painful, and enlarging—indicative of aggressive disease requiring prompt intervention. - Differential considerations still requiring monitoring: Other skin malignancies (basal cell carcinoma, melanoma) and infectious causes, but biopsy has clarified squamous cell carcinoma.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Surgical excision with adequate margins, possibly supplemented with radiotherapy. - Supporting evidence: Surgical removal offers the best chance for complete cure; radiotherapy improves local control in certain cases. - Patient-specific considerations: Lesion location, size, extent, and patient's overall health; need for multidisciplinary care. - Contraindications or cautions: Potential surgical morbidity, especially if lesion involves critical structures; patient comorbidities.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Not primary unless in cases where surgery/radiation aren't feasible; in this context, focus is on surgical management. - (Adjunct) Pharmacotherapy: Consider postoperative radiotherapy if margins are positive or if lesion is unresectable. - Expected timeline for improvement: Surgical healing typically assessed in 2-4 weeks; radiation effects in 4-8 weeks. - Key side effects to monitor: Surgical site infection, nerve injury, radiation dermatitis if indicated. - Alternative medications if first-line fails: Chemotherapy or targeted therapies in advanced/recurrent cases, but primarily surgical/radiation here.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Wound care, infection prevention, nutritional support. - Patient education priorities: Significance of timely treatment, wound care, risk of recurrence, and surveillance. - Lifestyle modifications: Sun protection, avoiding trauma to the area, maintaining overall health. - Behavioral interventions: Smoking cessation if applicable, stress management.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: In 1-2 weeks post-surgery, then every 3 months for the first year. - Monitoring parameters: Wound healing, signs of recurrence, new lesions. - Red flag symptoms: Rapid growth, new pain, bleeding, neurological deficits, or ulceration. - Treatment response assessment: Complete excision confirmed by pathology, absence of new lesions.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Clear, empathetic explanation of diagnosis, treatment options, and prognosis. - Addressing patient concerns: Anxiety about cancer, treatment side effects, and functional/cosmetic outcomes. - Adherence strategies: Ensuring understanding, setting expectations, arranging follow-up reminders. - Family involvement: With patient consent, involve family for support and assistance.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Surgical oncologist, possibly radiation oncologist, plastic surgeon for reconstruction. - Other healthcare team members: Nursing for wound care, dietitian for nutritional support. - Community resources: Support groups, skin cancer awareness programs. - Insurance/cost considerations: Discuss coverage for surgery, radiotherapy, and follow-up care; assist with referrals to covered facilities.\nANSWER: Based on the diagnosis of squamous cell carcinoma of the parotid gland, I recommend a comprehensive treatment approach that combines evidence-based surgical management, possible adjunctive radiotherapy, and robust follow-up care. Immediate actions include scheduling surgical excision with appropriate margins, coordinating with surgical oncology, and preparing for postoperative wound care. Long-term management involves regular surveillance every 3 months initially, with prompt action if recurrence signs appear. The plan emphasizes patient education on wound care, sun protection, and recognizing recurrence symptoms, ensuring multidisciplinary coordination, including surgical and radiation oncologists. This strategy aims to achieve local disease control, optimize cosmetic and functional outcomes, and monitor for potential metastasis or recurrence, while minimizing treatment-related risks.",
    "gold_diagnosis": "Squamous cell carcinoma of parotid gland"
  }
]