[
  {
    "vignette_index": 240,
    "input": "Migraine with aura END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment approach:  STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: Let me first confirm the diagnosis and assess severity/urgency. - Primary diagnosis confidence: High, given the typical presentation of migraine with aura, headache characteristics, and associated symptoms. - Severity classification: Severe, as the patient experiences the worst headache ever with associated nausea and vomiting, which impact functioning. - Urgency level: Urgent care needed due to the severity and recent onset of a disabling headache, distinguishing it from typical migraines. - Differential considerations still requiring monitoring: Hemorrhagic or ischemic stroke, intracranial mass, or other secondary causes. Although less likely, any atypical features or neurological deficits should prompt urgent neuroimaging.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: Now I'll select treatments based on current clinical guidelines. - First-line treatment per guidelines: Acute treatment with NSAIDs and/or triptans, along with antiemetics. - Supporting evidence: Triptans are proven effective for migraine relief, especially with aura, and NSAIDs provide rapid pain control. - Patient-specific considerations: Her previous mild headaches suggest potential responsiveness; nausea warrants antiemetics; no contraindications noted. - Contraindications or cautions: Triptans contraindicated if there are cardiovascular risks; NSAIDs require caution if gastrointestinal issues or bleeding risk exists.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: If medications are appropriate, I'll select based on efficacy and safety. - Primary medication choice: Sumatriptan 50 mg orally, single dose; NSAID such as ibuprofen 400 mg; and antiemetic like prochlorperazine 5 mg IM or metoclopramide 10 mg PO. - Rationale for selection: Triptans have specific efficacy for migraine aura; NSAIDs provide additional pain control; antiemetics address nausea and vomiting. - Expected timeline for improvement: Most patients see relief within 1-2 hours. - Key side effects to monitor: Triptans for cardiovascular effects, antiemetics for extrapyramidal symptoms, NSAIDs for GI upset. - Alternative medications if first-line fails: Dihydroergotamine, sumatriptan nasal spray, or IV medications in refractory cases.  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: I'll include lifestyle and behavioral interventions that enhance outcomes. - Primary non-drug interventions: Maintaining a headache diary, identifying and avoiding triggers. - Patient education priorities: Recognizing early warning signs, appropriate medication use, and when to seek urgent care. - Lifestyle modifications: Regular sleep schedule, hydration, migraine-friendly diet, stress management techniques. - Behavioral interventions: Cognitive-behavioral therapy (CBT), relaxation techniques, biofeedback if available.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: I'll establish appropriate monitoring and follow-up care. - Follow-up timeline: Schedule in 1-2 weeks to assess response, then periodically. - Monitoring parameters: Frequency and severity of attacks, medication efficacy, side effects, aura frequency. - Red flag symptoms: Sudden neurological deficits, worsening headache, new persistent symptoms, or signs of secondary headache needing urgent evaluation. - Treatment response assessment: Patient report of pain relief, associated symptom control, and functional improvement.  STEP 6 - PATIENT COMMUNICATION STRATEGY: Given the patient's behavioral type (baseline), how should I communicate this plan? - Communication approach: Present the plan systematically, emphasizing shared decision-making, and reinforcing safety information. - Addressing patient concerns: Clarify expectations, possible side effects, and the importance of adherence. - Adherence strategies: Simplify medication regimens, provide written instructions, and encourage maintaining a headache diary. - Family involvement: If appropriate, involve family in understanding triggers and support strategies.  STEP 7 - COORDINATION & REFERRALS: What additional care coordination is needed? - Specialist referrals needed: Consider neurology consultation if migraines are refractory, frequent, or if atypical features develop. - Other healthcare team members: Nurse educators, mental health professionals if stress management is needed. - Community resources: Migraine support groups, educational websites, or patient advocacy organizations. - Insurance/cost considerations: Ensure medication plans are covered and discuss cost-effective options.\nANSWER: Based on the diagnosis of migraine with aura, I recommend a comprehensive treatment approach that combines evidence-based acute management with lifestyle modifications and patient education. The immediate plan includes prescribing sumatriptan, NSAIDs, and antiemetics for symptomatic relief, emphasizing early use at the onset of symptoms. Non-pharmacological strategies include maintaining a headache diary, identifying triggers, and adopting healthy lifestyle habits such as regular sleep and hydration. Long-term management should involve regular follow-up to evaluate response, adjust therapy, and reinforce lifestyle changes. Patient education will focus on recognizing warning signs requiring urgent care, proper medication use, and adherence. This integrated approach aims to reduce episode frequency and severity, improve quality of life, and minimize risks of medication overuse or side effects.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Prescribe triptan and NSAID; educate the patient on when and how to use medications; instruct on warning signs. - Short-term goals (1-4 weeks): Assess effectiveness, adherence, and safety; initiate lifestyle modifications. - Long-term objectives (3-6 months): Aim to reduce attack frequency and severity; reassess need for preventive therapies if attacks remain frequent. - Patient handout summary: Key points about medication use, trigger management, warning signs, and when to seek urgent care.",
    "gold_diagnosis": "Migraine disorder (TM1)"
  }
]