[
  {
    "vignette_index": 136,
    "input": "Hyperemesis gravidarum END",
    "output": "THINKING: Use systematic clinical reasoning to develop your treatment plan: STEP 1 - DIAGNOSIS CONFIRMATION & SEVERITY ASSESSMENT: - Primary diagnosis confidence: High, given the clinical presentation of persistent nausea/vomiting, signs of dehydration, and pregnancy context, consistent with hyperemesis gravidarum. - Severity classification: Moderate to severe, considering duration (>1 week), weight loss, dehydration signs, and concern for fetal health. - Urgency level: Urgent; requires prompt hydration and symptom control to prevent maternal and fetal complications. - Differential considerations still requiring monitoring: Other causes of nausea/vomiting in pregnancy (e.g., molar pregnancy, gastrointestinal issues), but diagnosis remains primary.  STEP 2 - EVIDENCE-BASED TREATMENT SELECTION: - First-line treatment per guidelines: Intravenous hydration with electrolytes, antiemetic therapy, and nutritional support. - Supporting evidence: Ensures rehydration, prevents maternal dehydration and electrolyte imbalance, and controls nausea to promote oral intake. - Patient-specific considerations: Watch for signs of dehydration, fetal well-being, and avoid medications contraindicated in pregnancy. - Contraindications or cautions: Avoid teratogenic medications, and monitor for medication side effects.  STEP 3 - PHARMACOLOGICAL INTERVENTIONS: - Primary medication choice: Ondansetron 4 mg orally or IV every 8 hours, or promethazine 25 mg IM every 6-8 hours if tolerated. - Rationale for selection: Both have evidence for efficacy in hyperemesis gravidarum with known safety profile in pregnancy. - Expected timeline for improvement: Symptoms often improve within 24-48 hours after initiation. - Key side effects to monitor: QT prolongation (Ondansetron), sedation, anticholinergic effects (promethazine). - Alternative medications if first-line fails: Metoclopramide (considered after initial therapy, with caution regarding side effects).  STEP 4 - NON-PHARMACOLOGICAL INTERVENTIONS: - Primary non-drug interventions: Small, frequent meals; bland, easy-to-digest foods; avoiding triggers; adequate hydration. - Patient education priorities: Recognizing signs of dehydration, importance of nutrition, medication adherence. - Lifestyle modifications: Rest, stress reduction techniques, avoiding abrupt movements. - Behavioral interventions: Consider counseling or support groups if anxiety persists.  STEP 5 - MONITORING & FOLLOW-UP STRATEGY: - Follow-up timeline: Reassess in 24-48 hours post-intervention, then every few days until stabilization. - Monitoring parameters: Weight, hydration status, electrolytes, urine output, fetal heart rate if feasible. - Red flag symptoms: Severe dehydration, persistent vomiting despite treatment, abdominal pain, bleeding, decreased fetal movement. - Treatment response assessment: Symptom relief, stable weight, resolution of dehydration signs.  STEP 6 - PATIENT COMMUNICATION STRATEGY: - Communication approach: Use clear, simple language; acknowledge her concerns; provide reassurance. - Addressing patient concerns: Explain the importance of hydration, medication safety for her and fetus, and reassure about treatment safety. - Adherence strategies: Emphasize small manageable steps, regular follow-up, and involve her in decision-making. - Family involvement: With patient consent, involve partner or family for support and adherence encouragement.  STEP 7 - COORDINATION & REFERRALS: - Specialist referrals needed: Obstetrician for ongoing pregnancy management and possibly a maternal-fetal medicine specialist if severity persists. - Other healthcare team members: Nutritionist for dietary guidance; possibly a mental health professional if needed. - Community resources: Support groups for pregnancy-related nausea; educational materials. - Insurance/cost considerations: Confirm coverage for medications, labs, and follow-up visits; explore social support if needed.\nANSWER: Based on the diagnosis of hyperemesis gravidarum, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes prompt initiation of IV hydration with electrolytes, antiemetic therapy (e.g., ondansetron or promethazine), and nutritional support through small, frequent, bland meals. Careful monitoring of hydration status, electrolytes, and fetal well-being is essential. The patient should be educated about symptom management, signs of worsening dehydration or complications, and medication safety. Follow-up should occur within 24-48 hours to assess response, with ongoing evaluation every few days until stabilization. We will involve obstetric specialists as needed and coordinate nutritional and psychological support to ensure comprehensive care. This plan aims to control symptoms, prevent maternal dehydration, support fetal health, and improve overall well-being while minimizing medication risks.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Establish IV access, initiate hydration, start antiemetics, perform initial clinical assessment. - Short-term goals (1-4 weeks): Achieve symptom control, normalize hydration and electrolytes, maintain adequate nutrition, monitor fetal well-being. - Long-term objectives (3-6 months): Manage ongoing symptoms, monitor maternal and fetal health, plan for delivery, support maternal mental health if needed. - Patient handout summary: Emphasize importance of hydration, medication adherence, regular follow-up, and warning signs prompting urgent care.",
    "gold_diagnosis": "Diseases of the digestive system complicating pregnancy, childbirth or the puerperium"
  }
]