[
  {
    "vignette_index": 794,
    "input": "Infectious cervical lymphadenitis END",
    "output": "THINKING: Use systematic reasoning to confirm the severity and urgency of infectious cervical lymphadenitis, then select evidence-based treatments tailored to an adult patient. Ensure antibiotics are appropriate if bacterial infection is suspected, and consider adjunctive measures for symptom relief and patient education. Monitor response closely, with clear follow-up and instructions, and consider referrals if no improvement or complications arise. Communicate the plan clearly, considering the patient's baseline communication style, to promote adherence and understanding.\nANSWER: Based on the diagnosis of infectious cervical lymphadenitis, I recommend a comprehensive treatment approach that combines evidence-based medical management with patient-centered care strategies. The treatment plan includes initiating empirical antibiotics targeting common pathogens, supportive care with analgesics and anti-inflammatory agents, and close follow-up to ensure resolution. Initial management focuses on controlling infection, reducing symptoms, and preventing complications while establishing a plan for long-term monitoring. Follow-up care will include scheduled assessments at 48-72 hours and as needed, with instructions for the patient to report worsening symptoms such as increasing swelling, fever, or systemic signs. This approach is designed to promote resolution of infection, minimize side effects, and address any underlying issues promptly.  IMPLEMENTATION GUIDANCE: - Immediate actions (today): Perform thorough physical examination focusing on lymph node characteristics and ocular assessment; start empiric antibiotics targeting common causative organisms; provide supportive care with analgesics and hydration. - Short-term goals (1-4 weeks): Confirm clinical improvement with reduction in swelling, redness, and tenderness; monitor for adverse medication effects; reassess if no response within 48-72 hours. - Long-term objectives (3-6 months): Ensure complete resolution, investigate underlying causes if recurrent or non-responsive, and provide health education to prevent future episodes. - Patient handout summary: Emphasize importance of completing prescribed antibiotics, watch for worsening symptoms, maintain good hygiene, and follow-up as scheduled.",
    "gold_diagnosis": "Acute lymphadenitis"
  }
]