[
  {
    "doctor_vignette": "A 54-year-old female presents with persistent joint pain and swelling, primarily in her hands and wrists. On examination, there is significant tenderness, bilateral swelling, and morning stiffness lasting over an hour. Laboratory tests reveal elevated rheumatoid factor and anti-CCP antibodies, along with an increased ESR. X-rays show joint erosions in the metacarpophalangeal joints.",
    "actual_diagnosis": "Rheumatoid arthritis, ICD-10 code M05.79"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with a chief complaint of increasing shortness of breath and a chronic cough producing sputum for the past few months. Physical examination reveals prolonged expiratory phase, wheezing, and decreased breath sounds bilaterally. A chest X-ray shows hyperinflation of the lungs, and spirometry indicates a reduced FEV1/FVC ratio consistent with obstructive airway disease.",
    "actual_diagnosis": "Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with chronic diarrhea and abdominal bloating that has persisted for several months. On physical examination, she has notable weight loss and signs of malnutrition, including dry skin and hair loss. Serological tests reveal elevated tissue transglutaminase antibodies (tTG-IgA) and positive IgA endomysial antibodies, suggesting an autoimmune process. A subsequent duodenal biopsy confirms the presence of villous atrophy.",
    "actual_diagnosis": "Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 58-year-old male presents to the emergency department with severe chest pain radiating to his left arm, accompanied by shortness of breath. On physical examination, he is diaphoretic and has a blood pressure of 90/60 mmHg with an elevated heart rate of 110 bpm. An ECG shows ST-segment elevation in the anterior leads, and cardiac troponin levels are significantly elevated. ",
    "actual_diagnosis": "Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of tremors in his right hand that have progressively worsened over the past year. Physical examination reveals a resting tremor, bradykinesia, and rigidity in the upper limbs. There is a shuffling gait noted during ambulation, and he demonstrates difficulty initiating movement. MRI of the brain shows no acute changes, supporting the clinical diagnosis of Parkinson's disease.",
    "actual_diagnosis": "Parkinson's disease, ICD-10 code G20"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with recurrent episodes of spontaneous bleeding from the gums and prolonged bleeding after minor cuts. Physical examination reveals easy bruising and joint swelling in the knees. Laboratory tests show aPTT of 60 seconds (normal 30-40 seconds) and normal PT, indicating a deficiency in factor VIII.",
    "actual_diagnosis": "Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with a chief complaint of wheezing and shortness of breath, especially during play and at night. Physical examination reveals diffuse wheezing on auscultation and decreased breath sounds. Peak expiratory flow rate measurement shows a reduction of 60% from her personal best, indicating obstructive airflow limitation.",
    "actual_diagnosis": "Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with unintentional weight loss, increased anxiety, and palpitations over the past month. On examination, she has a rapid heart rate of 110 beats per minute, fine tremors in her hands, and an enlarged thyroid gland. Laboratory tests reveal elevated levels of free T4 and suppressed TSH, confirming hyperthyroidism.",
    "actual_diagnosis": "Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of persistent joint pain and fatigue for the past three months. Physical examination reveals a butterfly rash across her cheeks and photosensitivity. Laboratory tests show elevated anti-nuclear antibodies (ANA) and low complement levels, consistent with autoimmune activity.",
    "actual_diagnosis": "Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with persistent fatigue and mild lower extremity edema. On physical examination, she has elevated blood pressure and decreased urine output. Laboratory results reveal a serum creatinine level of 2.5 mg/dL and a glomerular filtration rate (GFR) of 30 mL/min, indicating significant renal impairment.",
    "actual_diagnosis": "Chronic kidney disease, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with a chief complaint of persistent cough and difficulty breathing. Physical exam reveals digital clubbing and wheezing on auscultation. A sweat test demonstrates an elevated chloride level of 80 mmol/L, confirming the suspicion of cystic fibrosis.",
    "actual_diagnosis": "Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with severe pain and swelling in his right big toe, which started suddenly during the night. On examination, the toe is erythematous, warm, and tender to touch, with limited range of motion. Serum uric acid levels are markedly elevated at 9.2 mg/dL, and joint aspiration reveals needle-shaped monosodium urate crystals under polarized light.",
    "actual_diagnosis": "Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 22-year-old female presents with excessive daytime sleepiness and episodes of sudden muscle weakness triggered by laughter. Physical examination reveals normal neurological function except for mild cataplexy. Polysomnography shows decreased REM latency and multiple sleep onset REM periods. The MSLT confirms a mean sleep latency of 4 minutes with two sleep-onset REM episodes.",
    "actual_diagnosis": "Narcolepsy, ICD-10 code G47.419"
  },
  {
    "doctor_vignette": "A 65-year-old male with a history of chronic obstructive pulmonary disease presents with a chief complaint of worsening cough and fever for three days. Physical examination reveals decreased breath sounds and dullness to percussion in the right lower lung field. A chest X-ray shows a right lower lobe consolidation, and sputum culture identifies Klebsiella pneumoniae.",
    "actual_diagnosis": "Pneumonia due to Klebsiella pneumoniae, ICD-10 code J15.0"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with progressive chorea and difficulty with coordination over the past year. Neurological examination reveals abnormal movements of her limbs and facial grimacing, along with mild cognitive decline. Genetic testing reveals the presence of the CAG repeat expansion in the HTT gene, confirming the diagnosis.",
    "actual_diagnosis": "Huntington's disease, ICD-10 code G10"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of recurrent abdominal pain and bloating, often relieved by defecation. Physical examination reveals mild tenderness in the lower abdomen without guarding or rebound tenderness. Laboratory tests, including complete blood count and metabolic panel, are unremarkable, and no imaging studies are indicated. The symptoms have been occurring for over six months with no identifiable organic cause.",
    "actual_diagnosis": "Irritable bowel syndrome, ICD-10 code K58.9"
  },
  {
    "doctor_vignette": "A 5-year-old boy presents with recurrent fractures after minimal trauma. On physical examination, he has blue sclera and a noticeable bowing of his lower limbs. X-rays reveal multiple healed and healing fractures in various stages, along with osteopenic changes. Genetic testing confirms a mutation in the COL1A1 gene, consistent with osteogenesis imperfecta.",
    "actual_diagnosis": "Osteogenesis imperfecta, ICD-10 code Q78.0"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with persistent fatigue and recurrent infections over the past month. On physical examination, she exhibits pallor and petechiae on her extremities. Complete blood count reveals a hemoglobin level of 8 g/dL, a platelet count of 30,000/mm³, and a white blood cell count of 2,000/mm³, indicating severe cytopenias.",
    "actual_diagnosis": "Aplastic anemia, ICD-10 code D61.9"
  },
  {
    "doctor_vignette": "A 10-year-old male of Mediterranean descent presents with fatigue and pallor. On physical examination, he has noticeable splenomegaly and conjunctival pallor. A complete blood count reveals microcytic anemia with a hemoglobin level of 8 g/dL and elevated levels of fetal hemoglobin (HbF).",
    "actual_diagnosis": "Thalassemia, ICD-10 code D56.9"
  },
  {
    "doctor_vignette": "A 34-year-old female presents with a chief complaint of recurrent headaches occurring more than 15 days per month for the past six months. Physical examination reveals tenderness in the pericranial muscles and no neurological deficits. A brain MRI shows no acute abnormalities, ruling out secondary causes of headache.",
    "actual_diagnosis": "Chronic migraine, ICD-10 code G43.709"
  },
  {
    "doctor_vignette": "A 52-year-old female presents with a chief complaint of persistent joint pain and swelling in her hands and wrists for the past three months. Physical examination reveals bilateral tenderness and swelling of the metacarpophalangeal joints, with morning stiffness lasting over an hour. Laboratory tests show elevated rheumatoid factor and anti-CCP antibodies, along with an elevated ESR.",
    "actual_diagnosis": "Rheumatoid arthritis, ICD-10 code M05.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with fatigue, bruising, and recurrent infections over the past month. Physical examination reveals pallor and multiple ecchymoses on the extremities. Complete blood count shows anemia (Hb 8.5 g/dL), thrombocytopenia (platelets 45,000/μL), and leukocytosis with 25% blasts. Bone marrow biopsy confirms the presence of myeloblasts consistent with acute myeloid leukemia.",
    "actual_diagnosis": "Acute myeloid leukemia, ICD-10 code C92.0"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a chief complaint of red, scaly patches on her elbows and knees that have been persistent for several months. On physical exam, there are well-defined, erythematous plaques covered with silvery-white scales. No laboratory tests are necessary for diagnosis; however, a skin biopsy may confirm the presence of hyperkeratosis and neutrophilic infiltration. The patient has a family history of psoriasis, further supporting the diagnosis.",
    "actual_diagnosis": "Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 32-year-old African American female presents with persistent cough and shortness of breath for the past three months. Physical examination reveals bilateral hilar lymphadenopathy and erythema nodosum on her lower extremities. A chest X-ray shows enlarged lymph nodes and a CT scan confirms the presence of granulomas in the lungs. Laboratory tests show elevated serum angiotensin-converting enzyme (ACE) levels, supporting the diagnosis.",
    "actual_diagnosis": "Sarcoidosis, ICD-10 code D86.9"
  },
  {
    "doctor_vignette": "A 75-year-old male presents to the emergency department with complaints of increasing shortness of breath and swelling in his legs over the past month. On examination, he has elevated jugular venous pressure, bilateral pitting edema, and crackles in the lung fields. A chest X-ray reveals cardiomegaly and pulmonary congestion, and a BNP level is markedly elevated at 800 pg/mL.",
    "actual_diagnosis": "Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 12-year-old male presents with a chief complaint of excessive thirst and frequent urination over the past month. On physical examination, he is noted to have a thin build and dry mucous membranes. Laboratory results show a fasting blood glucose level of 250 mg/dL and a HbA1c of 9.5%.",
    "actual_diagnosis": "Type 1 diabetes mellitus, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with fatigue, weight gain, and cold intolerance. Physical examination reveals dry skin, bradycardia, and a swollen face. Laboratory tests show elevated TSH levels and low free T4 levels, confirming the diagnosis.",
    "actual_diagnosis": "Hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 68-year-old female presents with a chief complaint of persistent low back pain after a minor fall. Physical examination reveals a decreased height of 3 cm since her last visit and tenderness over the lumbar spine. A DEXA scan shows a T-score of -2.8 at the lumbar spine and -2.5 at the hip, indicating significant bone density loss.",
    "actual_diagnosis": "Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 45-year-old male presents to the emergency department with severe abdominal pain radiating to his back, accompanied by nausea and vomiting. On physical examination, he exhibits tenderness in the epigastric region and mild jaundice. Laboratory tests reveal elevated serum lipase and amylase levels, and an abdominal ultrasound shows peritoneal fluid suggesting pancreatitis.",
    "actual_diagnosis": "Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 72-year-old male presents to the emergency department with palpitations and shortness of breath that began earlier in the day. On examination, his heart rate is irregularly irregular at 130 beats per minute, and he has mild edema in his lower extremities. An ECG reveals atrial fibrillation with a rapid ventricular response, and his electrolytes show a potassium level of 3.2 mEq/L.",
    "actual_diagnosis": "Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with auditory hallucinations, reporting that he hears voices telling him to harm himself. On physical examination, he shows signs of disorganized thinking and has difficulty maintaining coherent speech. Routine lab tests, including complete blood count and metabolic panel, are unremarkable, and a CT scan of the head reveals no structural abnormalities.",
    "actual_diagnosis": "Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 72-year-old female presents with fatigue and weakness for the past few months. On physical examination, she has pale conjunctiva and a heart rate of 92 bpm. Laboratory tests reveal a hemoglobin level of 10.2 g/dL, low serum iron, and normal ferritin levels, suggestive of anemia of chronic disease. A history of rheumatoid arthritis is noted, contributing to her condition.",
    "actual_diagnosis": "Anemia due to chronic disease, ICD-10 code D63.8"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with fatigue and mild edema in the lower extremities. Physical examination reveals elevated blood pressure of 150/90 mmHg and bilateral ankle swelling. Laboratory tests show a serum creatinine level of 2.2 mg/dL and an estimated glomerular filtration rate (eGFR) of 45 mL/min, indicating moderate kidney impairment.",
    "actual_diagnosis": "Chronic kidney disease stage 3, ICD-10 code N18.3"
  },
  {
    "doctor_vignette": "A 10-year-old African American male presents with severe abdominal pain and fatigue after experiencing a recent upper respiratory infection. On examination, he has pallor and tenderness in the right upper quadrant. A complete blood count shows a hemoglobin level of 6.5 g/dL, and peripheral blood smear reveals sickle-shaped red blood cells. The patient also has elevated bilirubin levels, indicating hemolysis.",
    "actual_diagnosis": "Sickle cell disease, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with widespread musculoskeletal pain lasting over six months, accompanied by fatigue and sleep disturbances. On physical exam, tenderness is noted in multiple tender points, particularly in the neck, shoulders, and lower back. Routine lab tests including CBC and metabolic panel show no significant abnormalities, and imaging studies are unremarkable.",
    "actual_diagnosis": "Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with a chief complaint of persistent fatigue and night sweats for the past month. Physical examination reveals cervical lymphadenopathy and splenomegaly. A chest X-ray shows mediastinal lymphadenopathy, and a lymph node biopsy confirms the presence of Reed-Sternberg cells.",
    "actual_diagnosis": "Hodgkin lymphoma, ICD-10 code C81.90"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with increased thirst and frequent urination over the past several months. On physical examination, he is overweight with a BMI of 32 and has reduced sensation in his feet. Laboratory tests reveal a fasting blood glucose level of 160 mg/dL and an HbA1c of 7.5%.",
    "actual_diagnosis": "Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 22-year-old male presents to the emergency department with a chief complaint of severe headache and high fever for the past 24 hours. On physical examination, he exhibits neck stiffness and photophobia. A lumbar puncture reveals cloudy cerebrospinal fluid with a white blood cell count of 1,200 cells/mm³, predominantly neutrophils, and positive Gram stain for Streptococcus pneumoniae.",
    "actual_diagnosis": "Bacterial meningitis, ICD-10 code G00.9"
  },
  {
    "doctor_vignette": "A 25-year-old female presents to the emergency department with her first seizure episode, characterized by a generalized tonic-clonic seizure lasting approximately two minutes. On physical examination, she is alert but disoriented postictally, with no focal neurological deficits noted. A CT scan of the head shows no acute intracranial abnormalities, and routine blood tests reveal normal electrolytes and glucose levels.",
    "actual_diagnosis": "Epilepsy, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "A 55-year-old male presents to the emergency department with sudden onset of severe chest pain radiating to the back. On examination, he has a blood pressure differential of 30 mmHg between the arms and a diastolic murmur. Chest X-ray shows a widened mediastinum, and a CT angiogram confirms an aortic dissection extending from the ascending aorta.",
    "actual_diagnosis": "Aortic dissection, ICD-10 code I71.0"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with fatigue and shortness of breath on exertion. Physical examination reveals pale conjunctiva and a heart rate of 110 bpm. Laboratory tests show a hemoglobin level of 9.5 g/dL, low serum ferritin at 10 ng/mL, and elevated total iron-binding capacity (TIBC).",
    "actual_diagnosis": "Anemia due to iron deficiency, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A  seventeen-year-old female presents with a chief complaint of persistent facial acne for the past six months. Physical examination reveals multiple open and closed comedones, papules, and pustules primarily on the forehead and cheeks, with some scarring noted. No laboratory tests or imaging studies are required for diagnosis, as the condition is clinically evident.",
    "actual_diagnosis": "Acne vulgaris, ICD-10 code L70.9"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a 6-month history of persistent nasal congestion and facial pressure. Physical examination reveals tenderness over the maxillary sinuses and postnasal drip. A CT scan of the sinuses shows mucosal thickening and obstruction of the ostiomeatal complex. Allergy testing indicates sensitivity to dust mites.",
    "actual_diagnosis": "Chronic sinusitis, ICD-10 code J32.9"
  },
  {
    "doctor_vignette": "A 55-year-old male presents to the clinic with complaints of frequent headaches and dizziness. On physical examination, his blood pressure is recorded at 160/100 mmHg, and he exhibits mild bilateral retinal changes. Laboratory tests reveal an elevated serum creatinine level of 1.5 mg/dL, indicating possible kidney involvement due to hypertension.",
    "actual_diagnosis": "Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of cough and shortness of breath for the past three days. Upon examination, she exhibits decreased breath sounds and crackles in the right lower lung field. A chest X-ray reveals a right lower lobe infiltrate consistent with pneumonia. Blood tests show elevated white blood cell count and CRP levels, indicating infection.",
    "actual_diagnosis": "Pneumonia, unspecified organism, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with a chief complaint of increasing shortness of breath and a chronic cough producing sputum for the past year. Physical examination reveals wheezing, decreased breath sounds bilaterally, and use of accessory muscles during respiration. A chest X-ray shows hyperinflation of the lungs, and pulmonary function tests indicate an FEV1/FVC ratio of 0.58, consistent with obstructive lung disease.",
    "actual_diagnosis": "Chronic obstructive pulmonary disease (COPD), ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of persistent knee pain, especially after prolonged walking or standing. On physical examination, there is notable crepitus and tenderness along the medial joint line of the right knee, with a reduced range of motion. X-rays reveal joint space narrowing and osteophyte formation, consistent with osteoarthritis.",
    "actual_diagnosis": "Osteoarthritis of the knee, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 32-year-old male presents with a chief complaint of itchy, red patches on his elbows and knees that have persisted for several months. On physical examination, erythematous plaques with silvery scales are noted on extensor surfaces, and there is evidence of nail pitting. No significant lab tests are required for diagnosis, but a skin biopsy reveals hyperkeratosis and acanthosis, consistent with psoriasis.",
    "actual_diagnosis": "Psoriasis vulgaris, ICD-10 code L40.0"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with progressive unilateral hearing loss in the right ear over the past six months, accompanied by occasional tinnitus. On physical examination, there is a diminished response to auditory stimuli on the right side. MRI of the brain reveals a 2.5 cm mass at the cerebellopontine angle consistent with an acoustic neuroma.",
    "actual_diagnosis": "Acoustic neuroma, ICD-10 code D33.3"
  },
  {
    "doctor_vignette": "A 58-year-old female presents with severe, sharp facial pain along the right side of her face, described as electric shocks triggered by light touch. Physical examination reveals tenderness over the right trigeminal nerve distribution with no neurological deficits. MRI of the brain shows a neurovascular conflict at the root entry zone of the right trigeminal nerve.",
    "actual_diagnosis": "Trigeminal neuralgia, ICD-10 code G50.0"
  },
  {
    "doctor_vignette": "A 4-year-old male presents with a 5-day history of high fever, conjunctival injection, and a rash on his torso. On examination, he has cracked lips, strawberry tongue, and cervical lymphadenopathy. Laboratory tests reveal elevated inflammatory markers, including a significantly elevated ESR and CRP, along with thrombocytosis.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I72.9"
  },
  {
    "doctor_vignette": "A 24-year-old female presents with joint hypermobility and recurrent joint dislocations, particularly in the shoulders and knees. Physical examination reveals skin that is velvety and hyper-elastic, along with bruising easily. Genetic testing confirms the presence of pathogenic variants in the COL5A1 gene, consistent with Ehlers-Danlos syndrome.",
    "actual_diagnosis": "Ehlers-Danlos syndrome, ICD-10 code Q79.6"
  },
  {
    "doctor_vignette": "An 8-year-old male presents with progressive muscle weakness and difficulty climbing stairs. Physical examination reveals waddling gait, calf hypertrophy, and positive Gowers' sign. Serum creatine kinase levels are markedly elevated at 12,000 U/L, and genetic testing confirms the presence of mutations in the dystrophin gene.",
    "actual_diagnosis": "Duchenne muscular dystrophy, ICD-10 code G71.0"
  },
  {
    "doctor_vignette": "A 35-year-old male from rural South America presents with persistent fatigue and mild chest pain. Physical examination reveals mild edema in the lower extremities and a heart rate of 110 bpm. An ECG shows signs of right bundle branch block, and serologic tests are positive for Trypanosoma cruzi antibodies, confirming the diagnosis.",
    "actual_diagnosis": "Chagas disease, ICD-10 code B57.0"
  },
  {
    "doctor_vignette": "A 5-year-old male presents with developmental delay and seizures. On physical examination, he has facial angiofibromas and a hypopigmented macule on his left arm. MRI of the brain reveals multiple cortical tubers and subependymal nodules, consistent with the diagnosis.",
    "actual_diagnosis": "Tuberous sclerosis, ICD-10 code Q85.1"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of extreme mood swings over the past six months, including episodes of elevated energy and decreased need for sleep followed by periods of severe depression. Physical examination reveals a labile affect, with inappropriate laughter during the interview and a flat mood during depressive phases. No critical lab or imaging results are necessary for this diagnosis, as the evaluation is primarily clinical based on symptomatology.",
    "actual_diagnosis": "Bipolar disorder, ICD-10 code F31.9"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with progressive dyspnea and a persistent dry cough over the past six months. On physical examination, fine crackles are auscultated at the bases of the lungs, and there is clubbing of the fingers. High-resolution computed tomography (HRCT) of the chest reveals reticular patterns and honeycombing consistent with interstitial lung disease.",
    "actual_diagnosis": "Idiopathic pulmonary fibrosis, ICD-10 code J84.112"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with complaints of enlarged hands and feet over the past several years, along with facial changes including a protruding jaw and enlarged nose. Physical examination reveals coarse facial features, increased spacing between teeth, and a glove size increase from large to extra-large. Serum insulin-like growth factor 1 (IGF-1) levels are markedly elevated, and an MRI of the pituitary gland shows a 2 cm adenoma.",
    "actual_diagnosis": "Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "A 15-year-old male presents with progressive fatigue, tremors, and personality changes over the past few months. Physical examination reveals Kayser-Fleischer rings in the cornea and a liver enlargement. Serum ceruloplasmin is significantly low at 10 mg/dL, and 24-hour urinary copper excretion is elevated at 500 mcg.",
    "actual_diagnosis": "Wilson's disease, ICD-10 code E83.0"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with double vision and persistent muscle weakness, especially in her arms and legs that worsens with activity. On physical examination, she demonstrates ptosis and increased fatigue after prolonged eye closure. Repetitive nerve stimulation shows a decremental response, and acetylcholine receptor antibodies are positive.",
    "actual_diagnosis": "Myasthenia gravis, ICD-10 code G70.0"
  },
  {
    "doctor_vignette": "A 22-year-old male presents to the emergency department with a chief complaint of severe right lower quadrant abdominal pain that began 12 hours ago. On physical examination, he has tenderness at McBurney's point and rebound tenderness is noted. A CT scan of the abdomen reveals an enlarged, non-complex appendix with surrounding inflammatory changes.",
    "actual_diagnosis": "1. Acute appendicitis, ICD-10 code K35.2"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with recurrent episodes of blurred vision and right-sided weakness. Neurological examination reveals decreased sensation in the right arm and a positive Babinski sign on the right side. MRI of the brain shows multiple periventricular white matter lesions consistent with demyelination.",
    "actual_diagnosis": "3. Multiple sclerosis, ICD-10 code G35"
  },
  {
    "doctor_vignette": "A 30-year-old female presents with muscle cramps and tingling in her fingers. On physical exam, she exhibits Chvostek's sign and Trousseau's sign. Laboratory tests reveal low serum calcium levels (6.5 mg/dL) and elevated phosphate levels (5.5 mg/dL).",
    "actual_diagnosis": "Hypoparathyroidism, ICD-10 code E20.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents to the emergency department with sudden onset shortness of breath and chest pain that worsens with deep breathing. On examination, she is tachypneic with decreased breath sounds on the right side and exhibits unilateral leg swelling. A CT pulmonary angiogram reveals a large pulmonary embolism in the right main pulmonary artery.",
    "actual_diagnosis": "2. Pulmonary embolism, ICD-10 code I26.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with fatigue and decreased appetite over the past few months. On physical examination, he has bilateral lower extremity edema and a blood pressure of 150/90 mmHg. Laboratory tests reveal a serum creatinine level of 2.1 mg/dL and a glomerular filtration rate (GFR) of 45 mL/min, indicating chronic kidney impairment.",
    "actual_diagnosis": "4. Chronic kidney disease, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with complaints of persistent headaches and occasional dizziness. On physical examination, his blood pressure is measured at 160/100 mmHg, and he exhibits mild bilateral edema in the lower extremities. Laboratory tests show normal renal function and no evidence of secondary causes of hypertension.",
    "actual_diagnosis": "5. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with chronic diarrhea and abdominal bloating for the past six months. On physical examination, she has noticeable weight loss and signs of malnutrition, including dry skin and hair loss. Serological tests reveal elevated levels of tissue transglutaminase antibodies (tTG-IgA), confirming the diagnosis.",
    "actual_diagnosis": "6. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 68-year-old female presents with a chief complaint of persistent lower back pain that worsens with standing. On physical exam, she has a height loss of 3 cm compared to her previous records and exhibits tenderness over the lumbar spine. A DEXA scan reveals a T-score of -2.8 in the lumbar spine, indicating osteoporosis.",
    "actual_diagnosis": "8. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 72-year-old male presents to the emergency department with palpitations and shortness of breath. Physical examination reveals an irregularly irregular pulse and elevated blood pressure of 160/95 mmHg. An EKG shows rapid atrial fibrillation with a ventricular rate of 120 bpm. Laboratory tests indicate elevated levels of B-type natriuretic peptide (BNP) at 500 pg/mL, suggesting heart strain.",
    "actual_diagnosis": "7. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 28-year-old woman presents with a chief complaint of persistent joint pain and fatigue for the past three months. On physical examination, she has a malar rash, oral ulcers, and swelling in her wrists and knees. Laboratory tests reveal positive antinuclear antibodies (ANA) and low complement levels, supporting the diagnosis.",
    "actual_diagnosis": "9. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with palpitations, weight loss despite increased appetite, and heat intolerance. On physical examination, she exhibits a fine tremor, tachycardia, and a diffusely enlarged thyroid gland. Laboratory tests reveal suppressed TSH levels with elevated free T4 and T3.",
    "actual_diagnosis": "10. Hyperthyroidism, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with a chief complaint of wheezing and shortness of breath, particularly at night and during physical activity. On physical examination, he exhibits prolonged expiratory phase and bilateral wheezing. A peak flow measurement reveals 60% of his personal best, indicating significant obstruction. No recent infections or other respiratory illnesses were noted, and chest X-ray shows hyperinflation consistent with asthma.",
    "actual_diagnosis": "11. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with increased thirst and frequent urination over the past few months. Physical examination reveals a BMI of 32, blood pressure of 140/85 mmHg, and diminished sensation in the feet. Laboratory results show a fasting blood glucose level of 180 mg/dL and an HbA1c of 8.2%.",
    "actual_diagnosis": "13. Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 62-year-old male presents to the emergency department with chest pain radiating to his left arm, which started 30 minutes ago. On examination, he is diaphoretic, with a blood pressure of 90/60 mmHg and heart rate of 110 bpm. ECG shows ST-segment elevation in leads II, III, and aVF, and cardiac troponin levels are markedly elevated. ",
    "actual_diagnosis": "14. Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 54-year-old female presents with a chief complaint of morning stiffness lasting over an hour, affecting her hands and wrists. Physical examination reveals symmetrical swelling and tenderness in the metacarpophalangeal joints, as well as decreased grip strength. Laboratory tests show a positive rheumatoid factor and elevated anti-CCP antibodies, along with an ESR of 45 mm/hr.",
    "actual_diagnosis": "12. Rheumatoid arthritis, ICD-10 code M06.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of tremors in his right hand that have progressively worsened over the past six months. Physical examination reveals bradykinesia, rigidity in the upper extremities, and a shuffling gait. A dopamine transporter (DAT) scan shows reduced uptake in the putamen, consistent with Parkinson's disease.",
    "actual_diagnosis": "15. Parkinson's disease, ICD-10 code G20"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of persistent, itchy red patches on her elbows and knees that have been worsening over the past month. Physical examination reveals well-defined, erythematous plaques covered with silvery scales on extensor surfaces and a few lesions on her scalp. No significant laboratory findings are noted, but a skin biopsy confirms the diagnosis of psoriasis.",
    "actual_diagnosis": "16. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 16-year-old female presents to the emergency department with a chief complaint of recurrent seizures over the past month. Physical examination reveals postictal confusion and no focal neurological deficits. An EEG shows generalized spike-and-wave discharges, consistent with epilepsy. MRI of the brain is unremarkable, ruling out structural causes.",
    "actual_diagnosis": "17. Epilepsy, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with widespread musculoskeletal pain lasting for over three months, accompanied by fatigue and sleep disturbances. Physical examination reveals tenderness in multiple trigger points, including the neck, shoulders, and lower back. Routine lab tests, including CBC and thyroid function, are unremarkable, and no imaging studies show structural abnormalities.",
    "actual_diagnosis": "19. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with gradually worsening peripheral vision over the last six months. On examination, intraocular pressure is measured at 24 mmHg in both eyes, and a visual field test reveals significant loss in the peripheral fields. Fundoscopic examination shows optic nerve cupping consistent with glaucoma.",
    "actual_diagnosis": "18. Glaucoma, ICD-10 code H40.9"
  },
  {
    "doctor_vignette": "An 8-year-old male presents with fatigue and pallor over the past month. Physical examination reveals significant splenomegaly and petechiae on the skin. Complete blood count shows leukocytosis with a high percentage of blast cells, along with low hemoglobin and platelets.",
    "actual_diagnosis": "Acute lymphoblastic leukemia, ICD-10 code C91.0"
  },
  {
    "doctor_vignette": "A 30-year-old female presents with a chief complaint of palpitations and unintentional weight loss over the past month. On physical examination, she exhibits a fine tremor, increased heart rate of 110 beats per minute, and a noticeable goiter. Thyroid function tests reveal a suppressed TSH level and elevated free T4 levels, confirming a diagnosis of hyperthyroidism.",
    "actual_diagnosis": "Hyperthyroidism, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 12-year-old African American male presents with severe abdominal pain and fatigue. On physical examination, he has pale conjunctiva and splenomegaly. A complete blood count reveals hemoglobin levels of 6.5 g/dL with a high reticulocyte count, and a peripheral blood smear shows sickle-shaped red blood cells.",
    "actual_diagnosis": "Sickle cell disease, ICD-10 code D57.1"
  },
  {
    "doctor_vignette": "A 32-year-old male presents with a persistent cough lasting three weeks, accompanied by night sweats and weight loss. On physical examination, there are decreased breath sounds and dullness to percussion on the right lower lung field. A chest X-ray reveals a right upper lobe infiltrate with cavitation, and sputum analysis shows acid-fast bacilli.",
    "actual_diagnosis": "Tuberculosis, ICD-10 code A15.9"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with progressive shortness of breath and a persistent dry cough over the past six months. On physical examination, there are fine inspiratory crackles noted bilaterally, and clubbing of the fingers is observed. A high-resolution CT scan of the chest reveals reticular opacities and honeycombing consistent with interstitial lung disease.",
    "actual_diagnosis": "Pulmonary fibrosis, ICD-10 code J84.10"
  },
  {
    "doctor_vignette": "A 12-year-old male presents with recurrent joint swelling and pain in his left knee after playing soccer. On physical examination, there is significant swelling and tenderness in the left knee joint, with a range of motion limited by pain. Lab tests reveal aPTT of 60 seconds (normal 30-40 seconds) and a normal PT, indicating a clotting factor deficiency. Genetic testing confirms a mutation in the F8 gene, consistent with Hemophilia A.",
    "actual_diagnosis": "20. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with chest pain and exertional dyspnea. On physical examination, he has a blood pressure of 140/90 mmHg, elevated BMI, and a third heart sound (S3) is noted. An ECG shows ST-segment depression, and a subsequent coronary angiogram reveals significant stenosis in the left anterior descending artery.",
    "actual_diagnosis": "Coronary artery disease, ICD-10 code I25.10"
  },
  {
    "doctor_vignette": "A 25-year-old female presents to the emergency department after ingesting a peanut butter cookie, complaining of difficulty breathing and swelling of the lips. On examination, she has hives covering her arms and torso, and her vital signs show hypotension with a blood pressure of 80/50 mmHg. A rapid response team notes significant bronchospasm on auscultation, and her oxygen saturation is at 85%.",
    "actual_diagnosis": "Anaphylaxis, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 22-year-old male presents to the emergency department with a chief complaint of severe headache and fever. On examination, he exhibits neck stiffness, photophobia, and a positive Brudzinski's sign. A lumbar puncture reveals cloudy cerebrospinal fluid with an elevated white blood cell count, predominantly neutrophils, and a positive Gram stain for Streptococcus pneumoniae.",
    "actual_diagnosis": "Bacterial meningitis, ICD-10 code A39.9"
  },
  {
    "doctor_vignette": "A 58-year-old male presents with increased thirst and frequent urination over the past month. Physical examination reveals a BMI of 32, and blood pressure is 145/90 mmHg. Laboratory tests show a fasting blood glucose level of 180 mg/dL and HbA1c of 8.5%.",
    "actual_diagnosis": "Diabetes mellitus type 2, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with persistent bone pain and fatigue over the past three months. On examination, he has notable tenderness in the lumbar region and pallor. Laboratory tests reveal a serum protein electrophoresis showing monoclonal spike (M-protein) and elevated serum creatinine levels. A skeletal survey demonstrates lytic bone lesions in the vertebrae.",
    "actual_diagnosis": "Multiple myeloma, ICD-10 code C90.0"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with a chief complaint of persistent heartburn and regurgitation after meals for the past three months. On physical examination, he is overweight with tenderness in the epigastric region but no rebound tenderness. An upper gastrointestinal endoscopy reveals moderate esophagitis, consistent with acid reflux disease.",
    "actual_diagnosis": "Acid reflux disease, ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with worsening asthma and new-onset purpura on his lower extremities. Physical examination reveals wheezing, nasal polyps, and tender subcutaneous nodules. Laboratory tests show eosinophilia and elevated ANCA (anti-neutrophil cytoplasmic antibodies) levels. A chest CT scan reveals bilateral pulmonary infiltrates.",
    "actual_diagnosis": "Churg-Strauss syndrome, ICD-10 code M30.1"
  },
  {
    "doctor_vignette": "A 72-year-old male presents with progressive memory loss and visual hallucinations, stating he frequently sees animals in his home. Physical examination reveals a shuffling gait and mild rigidity in the arms. Neuroimaging shows diffuse cortical atrophy with prominent changes in the occipital lobe. Cognitive testing indicates impaired executive function and attention.",
    "actual_diagnosis": "Dementia with Lewy bodies, ICD-10 code G31.83"
  },
  {
    "doctor_vignette": "A 24-year-old female with a history of type 1 diabetes presents with abdominal pain, nausea, and excessive thirst. On exam, she is tachycardic, has dry mucous membranes, and her breath has a fruity odor. Lab results reveal a blood glucose level of 450 mg/dL, arterial blood gas shows metabolic acidosis with a pH of 7.2, and urine analysis is positive for ketones.",
    "actual_diagnosis": "Diabetic ketoacidosis, ICD-10 code E11.10"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with difficulties in social interactions and a strong focus on collecting train schedules. Physical examination reveals normal growth parameters and no neurological deficits, but he avoids eye contact and struggles with understanding social cues. There are no significant lab or imaging findings, but a detailed developmental history indicates delayed social milestones.",
    "actual_diagnosis": "Asperger syndrome, ICD-10 code F84.5"
  },
  {
    "doctor_vignette": "A 62-year-old female presents with a chief complaint of swelling and pain in her right leg that developed over the past three days. On physical examination, there is notable unilateral edema in the right calf, with tenderness upon palpation and a positive Homan's sign. A Doppler ultrasound reveals a thrombus in the right popliteal vein, confirming the suspicion of deep vein thrombosis.",
    "actual_diagnosis": "Deep vein thrombosis, ICD-10 code I82.90"
  },
  {
    "doctor_vignette": "A 34-year-old male presents with progressive weakness in both legs over the past week, accompanied by tingling sensations and difficulty walking. On examination, he shows reduced deep tendon reflexes and ascending muscle weakness. Nerve conduction studies reveal significantly reduced motor nerve conduction velocities, and lumbar puncture indicates elevated protein levels with normal white cell counts in the cerebrospinal fluid.",
    "actual_diagnosis": "Guillain-Barré syndrome, ICD-10 code G61.0"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with acute left lower abdominal pain and fever. Physical examination reveals tenderness in the left lower quadrant with rebound tenderness and mild guarding. A CT scan of the abdomen shows inflamed diverticula in the sigmoid colon without abscess formation. Laboratory tests reveal leukocytosis with a white blood cell count of 14,000 cells/mm³.",
    "actual_diagnosis": "Diverticulitis, ICD-10 code K57.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with severe pelvic pain and dysmenorrhea that has worsened over the past year. On physical examination, there is tenderness in the posterior fornix and adnexal tenderness bilaterally. Transvaginal ultrasound reveals cystic lesions on the ovaries consistent with endometriomas. A pelvic MRI confirms the presence of endometrial tissue outside the uterus.",
    "actual_diagnosis": "Endometriosis, ICD-10 code N80.9"
  },
  {
    "doctor_vignette": "A 16-year-old female presents with complaints of inflamed, painful pimples on her face and back that have worsened over the past six months. On physical examination, multiple comedones, papules, and pustules are noted on the forehead, cheeks, and upper back. There are no significant lab or imaging results required for diagnosis as this condition is typically diagnosed clinically.",
    "actual_diagnosis": "Acne vulgaris, ICD-10 code L70.0"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of persistent dry cough and progressive shortness of breath over the past six months. On physical examination, bibasilar crackles are noted upon auscultation, and the patient demonstrates clubbing of the fingers. A chest CT scan reveals ground-glass opacities and reticular patterns consistent with interstitial lung disease.",
    "actual_diagnosis": "Interstitial lung disease, ICD-10 code J84.9"
  },
  {
    "doctor_vignette": "A 75-year-old female presents with progressive memory loss and difficulty performing daily tasks over the past year. On physical exam, she exhibits disorientation to time and place, and her Mini-Mental State Examination score is 22/30. MRI of the brain shows bilateral hippocampal atrophy, consistent with Alzheimer's disease.",
    "actual_diagnosis": "Dementia due to Alzheimer's disease, ICD-10 code G30.9"
  },
  {
    "doctor_vignette": "A 68-year-old female presents to the emergency department with a chief complaint of high fever and confusion for the past 24 hours. On examination, she is tachycardic, hypotensive, and exhibits altered mental status. Laboratory results show elevated white blood cell count (18,000 cells/mm³) and a positive blood culture for E. coli.",
    "actual_diagnosis": "Sepsis, ICD-10 code A41.9"
  },
  {
    "doctor_vignette": "A 27-year-old female presents with a chief complaint of abnormal vaginal discharge that has a fishy odor, particularly after intercourse. On physical examination, there is a thin, grayish discharge observed with a pH of 5.5 and a positive whiff test. Microscopic examination of the discharge reveals a significant presence of clue cells and a decrease in lactobacilli.",
    "actual_diagnosis": "Bacterial vaginosis, ICD-10 code N76.0"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with excessive daytime sleepiness and loud snoring reported by his partner. On physical examination, he has a body mass index (BMI) of 32, enlarged tonsils, and a crowded oropharynx. A sleep study reveals multiple episodes of apnea and hypopnea, confirming the diagnosis.",
    "actual_diagnosis": "Obstructive sleep apnea, ICD-10 code G47.33"
  },
  {
    "doctor_vignette": "A 35-year-old male from rural South America presents with fatigue, fever, and swollen lymph nodes. Physical examination reveals conjunctivitis and a notable cardiomegaly on chest X-ray. Serology testing shows positive results for Trypanosoma cruzi antibodies.",
    "actual_diagnosis": "Chagas disease, ICD-10 code B57.9"
  },
  {
    "doctor_vignette": "A 12-year-old male presents with a chief complaint of excessive thirst and frequent urination over the past month. Physical exam reveals signs of dehydration, including dry mucous membranes and decreased skin turgor. Critical lab results show a fasting blood glucose level of 250 mg/dL and the presence of ketones in the urine.",
    "actual_diagnosis": "Diabetes mellitus type 1, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 27-year-old female presents with fatigue and shortness of breath on exertion. On physical examination, she has pale conjunctiva and tachycardia. Laboratory tests reveal a hemoglobin level of 9.5 g/dL, a mean corpuscular volume of 70 fL, and low serum ferritin levels.",
    "actual_diagnosis": "Iron deficiency anemia, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with chest pain and shortness of breath on exertion. Physical examination reveals elevated blood pressure of 160/100 mmHg and bilateral pitting edema in the lower extremities. An echocardiogram shows left ventricular hypertrophy and reduced ejection fraction. Laboratory tests indicate elevated B-type natriuretic peptide (BNP) levels.",
    "actual_diagnosis": "Hypertensive heart disease, ICD-10 code I11.9"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with developmental delays and learning difficulties. On physical examination, he exhibits a long face, large ears, and hyperflexible joints. Genetic testing reveals a CGG repeat expansion in the FMR1 gene, consistent with Fragile X syndrome.",
    "actual_diagnosis": "Fragile X syndrome, ICD-10 code F84.81"
  },
  {
    "doctor_vignette": "A 4-year-old male presents with a 5-day history of fever, irritability, and a rash. On physical examination, he has conjunctival injection, strawberry tongue, and cervical lymphadenopathy. Laboratory tests reveal elevated inflammatory markers, including an increased C-reactive protein (CRP) and erythrocyte sedimentation rate (ESR).",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I38"
  },
  {
    "doctor_vignette": "A 28-year-old male presents with chronic low back pain and stiffness that improves with activity but worsens during rest. Physical examination reveals limited lumbar flexion and tenderness over the sacroiliac joints. X-rays show bilateral sacroiliitis, and HLA-B27 testing is positive.",
    "actual_diagnosis": "Ankylosing spondylitis, ICD-10 code M45.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of persistent fatigue and joint pain, particularly in her wrists and knees. On examination, she has palpable purpura on her lower extremities and mild edema. Laboratory tests reveal elevated ESR and CRP levels, alongside a positive ANCA test. Imaging studies show no evidence of vascular occlusion but suggest inflammation in the surrounding tissues.",
    "actual_diagnosis": "Vasculitis, unspecified, ICD-10 code M31.9"
  },
  {
    "doctor_vignette": "A 45-year-old woman presents with progressive shortness of breath on exertion and fatigue over the past six months. Physical examination reveals a loud P2 heart sound and peripheral edema. Echocardiography shows an estimated right ventricular systolic pressure of 45 mmHg, indicating elevated pulmonary artery pressure. A chest CT scan shows no significant pulmonary embolism, but mild enlargement of the right ventricle is noted.",
    "actual_diagnosis": "Pulmonary hypertension, ICD-10 code I27.0"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of recurrent severe headaches lasting 4 to 72 hours. Physical examination reveals tenderness in the pericranial muscles and normal neurological findings. No abnormalities are found in routine lab tests or brain imaging, which shows no acute changes.",
    "actual_diagnosis": "Migraine without aura, ICD-10 code G43.009"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with complaints of persistent skin tightening and difficulty swallowing. On physical exam, she exhibits thickened skin on her fingers and face, along with Raynaud's phenomenon. Laboratory tests reveal elevated anti-Scl-70 antibodies and pulmonary function tests indicate mild restrictive lung disease.",
    "actual_diagnosis": "Scleroderma, ICD-10 code M34.9"
  },
  {
    "doctor_vignette": "A 26-year-old female presents with recurrent painful nodules and abscesses in the axillary and groin areas over the past year. Physical examination reveals multiple draining sinuses, scarring, and inflammatory lesions in these regions. No laboratory abnormalities are noted, and imaging studies show subcutaneous inflammation without abscess formation.",
    "actual_diagnosis": "Hidradenitis suppurativa, ICD-10 code L73.2"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a palpable, painless nodule on the right side of her neck that has gradually increased in size over the past six months. Physical examination reveals a firm, non-tender mass in the right thyroid lobe, with no cervical lymphadenopathy noted. Ultrasound shows a solid, hypoechoic lesion measuring 2.5 cm with irregular margins, and fine needle aspiration cytology indicates suspicious for malignancy.",
    "actual_diagnosis": "Thyroid cancer, ICD-10 code C73"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with infertility and decreased libido. On physical examination, he is noted to have tall stature, gynecomastia, and reduced muscle mass. Laboratory tests reveal elevated serum estradiol levels and low testosterone levels, while karyotyping shows 47,XXY chromosomes.",
    "actual_diagnosis": "Klinefelter syndrome, ICD-10 code Q98.1"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with worsening muscle weakness, particularly in her eyelids and limbs, over the past month. On physical examination, she exhibits ptosis and significant fatigability with repetitive testing of the upper extremities. Serological testing reveals elevated acetylcholine receptor antibodies, supporting the diagnosis.",
    "actual_diagnosis": "Myasthenia gravis, ICD-10 code G70.00"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with fatigue, recurrent fevers, and easy bruising over the past month. Physical examination reveals pallor, petechiae on the lower extremities, and splenomegaly. Complete blood count shows a white blood cell count of 45,000/µL with 60% myeloblasts, hemoglobin of 8 g/dL, and platelet count of 30,000/µL.",
    "actual_diagnosis": "Acute myeloid leukemia, ICD-10 code C92.00"
  },
  {
    "doctor_vignette": "A 12-year-old male presents with excessive thirst, frequent urination, and unintentional weight loss over the past month. On physical examination, he is noted to have dry mucous membranes and a fruity odor on his breath. Critical lab results show a fasting blood glucose level of 250 mg/dL and an HbA1c of 10.5%.",
    "actual_diagnosis": "4. Type 1 diabetes mellitus, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with fatigue, joint pain, and a butterfly-shaped rash across her cheeks. On examination, there is tenderness and swelling in multiple joints, particularly the wrists and knees. Laboratory tests reveal a positive antinuclear antibody (ANA) test and low complement levels, consistent with an autoimmune process.",
    "actual_diagnosis": "7. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 67-year-old female presents with a chief complaint of worsening knee pain, particularly after prolonged standing and walking. On physical examination, there is noticeable crepitus, joint tenderness, and a decreased range of motion in the right knee. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "6. Osteoarthritis of the knee, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with complaints of persistent headaches and dizziness over the past month. On physical examination, his blood pressure is found to be 160/98 mmHg, with a notable finding of mild obesity. Routine laboratory tests show elevated serum creatinine levels at 1.4 mg/dL, suggesting possible kidney dysfunction related to hypertension.",
    "actual_diagnosis": "9. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 75-year-old male presents to the emergency department with palpitations and shortness of breath that began suddenly two hours ago. On examination, his heart rate is irregularly irregular at 120 beats per minute, and he has mild edema in his lower extremities. An electrocardiogram shows atrial fibrillation with a rapid ventricular response. Basic labs reveal an elevated B-type natriuretic peptide (BNP) level, indicating heart failure.",
    "actual_diagnosis": "5. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of persistent cough and shortness of breath, worsening over the last six months. Physical examination reveals wheezing, decreased breath sounds bilaterally, and a prolonged expiratory phase. A chest X-ray shows hyperinflation of the lungs, and spirometry indicates an FEV1/FVC ratio of 0.55, confirming airflow limitation.",
    "actual_diagnosis": "8. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with chronic diarrhea and abdominal bloating for the past six months. Physical examination reveals mild abdominal distension and tenderness in the left lower quadrant. Laboratory tests show positive tissue transglutaminase (tTG) antibodies and a low hemoglobin level indicating anemia.",
    "actual_diagnosis": "11. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with a chief complaint of severe pain and swelling in his right big toe, which started suddenly last night. On physical examination, the affected joint is erythematous, warm, and tender to touch, with a limited range of motion. Serum uric acid levels are found to be elevated at 8.5 mg/dL, confirming the suspicion of gout.",
    "actual_diagnosis": "14. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 72-year-old female presents with worsening shortness of breath and fatigue over the past month. Physical examination reveals bilateral lower extremity edema, an elevated jugular venous pressure, and crackles on lung auscultation. A chest X-ray shows cardiomegaly and pulmonary congestion, while laboratory tests reveal elevated B-type natriuretic peptide (BNP) levels.",
    "actual_diagnosis": "10. Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of itchy, scaly patches on her elbows and knees that have worsened over the past month. On physical examination, there are well-defined, erythematous plaques covered with silvery scales on the extensor surfaces. No significant laboratory abnormalities were noted, and a skin biopsy confirms the presence of psoriatic changes.",
    "actual_diagnosis": "12. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with severe epigastric pain radiating to the back, accompanied by nausea and vomiting. On physical examination, he exhibits tenderness in the upper abdomen and a slightly elevated heart rate. Laboratory tests reveal elevated serum lipase and amylase levels, while an abdominal ultrasound shows peritoneal fluid and an enlarged pancreas.",
    "actual_diagnosis": "13. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with a chief complaint of unintentional weight loss and palpitations over the past month. Physical examination reveals a finely tremulous hand, moist skin, and a markedly enlarged thyroid gland (goiter). Laboratory tests show elevated free T4 and suppressed TSH levels, indicating hyperthyroidism.",
    "actual_diagnosis": "15. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with recurrent episodes of vertigo lasting 20-30 minutes, accompanied by tinnitus and a sensation of fullness in her left ear. On physical examination, she demonstrates nystagmus during the episodes and reports fluctuating hearing loss in the affected ear. An audiogram reveals low-frequency hearing loss consistent with endolymphatic hydrops, while MRI of the brain shows no other abnormalities.",
    "actual_diagnosis": "16. Ménière's disease, ICD-10 code H81.0"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with fatigue and weakness over the past month. Physical examination reveals pallor and mild splenomegaly. Laboratory tests show a hemoglobin level of 10 g/dL, elevated C-reactive protein, and low serum iron with normal ferritin levels, indicating anemia of chronic disease.",
    "actual_diagnosis": "17. Anemia due to chronic disease, ICD-10 code D63.8"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with widespread musculoskeletal pain lasting for more than three months, accompanied by fatigue and sleep disturbances. Physical examination reveals tenderness in multiple trigger points and a reduced range of motion in her shoulders and hips. Laboratory tests, including complete blood count and inflammatory markers, return normal, ruling out other conditions.",
    "actual_diagnosis": "18. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 12-year-old African American male presents to the emergency department with severe abdominal pain and fatigue. Physical examination reveals pallor, jaundice, and splenomegaly. Laboratory tests show a hemoglobin level of 6.5 g/dL, elevated reticulocyte count, and peripheral blood smear reveals sickle-shaped red blood cells.",
    "actual_diagnosis": "20. Sickle cell disease, ICD-10 code D57.1"
  },
  {
    "doctor_vignette": "A 67-year-old female presents with a complaint of persistent lower back pain that has worsened over the past month. Physical examination reveals a decrease in height and a kyphotic posture. A DEXA scan shows a T-score of -2.8 at the lumbar spine, indicating significant bone density loss. Laboratory tests reveal normal calcium and vitamin D levels.",
    "actual_diagnosis": "21. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with a chief complaint of intense itching and dry patches on her hands and elbows. On physical examination, there are erythematous, scaly lesions with crusting and lichenification noted in the affected areas. No specific lab tests are needed for diagnosis, but a skin scraping shows no evidence of fungal infection.",
    "actual_diagnosis": "22. Eczema, ICD-10 code L30.9"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with a chief complaint of worsening left lower abdominal pain for two days, associated with fever and nausea. On physical examination, he has tenderness in the left lower quadrant with rebound tenderness and guarding. A CT scan of the abdomen reveals inflamed diverticula and pericolic fat stranding, consistent with diverticulitis.",
    "actual_diagnosis": "23. Diverticulitis, ICD-10 code K57.9"
  },
  {
    "doctor_vignette": "A 14-year-old female presents to the emergency department with wheezing and shortness of breath after playing soccer. On physical examination, she exhibits use of accessory muscles for breathing and diffuse wheezing is heard on auscultation. A peak flow measurement reveals a score of 60% of her personal best, indicating significant airflow obstruction. Chest X-ray shows no acute abnormalities, ruling out other causes of her symptoms.",
    "actual_diagnosis": "19. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 58-year-old male presents with complaints of chest pain and shortness of breath on exertion. Physical exam reveals elevated blood pressure of 160/100 mmHg, a displaced apex beat, and mild bilateral pedal edema. An echocardiogram shows left ventricular hypertrophy and wall motion abnormalities, while lab tests indicate elevated BNP levels.",
    "actual_diagnosis": "25. Hypertensive heart disease, ICD-10 code I11.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with severe pelvic pain and dysmenorrhea that has worsened over the past year. On physical examination, tenderness is noted in the lower abdominal region, and a bimanual exam reveals nodules in the posterior fornix. Ultrasound shows cystic lesions on the ovaries suggestive of endometriomas. Serum CA-125 levels are elevated, supporting the suspicion of endometriosis.",
    "actual_diagnosis": "24. Endometriosis, ICD-10 code N80.9"
  },
  {
    "doctor_vignette": "A 5-year-old male presents with parental concerns about delayed speech and lack of social interactions. Physical examination reveals a lack of eye contact and repetitive hand movements. Developmental assessment indicates significantly delayed language skills, particularly in expressive communication. No abnormalities were found on hearing tests or metabolic screening.",
    "actual_diagnosis": "Autism spectrum disorder, ICD-10 code F84.0"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of decreased urine output over the past three days. Physical examination reveals mild edema in the lower extremities and elevated blood pressure. Laboratory results show elevated serum creatinine levels at 3.2 mg/dL and a BUN of 45 mg/dL, indicating acute renal impairment.",
    "actual_diagnosis": "Acute kidney injury, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 55-year-old female presents with persistent bilateral joint pain and swelling, particularly in the hands and wrists, lasting for over six weeks. On physical examination, there is notable tenderness and morning stiffness lasting more than an hour. Laboratory tests reveal elevated rheumatoid factor and anti-CCP antibodies, along with elevated ESR and CRP levels.",
    "actual_diagnosis": "Rheumatoid arthritis, ICD-10 code M06.9"
  },
  {
    "doctor_vignette": "A 52-year-old female presents with persistent dryness of the mouth and eyes, reporting difficulty swallowing and a gritty sensation in her eyes. Physical examination reveals bilateral parotid gland enlargement and decreased tear production on Schirmer's test. Laboratory results show positive anti-Ro (SSA) antibodies and elevated erythrocyte sedimentation rate (ESR).",
    "actual_diagnosis": "Sjogren's syndrome, ICD-10 code M35.0"
  },
  {
    "doctor_vignette": "A 28-year-old woman presents with joint pain and a facial rash that worsens in sunlight. Upon examination, she has a malar rash and tenderness in multiple joints, including the wrists and knees. Laboratory tests reveal positive antinuclear antibodies (ANA) and elevated anti-double-stranded DNA antibodies. Urinalysis shows mild proteinuria, suggesting possible kidney involvement.",
    "actual_diagnosis": "Lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of weight gain and fatigue over the past six months. Physical examination reveals a rounded face, thin skin with easy bruising, and abdominal striae. Laboratory tests show elevated cortisol levels and a 24-hour urinary free cortisol level significantly above normal ranges.",
    "actual_diagnosis": "Cushing's syndrome, ICD-10 code E24.9"
  },
  {
    "doctor_vignette": "A 22-year-old male presents to the emergency department with a 24-hour history of worsening right lower abdominal pain, associated with nausea and loss of appetite. On physical examination, he has tenderness in the right lower quadrant with rebound tenderness and guarding. A CT scan of the abdomen shows an enlarged, fluid-filled appendix with surrounding inflammation, confirming the diagnosis.",
    "actual_diagnosis": "Acute appendicitis, ICD-10 code K35.2"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with recurrent episodes of vertigo lasting several hours, accompanied by tinnitus and a sensation of fullness in the left ear. On physical examination, she shows unsteadiness during the Romberg test. Audiometry reveals a low-frequency hearing loss in the left ear. MRI of the brain is unremarkable, ruling out other causes of her symptoms.",
    "actual_diagnosis": "Meniere's disease, ICD-10 code H81.0"
  },
  {
    "doctor_vignette": "A 58-year-old male presents to the emergency department with sudden onset shortness of breath and chest pain that worsens with deep breathing. On examination, he is tachycardic and has decreased breath sounds on the right side. A chest CT angiogram reveals a large pulmonary embolism in the right main pulmonary artery. Arterial blood gas analysis shows hypoxemia with a low PaO2.",
    "actual_diagnosis": "Pulmonary embolism, ICD-10 code I26.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with complaints of intermittent numbness and tingling in her right arm and leg over the past month. On physical examination, she demonstrates a positive Babinski sign and ataxia in her right limb. MRI of the brain reveals multiple demyelinating lesions in the periventricular white matter. Cerebrospinal fluid analysis shows oligoclonal bands, supporting the diagnosis.",
    "actual_diagnosis": "Multiple sclerosis, ICD-10 code G35"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with unintentional weight loss, palpitations, and increased anxiety. On examination, she exhibits a diffusely enlarged thyroid gland, exophthalmos, and brisk deep tendon reflexes. Laboratory tests reveal elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "Graves' disease, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with complaints of multiple skin lesions and recurrent headaches. Physical examination reveals café-au-lait spots scattered across her torso and axillary freckling. Additionally, a palpable neurofibroma is noted on her left flank. MRI of the brain shows no abnormalities, but the characteristic skin findings are suggestive of neurofibromatosis type 1.",
    "actual_diagnosis": "Neurofibromatosis type 1, ICD-10 code Q85.00"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of severe right upper quadrant pain that began suddenly after a fatty meal. On physical examination, she exhibits tenderness and guarding in the right upper quadrant, with a positive Murphy's sign. Ultrasound reveals gallbladder wall thickening and pericholecystic fluid, indicative of inflammation. Laboratory tests show elevated white blood cell count and elevated liver enzymes.",
    "actual_diagnosis": "Acute cholecystitis, ICD-10 code K81.0"
  },
  {
    "doctor_vignette": "A 22-year-old male presents with complaints of recurrent chest pain and palpitations. Physical examination reveals tall stature, long limbs, and arachnodactyly, along with a significant murmur suggestive of aortic regurgitation. An echocardiogram shows dilation of the aortic root and mitral valve prolapse, confirming the suspected diagnosis.",
    "actual_diagnosis": "Marfan syndrome, ICD-10 code Q87.40"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with chronic knee pain, particularly worsening with activity and improved with rest. On physical examination, there is noticeable joint swelling, crepitus, and reduced range of motion in the right knee. X-rays reveal joint space narrowing and osteophyte formation, consistent with degenerative changes.",
    "actual_diagnosis": "Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "A 58-year-old male presents with fatigue and jaundice. On physical examination, he has notable ascites and spider angiomata. Liver function tests reveal elevated AST and ALT levels, with a low platelet count. An abdominal ultrasound shows hepatic steatosis and signs of portal hypertension.",
    "actual_diagnosis": "Chronic liver disease, ICD-10 code K74.60"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with persistent fatigue and bone pain, particularly in the lower back. On physical examination, there is tenderness over the lumbar spine and decreased range of motion. Laboratory tests reveal a serum protein electrophoresis showing a monoclonal spike in IgG, and a bone marrow biopsy confirms over 30% clonal plasma cells.",
    "actual_diagnosis": "Multiple myeloma, ICD-10 code C90.00"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with a chief complaint of worsening abdominal pain and a noticeable bulge in the right groin area for the past week. On physical examination, a palpable, reducible mass is found in the right inguinal region, which increases in size upon coughing. An abdominal ultrasound reveals a hernia sac without any signs of incarceration or strangulation.",
    "actual_diagnosis": "Hernia, unspecified, ICD-10 code K44.9"
  },
  {
    "doctor_vignette": "A 16-year-old male presents with delayed puberty and concerns about his height. On physical examination, he is noted to be 6 feet tall with gynecomastia and reduced testicular size. Laboratory tests reveal low testosterone levels and elevated luteinizing hormone (LH) and follicle-stimulating hormone (FSH). A karyotype analysis shows the presence of an extra X chromosome, confirming the diagnosis.",
    "actual_diagnosis": "Klinefelter syndrome, ICD-10 code Q98.0"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of persistent cough and difficulty breathing for the past week. On physical examination, he has decreased breath sounds on the right side and dullness to percussion. A chest X-ray reveals a right lower lobe opacity consistent with pneumonia. Laboratory tests show elevated white blood cell count and elevated C-reactive protein.",
    "actual_diagnosis": "Pneumonia due to unspecified organism, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with a chief complaint of unintentional weight loss and increased anxiety over the past month. On examination, she has a fine tremor in her hands, a rapid heart rate of 110 beats per minute, and prominent exophthalmos. Laboratory tests reveal elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "4. Hyperthyroidism, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with fatigue and swelling in his legs. On physical examination, he has bilateral lower extremity edema and a blood pressure of 150/90 mmHg. Laboratory results reveal a serum creatinine level of 2.5 mg/dL, and a urinalysis shows proteinuria. The patient's history includes type 2 diabetes and hypertension.",
    "actual_diagnosis": "5. Chronic kidney disease, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 75-year-old male presents with increasing shortness of breath and fatigue during exertion over the past few months. On physical examination, a harsh systolic ejection murmur is auscultated at the right second intercostal space, with a diminished carotid pulse. An echocardiogram reveals severe aortic stenosis with a valve area of 0.7 cm² and significant left ventricular hypertrophy.",
    "actual_diagnosis": "Aortic stenosis, ICD-10 code I35.0"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with persistent abdominal pain and weight loss over the past six months. On physical examination, he has tenderness in the upper abdomen and signs of malnutrition. Laboratory tests reveal elevated serum lipase levels and a CT scan shows calcifications in the pancreas. The patient has a history of heavy alcohol use, which is significant for his condition.",
    "actual_diagnosis": "Chronic pancreatitis, ICD-10 code K86.1"
  },
  {
    "doctor_vignette": "A 72-year-old male presents to the emergency department with palpitations and shortness of breath that started suddenly. On physical examination, he is found to have an irregularly irregular pulse at 120 beats per minute and mild bilateral lower extremity edema. An ECG reveals atrial fibrillation with a rapid ventricular response, and a chest X-ray shows mild cardiomegaly.",
    "actual_diagnosis": "6. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of persistent knee pain, especially during activities such as climbing stairs and prolonged sitting. On physical examination, there is notable crepitus and tenderness over the medial joint line of the right knee, with limited range of motion. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "7. Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with persistent abdominal bloating and diarrhea for the past six months. Physical examination reveals signs of malnutrition, including weight loss and pallor. Serologic tests show elevated tissue transglutaminase (tTG) IgA antibodies and a low hemoglobin level. Endoscopy reveals villous atrophy in the duodenum.",
    "actual_diagnosis": "8. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with fatigue, joint pain, and a butterfly-shaped rash across her cheeks. On physical examination, she has bilateral swelling of the wrists and knees, as well as oral ulcers. Laboratory tests reveal positive antinuclear antibodies (ANA) and low complement levels (C3 and C4).",
    "actual_diagnosis": "10. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with auditory hallucinations and persistent delusions of persecution. On examination, he appears disheveled, has poor eye contact, and demonstrates disorganized thinking. Routine lab tests are unremarkable, and a brain MRI shows no structural abnormalities.",
    "actual_diagnosis": "9. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a chief complaint of widespread musculoskeletal pain lasting over six months, accompanied by fatigue and sleep disturbances. Physical examination reveals tenderness in multiple trigger points and a body mass index within the normal range. Laboratory tests show normal complete blood count and metabolic panel, with no signs of inflammation or other underlying conditions.",
    "actual_diagnosis": "13. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 15-year-old male presents with polyuria, excessive thirst, and unexplained weight loss over the past month. On examination, he is found to be dehydrated with a blood pressure of 100/60 mmHg and a heart rate of 110 bpm. Laboratory tests reveal a blood glucose level of 350 mg/dL and ketones in the urine, indicating diabetic ketoacidosis.",
    "actual_diagnosis": "12. Type 1 diabetes mellitus, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with fatigue and pallor. On physical examination, she has conjunctival pallor and a heart rate of 100 beats per minute. Laboratory tests reveal a hemoglobin level of 9.5 g/dL and a low serum ferritin of 10 ng/mL.",
    "actual_diagnosis": "17. Iron deficiency anemia, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with persistent fatigue and unintentional weight loss over the past three months. Physical examination reveals lymphadenopathy in the cervical and axillary regions, along with splenomegaly. A CT scan of the abdomen shows multiple enlarged lymph nodes, and a biopsy confirms the presence of atypical lymphoid cells.",
    "actual_diagnosis": "16. Non-Hodgkin lymphoma, ICD-10 code C85.90"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of red, scaly patches on her elbows and knees that have persisted for several months. On physical exam, there are well-defined plaques with silvery scales and some areas of erythema. No significant lab results are noted, but a skin biopsy confirms the diagnosis of psoriasis.",
    "actual_diagnosis": "18. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 32-year-old male presents with severe abdominal pain that started suddenly after a heavy meal. On examination, he has tenderness in the epigastric region and guarding. Laboratory tests reveal elevated serum amylase and lipase levels, and an abdominal ultrasound shows inflammation of the pancreas with no evidence of gallstones. ",
    "actual_diagnosis": "19. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with joint hypermobility and recurrent joint dislocations, particularly in her shoulders and knees. On physical exam, she exhibits skin that is velvety and hyper-elastic, along with visible bruising and scarring. A genetic test reveals a mutation in the COL5A1 gene, confirming the diagnosis.",
    "actual_diagnosis": "20. Ehlers-Danlos syndrome, ICD-10 code Q79.6"
  },
  {
    "doctor_vignette": "A 58-year-old female presents with recurrent headaches and episodes of dizziness over the past month. On physical examination, she has a palpable splenomegaly. Laboratory tests reveal an elevated platelet count of 1,200,000/µL and normal white blood cell and hemoglobin levels. Bone marrow biopsy shows hypercellularity with increased megakaryocytes, consistent with myeloproliferative neoplasm.",
    "actual_diagnosis": "Essential thrombocythemia, ICD-10 code D75.81"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of persistent shortness of breath and a chronic cough producing sputum for the past few months. On physical examination, he exhibits wheezing, decreased breath sounds bilaterally, and a barrel-shaped chest. A chest X-ray reveals hyperinflated lungs, and spirometry shows a reduced FEV1/FVC ratio consistent with obstructive lung disease.",
    "actual_diagnosis": "15. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 5-year-old female presents with a chief complaint of itchy, red patches on her elbows and knees. On physical examination, there are well-defined, erythematous plaques with overlying scale and excoriations. There are no significant laboratory results, as the diagnosis is made clinically based on the characteristic appearance and distribution of the rash.",
    "actual_diagnosis": "Eczema, ICD-10 code L30.9"
  },
  {
    "doctor_vignette": "A 17-year-old female presents with a chief complaint of significant weight loss over the past three months, reporting a current weight of 85 pounds with a height of 5'5\". Physical examination reveals bradycardia, lanugo, and a body mass index (BMI) of 14.2. Laboratory tests show electrolyte imbalances, including hypokalemia and hyponatremia, with normal thyroid function tests.",
    "actual_diagnosis": "Anorexia nervosa, ICD-10 code F50.01"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with gradual vision loss in her peripheral fields over the past few months. On examination, her intraocular pressure is measured at 28 mmHg bilaterally, and a visual field test reveals significant peripheral vision loss. Fundoscopic examination shows cupping of the optic discs, indicating possible glaucomatous changes.",
    "actual_diagnosis": "Glaucoma, ICD-10 code H40.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of persistent heartburn and regurgitation occurring several times a week. Physical examination reveals mild epigastric tenderness but no signs of acute distress. An upper gastrointestinal endoscopy shows evidence of esophagitis and the presence of reflux. No additional lab tests are necessary, as the history and endoscopic findings are consistent with GERD.",
    "actual_diagnosis": "Acid reflux disease (GERD), ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 30-year-old female presents with fatigue and pallor. On physical examination, she has conjunctival pallor and a heart rate of 100 bpm. Laboratory tests reveal a hemoglobin level of 9.0 g/dL and a mean corpuscular volume of 75 fL, indicating microcytic anemia. Iron studies show low serum ferritin and low serum iron levels.",
    "actual_diagnosis": "Anemia, ICD-10 code D64.9"
  },
  {
    "doctor_vignette": "A 5-year-old female presents with a chief complaint of persistent shortness of breath during play. Physical examination reveals a noticeable cyanosis of the lips and fingertips, a heart murmur, and tachycardia. An echocardiogram shows a ventricular septal defect with right-to-left shunting and pulmonary artery hypoplasia. Chest X-ray indicates cardiomegaly and decreased pulmonary vascular markings.",
    "actual_diagnosis": "Rare congenital heart defect, ICD-10 code Q24.9"
  },
  {
    "doctor_vignette": "A 58-year-old male presents with jaundice and fatigue. Physical examination reveals ascites, spider angiomata, and palmar erythema. Laboratory tests show elevated liver enzymes (ALT and AST), low platelet count, and a serum albumin level of 2.5 g/dL. Ultrasound of the abdomen reveals a nodular liver consistent with cirrhosis.",
    "actual_diagnosis": "Cirrhosis of the liver, ICD-10 code K74.60"
  },
  {
    "doctor_vignette": "An 82-year-old female presents with increasing forgetfulness and difficulty performing daily activities over the past year. On physical examination, she demonstrates disorientation to time and place, and has trouble recalling recent events. Cognitive assessment reveals moderate impairment in memory and judgment. MRI shows mild cortical atrophy consistent with neurodegenerative changes.",
    "actual_diagnosis": "Dementia, ICD-10 code F03.90"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with fatigue and swelling in her legs. Physical examination reveals bilateral lower extremity edema and hypertension. Laboratory tests show a serum creatinine level of 2.1 mg/dL and an estimated glomerular filtration rate (eGFR) of 45 mL/min.",
    "actual_diagnosis": "Chronic kidney disease, stage 3, ICD-10 code N18.3"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with fatigue and pallor. On physical examination, she has conjunctival pallor and a heart rate of 100 beats per minute. Laboratory tests reveal a hemoglobin level of 8.5 g/dL and a mean corpuscular volume (MCV) of 75 fL, indicating microcytic anemia. Iron studies show low serum ferritin and transferrin saturation.",
    "actual_diagnosis": "Anemia, unspecified, ICD-10 code D64.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of worsening cough and fever for three days. Physical examination reveals decreased breath sounds and crackles in the right lower lung field. Chest X-ray shows right lower lobe consolidation, and a complete blood count indicates leukocytosis with a left shift.",
    "actual_diagnosis": "Pneumonia, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with a chief complaint of persistent headaches and fatigue. On physical examination, his blood pressure is measured at 160/100 mmHg, and he exhibits mild edema in the lower extremities. Laboratory results show normal renal function but elevated serum cholesterol levels.",
    "actual_diagnosis": "1. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 58-year-old female presents with increased thirst and frequent urination for the past month. On physical examination, she is overweight with a BMI of 32, and her blood pressure is 145/90 mmHg. Laboratory results show a fasting blood glucose level of 190 mg/dL and HbA1c of 8.5%.",
    "actual_diagnosis": "2. Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with a chief complaint of itchy, red patches on his elbows and knees that have been worsening over the past month. Physical examination reveals well-defined, erythematous plaques covered with silvery scales on the extensor surfaces. There are no significant lab findings, but a thorough skin examination confirms the characteristic appearance of psoriasis.",
    "actual_diagnosis": "5. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with worsening shortness of breath and a chronic productive cough. On physical examination, he exhibits wheezing and decreased breath sounds bilaterally. A chest X-ray shows hyperinflation of the lungs, and pulmonary function tests reveal a reduced FEV1/FVC ratio consistent with obstructive lung disease.",
    "actual_diagnosis": "3. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with persistent knee pain that worsens with activity and improves with rest. On physical examination, there is crepitus and limited range of motion in the right knee, along with tenderness along the joint line. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "4. Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with chronic diarrhea, abdominal bloating, and fatigue for the past six months. Physical examination reveals a distended abdomen and signs of malnutrition, including dry skin and hair loss. Lab results show elevated tissue transglutaminase antibodies (tTG-IgA) and a low hemoglobin level, indicating anemia.",
    "actual_diagnosis": "7. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 58-year-old male presents to the emergency department with severe chest pain radiating to his left arm and shortness of breath. On physical examination, he is diaphoretic and has a blood pressure of 90/60 mmHg with a heart rate of 110 bpm. An ECG shows ST-segment elevation in the inferior leads, and cardiac troponin levels are markedly elevated at 3.5 ng/mL. ",
    "actual_diagnosis": "6. Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 5-year-old male presents with recurrent joint swelling and pain in the knees after minor injuries. Physical examination reveals significant swelling and tenderness in both knees with limited range of motion. Laboratory tests show a prolonged activated partial thromboplastin time (aPTT) and normal prothrombin time (PT), indicating a coagulopathy. The factor VIII level is markedly low, confirming the diagnosis.",
    "actual_diagnosis": "9. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 54-year-old female presents with complaints of dry mouth and dry eyes for the past six months. On examination, there is reduced salivary flow and bilateral conjunctival injection. Lab tests reveal positive anti-SSA/Ro antibodies and a Schirmer test showing less than 5 mm of tear production in 5 minutes, consistent with aqueous tear deficiency.",
    "actual_diagnosis": "10. Sjögren's syndrome, ICD-10 code M35.0"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with a sudden onset of severe pain and swelling in his right big toe, which began overnight. On examination, the affected joint is erythematous, warm, and tender to touch. Serum uric acid levels are notably elevated at 8.5 mg/dL, and joint aspiration reveals needle-shaped monosodium urate crystals under polarized light microscopy.",
    "actual_diagnosis": "11. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "An 8-year-old male presents with difficulty focusing in school, frequently interrupts classmates, and struggles to complete homework. On examination, he exhibits fidgeting behaviors and an inability to sit still. There are no significant physical abnormalities, and behavioral assessments indicate a high level of impulsivity and inattention. Teacher reports corroborate symptoms with consistent observations of hyperactivity and distractibility during classroom activities.",
    "actual_diagnosis": "12. Attention-deficit hyperactivity disorder, ICD-10 code F90.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with persistent fatigue and recurrent infections over the past month. Physical examination reveals pallor and petechiae on her lower extremities. Complete blood count shows leukopenia, thrombocytopenia, and a markedly low hemoglobin level of 7 g/dL, with a bone marrow biopsy indicating hypoplastic marrow.",
    "actual_diagnosis": "14. Aplastic anemia, ICD-10 code D61.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with fatigue, weight gain, and cold intolerance over the past six months. On physical examination, she has dry skin, bradycardia, and myxedema. Laboratory tests reveal elevated TSH levels (12 mIU/L) and low free T4 levels (0.6 ng/dL), confirming the diagnosis.",
    "actual_diagnosis": "13. Hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of joint pain and swelling, particularly in her hands and knees. On physical examination, she exhibits a malar rash, oral ulcers, and signs of arthritis in multiple joints. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated anti-double-stranded DNA antibodies, along with a low complement level.",
    "actual_diagnosis": "8. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 30-year-old female presents with sudden onset of right-sided facial drooping and inability to close her right eye. On examination, she shows weakness in the right side of her face, with a flattened nasolabial fold and inability to smile on that side. Neurological examination is otherwise normal, and a CT scan of the head is unremarkable, ruling out other causes.",
    "actual_diagnosis": "15. Bell's palsy, ICD-10 code G51.0"
  },
  {
    "doctor_vignette": "A 15-year-old female presents with recurrent joint dislocations and skin that is unusually stretchy. On physical examination, she exhibits hypermobile joints and a velvety skin texture with easy bruising. Genetic testing reveals a mutation associated with Ehlers-Danlos syndrome.",
    "actual_diagnosis": "17. Ehlers-Danlos syndrome, ICD-10 code Q79.6"
  },
  {
    "doctor_vignette": "A 68-year-old female presents with a chief complaint of persistent back pain and height loss over the past year. Physical examination reveals a decreased spinal range of motion and tenderness in the lumbar region. A DEXA scan shows a T-score of -2.8, indicating severe osteoporosis.",
    "actual_diagnosis": "19. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with a productive cough and frequent respiratory infections. Physical examination reveals digital clubbing and wheezing on auscultation, along with abdominal distension. Sweat chloride testing shows elevated levels of 90 mmol/L, indicating cystic fibrosis.",
    "actual_diagnosis": "20. Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of persistent heartburn and regurgitation occurring after meals. Physical examination reveals mild epigastric tenderness, but no signs of acute distress. An upper gastrointestinal endoscopy shows esophagitis and a 24-hour pH monitoring confirms excessive acid exposure in the esophagus.",
    "actual_diagnosis": "Gastroesophageal reflux disease, ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with progressive muscle weakness and difficulty speaking over the past six months. Physical examination reveals fasciculations in the tongue and atrophy of the hand muscles, with hyperreflexia noted in the upper extremities. An electromyogram (EMG) shows evidence of widespread denervation and reinnervation, confirming lower motor neuron involvement.",
    "actual_diagnosis": "Amyotrophic lateral sclerosis, ICD-10 code G12.21"
  },
  {
    "doctor_vignette": "A 34-year-old male presents with severe abdominal pain radiating to the back, accompanied by nausea and vomiting. On physical examination, he exhibits tenderness in the upper abdomen and a mildly distended abdomen. Laboratory tests reveal elevated serum amylase and lipase levels, and an abdominal ultrasound shows evidence of pancreatic inflammation.",
    "actual_diagnosis": "16. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 24-year-old female presents with worsening muscle weakness, particularly in her eyelids and limbs, over the past month. On physical examination, she exhibits ptosis and diplopia, with a notable increase in weakness after prolonged activity. A serum acetylcholine receptor antibody test returns positive, confirming the diagnosis.",
    "actual_diagnosis": "18. Myasthenia gravis, ICD-10 code G70.00"
  },
  {
    "doctor_vignette": "A 30-year-old woman presents with persistent fatigue, weight loss, and increased pigmentation of the skin. On physical exam, she has low blood pressure and hyperpigmented patches on her elbows and knees. Laboratory tests reveal hyponatremia, hyperkalemia, and an elevated ACTH level with low cortisol levels. These findings are suggestive of adrenal insufficiency.",
    "actual_diagnosis": "Addison's disease, ICD-10 code E27.1"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of persistent cough and fever for three days. On physical examination, he exhibits decreased breath sounds in the right lower lung field and crackles upon auscultation. A chest X-ray reveals a right lower lobe infiltrate, and laboratory tests show elevated white blood cell count with a left shift.",
    "actual_diagnosis": "Pneumonia, unspecified, ICD-10 code J18.9"
  },
  {
    "doctor_vignette": "A 24-year-old female presents with a 3-month history of intermittent abdominal pain, diarrhea, and weight loss of 10 pounds. Physical examination reveals tenderness in the right lower quadrant and a palpable mass. Laboratory tests show elevated C-reactive protein (CRP) levels and anemia. An abdominal MRI demonstrates thickening of the ileal wall with skip lesions consistent with Crohn's disease.",
    "actual_diagnosis": "Crohn's disease, ICD-10 code K50.90"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with fatigue and jaundice. On physical examination, he has scleral icterus and hepatomegaly. Laboratory tests reveal elevated liver enzymes (ALT 150 U/L, AST 180 U/L) and positive HCV RNA with a high viral load. Liver function tests indicate a low platelet count of 120,000/mm³.",
    "actual_diagnosis": "Hepatitis C, chronic, ICD-10 code B18.2"
  },
  {
    "doctor_vignette": "A 22-year-old male presents with a chief complaint of severe headache and fever for the past two days. Physical examination reveals neck stiffness, photophobia, and a positive Brudzinski's sign. Lumbar puncture shows elevated white blood cell count with a predominance of neutrophils and a low glucose level, consistent with bacterial meningitis.",
    "actual_diagnosis": "Bacterial meningitis, unspecified, ICD-10 code G00.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with a chief complaint of a dull, bilateral headache that has persisted for the last three days. Physical examination reveals tenderness in the pericranial muscles and no neurological deficits. Vital signs are normal, and a CT scan of the head shows no acute abnormalities.",
    "actual_diagnosis": "Tension-type headache, ICD-10 code G44.2"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with fatigue and swelling in his legs. Physical examination reveals bilateral pedal edema and decreased urine output. Laboratory tests show a serum creatinine level of 8.5 mg/dL and a glomerular filtration rate (GFR) of 10 mL/min, indicating severely reduced kidney function.",
    "actual_diagnosis": "End-stage renal disease, ICD-10 code N18.6"
  },
  {
    "doctor_vignette": "A 55-year-old female presents with sudden onset of right leg swelling and pain after a long-haul flight. On examination, there is significant edema and tenderness in the right calf, with a positive Homan's sign. Doppler ultrasound reveals a right popliteal vein thrombus. D-dimer levels are markedly elevated, indicating a possible thrombotic event.",
    "actual_diagnosis": "Venous thromboembolism, ICD-10 code I82.90"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with fatigue and jaundice. On physical examination, he has scleral icterus and right upper quadrant tenderness. Laboratory tests reveal elevated liver enzymes (ALT 250 U/L, AST 220 U/L) and positive anti-HCV antibodies with a confirmed HCV RNA level of 1,000,000 IU/mL.",
    "actual_diagnosis": "Hepatitis C, ICD-10 code B17.1"
  },
  {
    "doctor_vignette": "A 5-year-old male presents with a chief complaint of itchy, red patches on his cheeks and behind his knees. Physical examination reveals dry, erythematous lesions with excoriations and lichenification. No significant lab results are necessary for diagnosis, as the clinical presentation is typical of atopic eczema.",
    "actual_diagnosis": "Eczema, atopic, ICD-10 code L20.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with persistent anxiety and flashbacks following a car accident six months ago. She reports difficulty sleeping, irritability, and avoidance of driving. Physical exam reveals increased heart rate and sweating when discussing the incident. No critical lab or imaging results are necessary for this diagnosis, as symptoms are primarily psychological.",
    "actual_diagnosis": "Post-traumatic stress disorder, ICD-10 code F43.10"
  },
  {
    "doctor_vignette": "A 55-year-old male presents for a routine check-up with a chief complaint of increased fatigue over the past month. Physical examination reveals a BMI of 32, and xanthomas are noted on his elbows. Laboratory tests show a total cholesterol level of 280 mg/dL and LDL cholesterol of 180 mg/dL, indicating significantly elevated lipid levels.",
    "actual_diagnosis": "Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with a chief complaint of persistent headaches and dizziness over the past month. On physical examination, his blood pressure is measured at 150/95 mmHg, and there is mild edema noted in his lower extremities. Routine lab tests reveal elevated serum creatinine levels, indicating potential kidney involvement.",
    "actual_diagnosis": "4. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with fatigue and pallor. On physical examination, she has conjunctival pallor and a heart rate of 110 bpm. Laboratory tests reveal a hemoglobin level of 9.0 g/dL and a serum ferritin level of 10 ng/mL, indicating iron deficiency.",
    "actual_diagnosis": "7. Iron deficiency anemia, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of persistent knee pain that worsens with activity and improves with rest. On physical examination, there is noticeable crepitus and tenderness over the medial joint line of the right knee, along with limited range of motion. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "9. Osteoarthritis, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 72-year-old male presents with worsening shortness of breath and edema in the lower extremities. On examination, he has elevated jugular venous pressure, bilateral crackles on lung auscultation, and 2+ pitting edema in both legs. Chest X-ray reveals cardiomegaly and pulmonary congestion, while BNP levels are markedly elevated at 600 pg/mL.",
    "actual_diagnosis": "6. Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 58-year-old male presents with increased thirst and frequent urination over the past month. Physical examination reveals a BMI of 32, mild hypertension, and acanthosis nigricans on the neck. Fasting blood glucose is measured at 180 mg/dL and HbA1c is 8.5%.",
    "actual_diagnosis": "5. Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 55-year-old female presents with a chief complaint of persistent joint pain and stiffness in her hands and wrists, particularly in the morning. On physical examination, there is symmetrical swelling of the metacarpophalangeal joints and tenderness in the proximal interphalangeal joints. Laboratory tests reveal elevated rheumatoid factor and anti-citrullinated protein antibodies, alongside increased inflammatory markers such as ESR and CRP.",
    "actual_diagnosis": "10. Rheumatoid arthritis, ICD-10 code M06.9"
  },
  {
    "doctor_vignette": "A 28-year-old male presents with a chief complaint of itchy, red patches on his elbows and knees. On physical exam, there are well-defined, erythematous plaques covered with silvery scales. No significant laboratory abnormalities are noted, and a skin biopsy reveals hyperkeratosis and acanthosis, consistent with psoriasis.",
    "actual_diagnosis": "11. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with chronic diarrhea and abdominal bloating after meals. On physical examination, she has signs of malnutrition, including weight loss and pallor. Serological tests reveal elevated tissue transglutaminase antibodies (tTG-IgA) and low hemoglobin levels. A subsequent duodenal biopsy confirms villous atrophy consistent with celiac disease.",
    "actual_diagnosis": "12. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with a chief complaint of wheezing and shortness of breath, particularly during physical activity. Physical examination reveals prolonged expiratory phase, bilateral wheezing on auscultation, and use of accessory muscles for breathing. A peak expiratory flow rate (PEFR) reading shows 60% of predicted value, indicating significant airway obstruction.",
    "actual_diagnosis": "14. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 65-year-old male presents to the emergency department with complaints of decreased urine output and swelling in his legs over the past week. Physical examination reveals bilateral lower extremity edema and mild hypertension. Laboratory tests show elevated serum creatinine levels at 3.5 mg/dL and a BUN of 40 mg/dL, indicating acute kidney injury.",
    "actual_diagnosis": "16. Acute kidney injury, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 34-year-old female presents with severe right upper quadrant pain radiating to her back after a fatty meal. On physical examination, she has tenderness in the right upper quadrant with a positive Murphy's sign. Ultrasound reveals multiple gallstones and gallbladder wall thickening. Laboratory tests show elevated liver enzymes and bilirubin levels.",
    "actual_diagnosis": "17. Gallbladder stones, ICD-10 code K80.20"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with a chief complaint of persistent abdominal pain and diarrhea for the past three months. Physical examination reveals tenderness in the right lower quadrant and signs of malnutrition. Laboratory tests show elevated inflammatory markers (CRP and ESR) and a colonoscopy reveals skip lesions consistent with Crohn's disease.",
    "actual_diagnosis": "13. Crohn's disease, ICD-10 code K50.90"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with a chief complaint of persistent cough for the past week, accompanied by mild chest discomfort. On examination, she has a low-grade fever of 99.5°F, wheezing on auscultation, and clear nasal discharge. A chest X-ray shows no signs of pneumonia, and a rapid influenza test is negative.",
    "actual_diagnosis": "15. Acute bronchitis, ICD-10 code J20.9"
  },
  {
    "doctor_vignette": "A 34-year-old female presents with fatigue, weight gain, and cold intolerance. On physical examination, she demonstrates dry skin, bradycardia, and a delayed relaxation phase of deep tendon reflexes. Laboratory tests reveal an elevated thyroid-stimulating hormone (TSH) level of 8.5 mIU/L and a low free thyroxine (T4) level of 0.7 ng/dL.",
    "actual_diagnosis": "19. Hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents to the emergency department with a chief complaint of palpitations, fever, and confusion. Physical examination reveals tachycardia with a heart rate of 150 bpm, hyperthermia with a temperature of 39.5°C, and tremors in her hands. Laboratory results show significantly elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "Thyroid storm, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with fatigue and pallor. On physical examination, she has a smooth, beefy-red tongue and slight jaundice. Laboratory results reveal a low hemoglobin level of 8.5 g/dL, elevated mean corpuscular volume (MCV) of 110 fL, and a positive intrinsic factor antibody test.",
    "actual_diagnosis": "Pernicious anemia, ICD-10 code D51.0"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of increased anxiety and unintentional weight loss over the past month. Physical examination reveals a rapid heart rate of 110 bpm, a fine tremor in her hands, and palpable enlargement of the thyroid gland. Laboratory results show elevated free T4 and suppressed TSH levels, confirming the diagnosis.",
    "actual_diagnosis": "18. Hyperthyroidism, ICD-10 code E05.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of joint pain and fatigue persisting for several weeks. On physical examination, she has a malar rash, oral ulcers, and swelling in her wrists and knees. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated anti-double stranded DNA antibodies, indicating active disease.",
    "actual_diagnosis": "20. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 5-year-old male presents for evaluation of short stature. Physical examination reveals disproportionately short limbs, a prominent forehead, and a flattened nasal bridge. X-rays show characteristic features of skeletal dysplasia, including shortened long bones consistent with achondroplasia. Genetic testing confirms a mutation in the FGFR3 gene.",
    "actual_diagnosis": "Achondroplasia, ICD-10 code Q77.1"
  },
  {
    "doctor_vignette": "A 22-year-old male presents to the emergency department with a chief complaint of severe headache and fever for the past 24 hours. On examination, he exhibits a positive Brudzinski's sign and has a stiff neck. Lumbar puncture reveals cloudy cerebrospinal fluid with elevated white blood cell count and positive Gram stain for Neisseria meningitidis.",
    "actual_diagnosis": "Bacterial meningitis, ICD-10 code A87.9"
  },
  {
    "doctor_vignette": "A 72-year-old female presents to the emergency department with dizziness and fainting spells. On physical examination, her blood pressure is noted to be 80/50 mmHg, and she exhibits signs of dehydration with dry mucous membranes. Laboratory results reveal elevated creatinine levels at 1.8 mg/dL, indicating possible renal impairment due to decreased perfusion.",
    "actual_diagnosis": "Hypotension, ICD-10 code I95.9"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with a chief complaint of multiple skin lesions that have been increasing in number. On physical examination, café-au-lait spots are noted on her torso and a few neurofibromas are palpable on her back. Additionally, she has optic nerve glioma confirmed by MRI, which shows an associated mass in the optic pathway.",
    "actual_diagnosis": "Neurofibromatosis type 1, ICD-10 code Q85.01"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with a chief complaint of persistent pain and stiffness in his right shoulder, worsening with overhead activities. On physical examination, there is tenderness over the rotator cuff, decreased range of motion, and a positive Neer test. An MRI of the shoulder reveals signs of tendinitis with associated edema in the supraspinatus tendon.",
    "actual_diagnosis": "Tendinitis of the shoulder, ICD-10 code M75.1"
  },
  {
    "doctor_vignette": "A 25-year-old male presents with a chief complaint of persistent fatigue and night sweats for the past month. On physical examination, there is notable cervical lymphadenopathy and splenomegaly. A chest CT scan reveals enlarged mediastinal lymph nodes, and laboratory tests show elevated lactate dehydrogenase (LDH) levels.",
    "actual_diagnosis": "Hodgkin lymphoma, ICD-10 code C81.9"
  },
  {
    "doctor_vignette": "A 16-year-old male presents with neurological symptoms including tremors and difficulty speaking. Physical examination reveals Kayser-Fleischer rings in the cornea and hepatomegaly. Laboratory tests show elevated serum copper and decreased ceruloplasmin levels, confirming copper metabolism disorder.",
    "actual_diagnosis": "Wilson’s disease, ICD-10 code E83.0"
  },
  {
    "doctor_vignette": "A 4-year-old male presents with a 5-day history of high fever, conjunctival injection, and a rash. On physical examination, there is notable cervical lymphadenopathy and cracked lips. Laboratory tests reveal elevated inflammatory markers with a significantly increased erythrocyte sedimentation rate (ESR) and thrombocytosis. Echocardiography shows mild dilation of the coronary arteries.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I25.89"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with involuntary facial movements and tongue protrusions that have developed over the past six months. On physical examination, she exhibits rhythmic, repetitive movements of the lips and jaw, along with dystonic posturing of the tongue. Her medication history reveals long-term use of antipsychotics for schizophrenia. Neurological imaging is unremarkable, and routine lab tests show no abnormalities.",
    "actual_diagnosis": "Tardive dyskinesia, ICD-10 code G24.03"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with worsening abdominal pain and significant weight loss over the past three months. On physical examination, he has jaundice and a palpable mass in the upper abdomen. Ultrasound reveals an enlarged pancreas with a suspicious mass, and CA 19-9 levels are elevated at 250 U/mL.",
    "actual_diagnosis": "Pancreatic cancer, ICD-10 code C25.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with chronic neck pain and stiffness that has progressively worsened over the past year. On physical examination, there is reduced range of motion in the cervical spine and tenderness along the cervical vertebrae. An MRI of the cervical spine shows degenerative disc disease and osteophyte formation at C5-C6. No acute fractures or significant spinal canal narrowing are noted.",
    "actual_diagnosis": "Cervical spondylosis, ICD-10 code M47.9"
  },
  {
    "doctor_vignette": "A 2-week-old male infant presents with failure to pass meconium within the first 48 hours of life and abdominal distension. On physical examination, the abdomen is markedly distended with palpable loops of bowel and decreased bowel sounds. An abdominal X-ray shows a dilated colon with a transition zone to a normal caliber rectum. A rectal biopsy reveals the absence of ganglion cells, confirming the diagnosis.",
    "actual_diagnosis": "Hirschsprung disease, ICD-10 code Q43.1"
  },
  {
    "doctor_vignette": "A 15-year-old male presents with persistent pain in his right knee, which has worsened over the past month and is accompanied by swelling. On examination, there is notable tenderness and a palpable mass over the distal femur. X-rays reveal a sunburst pattern of bone destruction and a large soft tissue mass, raising suspicion for a malignant process.",
    "actual_diagnosis": "Osteosarcoma, ICD-10 code C40.0"
  },
  {
    "doctor_vignette": "A 10-year-old African American male presents with severe pain in his chest and back lasting for the past 24 hours. On physical examination, he exhibits pallor, tachycardia, and tenderness over the thoracic spine. A complete blood count reveals a hemoglobin level of 6 g/dL, and a peripheral blood smear shows sickle-shaped red blood cells.",
    "actual_diagnosis": "Sickle cell disease, ICD-10 code D57.0"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a chief complaint of severe palpitations and confusion. On examination, she is found to have a heart rate of 150 bpm, elevated blood pressure of 180/110 mmHg, and hyperthermia with a temperature of 39.5°C. Laboratory tests reveal a significantly elevated free T4 level of 5.6 ng/dL and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "Thyroid storm, ICD-10 code E05.01"
  },
  {
    "doctor_vignette": "A 12-year-old female presents with a chief complaint of lower back pain that worsens with prolonged standing. On physical examination, there is an increased lumbar curvature noted, and tenderness is palpated over the lumbar region. X-ray imaging reveals a significant lordotic curve of the lumbar spine without any signs of fracture or degenerative changes.",
    "actual_diagnosis": "Lordosis, ICD-10 code M40.4"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with a chief complaint of multiple skin lesions. On physical examination, there are several café-au-lait spots and two palpable neurofibromas on her back. Additionally, an MRI of the brain reveals a sphenoid wing dysplasia. Family history is significant for similar skin findings in her mother, suggesting a genetic component.",
    "actual_diagnosis": "Neurofibromatosis, ICD-10 code Q85.00"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with a chief complaint of recurrent headaches occurring at least 15 days per month for the past six months. On examination, she exhibits tenderness in the pericranial muscles and photophobia. An MRI of the brain shows no abnormalities, ruling out secondary causes of headache.",
    "actual_diagnosis": "Chronic migraines, ICD-10 code G43.709"
  },
  {
    "doctor_vignette": "A 67-year-old female presents with worsening knee pain, particularly after prolonged standing or walking. On physical examination, there is notable crepitus and tenderness over the medial joint line of the right knee, along with mild swelling. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "5. Osteoarthritis, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with persistent bone pain in his pelvis and lower back. On physical examination, there is noticeable enlargement of the left tibia and tenderness over the affected areas. Radiographic imaging reveals thickened bone and disorganized trabecular patterns consistent with Paget's disease. Serum alkaline phosphatase levels are elevated, indicating increased osteoblastic activity.",
    "actual_diagnosis": "Paget's disease of bone, ICD-10 code M88.9"
  },
  {
    "doctor_vignette": "A 58-year-old male presents with increased thirst and frequent urination for the past month. On physical examination, he has a BMI of 32 and notable acanthosis nigricans on his neck. Laboratory tests reveal a fasting blood glucose level of 180 mg/dL and an HbA1c of 8.2%.",
    "actual_diagnosis": "4. Diabetes mellitus type 2, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 55-year-old female presents with involuntary, repetitive movements of her face and tongue, having been on antipsychotic medication for over five years for schizophrenia. On physical exam, she exhibits lip smacking and facial grimacing, with no signs of acute distress. Neurological examination reveals no other focal deficits, and routine blood tests show normal results. MRI of the brain is unremarkable, ruling out other neurological conditions.",
    "actual_diagnosis": "Tardive dyskinesia, ICD-10 code F32.81"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of increasing shortness of breath and a persistent cough producing yellow sputum for the past three months. Physical examination reveals wheezing, decreased breath sounds bilaterally, and use of accessory muscles for breathing. A chest X-ray shows hyperinflation of the lungs, and a spirometry test indicates a forced expiratory volume in one second (FEV1) of 55% of predicted, consistent with obstructive lung disease.",
    "actual_diagnosis": "7. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 54-year-old male presents to the clinic with complaints of persistent headaches and occasional dizziness. On physical examination, his blood pressure is measured at 160/95 mmHg, and he is noted to have mild bilateral edema in the lower extremities. Laboratory tests reveal elevated serum creatinine levels at 1.5 mg/dL, indicating possible kidney involvement due to hypertension.",
    "actual_diagnosis": "11. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with a chief complaint of itchy, red patches on his elbows and knees that have been worsening over the past three months. Physical examination reveals well-defined erythematous plaques covered with silvery scales on extensor surfaces and the scalp. No significant laboratory abnormalities were noted, and a skin biopsy was performed, confirming the diagnosis of psoriasis.",
    "actual_diagnosis": "10. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with palpitations and unintentional weight loss over the past month. On physical examination, she has a diffusely enlarged thyroid gland and exhibits tremors in her hands. Laboratory tests reveal a suppressed TSH level and elevated free T4, confirming hyperthyroidism.",
    "actual_diagnosis": "12. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 10-year-old male presents to the emergency department with wheezing and shortness of breath after playing outside. Physical examination reveals prolonged expiratory phase, use of accessory muscles, and decreased breath sounds bilaterally. A peak expiratory flow rate (PEFR) shows a reading of 60% of predicted value, indicating moderate obstruction. There are no signs of infection on chest X-ray.",
    "actual_diagnosis": "13. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 42-year-old female presents with chronic widespread pain and fatigue lasting over six months. Physical examination reveals tenderness in multiple trigger points, including the neck, shoulders, and lower back. Routine lab tests, including CBC and inflammatory markers, return normal, and no imaging studies show any abnormalities. The patient also reports sleep disturbances and cognitive difficulties, commonly known as 'fibro fog.'",
    "actual_diagnosis": "14. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 72-year-old male presents to the emergency department with palpitations and shortness of breath that started an hour ago. On examination, his heart rate is irregularly irregular at 120 beats per minute, and he has a blood pressure of 90/60 mmHg. An ECG shows no identifiable P waves and a rapid ventricular response. Laboratory results reveal elevated troponin levels and a potassium level of 5.5 mEq/L.",
    "actual_diagnosis": "15. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with fatigue and swelling in his legs and ankles. On examination, he has elevated blood pressure, pitting edema in the lower extremities, and a decreased urine output. Laboratory results reveal a serum creatinine level of 8.2 mg/dL and a GFR of 10 mL/min, indicating severely impaired kidney function.",
    "actual_diagnosis": "16. End-stage renal disease, ICD-10 code N18.6"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with fatigue and palpitations. On examination, she has pale conjunctiva and a heart rate of 110 bpm. Laboratory results reveal a hemoglobin level of 9.5 g/dL and low serum ferritin of 10 ng/mL, indicating iron deficiency.",
    "actual_diagnosis": "17. Anemia due to iron deficiency, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of tremors in his right hand that have progressively worsened over the past six months. On physical examination, he exhibits bradykinesia, rigidity in the upper extremities, and a shuffling gait. A dopamine transporter scan shows reduced uptake in the putamen, consistent with Parkinson's disease.",
    "actual_diagnosis": "18. Parkinson's disease, ICD-10 code G20"
  },
  {
    "doctor_vignette": "A 68-year-old woman presents with a chief complaint of persistent lower back pain that has worsened over the past month. Physical examination reveals reduced spinal mobility and tenderness over the lumbar region, with a noticeable decrease in height. A DEXA scan shows a T-score of -2.8, indicating osteoporosis.",
    "actual_diagnosis": "20. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with auditory hallucinations and delusions of persecution over the past six months. On examination, he exhibits disorganized speech and a flat affect. There are no significant findings on laboratory tests or neuroimaging, which show normal brain structure. His symptoms have significantly impaired his social and occupational functioning.",
    "actual_diagnosis": "22. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 6-year-old male presents with recurrent joint swelling and pain after minor falls. Physical examination reveals significant hemarthrosis in the right knee and bruising on the forearms. Laboratory tests show a prolonged activated partial thromboplastin time (aPTT) with normal prothrombin time (PT), and factor VIII levels are markedly decreased.",
    "actual_diagnosis": "24. Hemophilia, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with severe pain and swelling in his right big toe, which started suddenly during the night. On physical examination, the toe is erythematous, warm, and exquisitely tender to touch. Serum uric acid levels are found to be elevated at 9.2 mg/dL, and synovial fluid analysis shows needle-shaped crystals under polarized light microscopy, confirming the diagnosis.",
    "actual_diagnosis": "23. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 12-year-old African American male presents with severe pain in his chest and back, reporting that the pain began suddenly while playing basketball. On physical examination, he exhibits pallor and splenomegaly. Lab results reveal a hemoglobin level of 6.5 g/dL with a peripheral blood smear showing sickle-shaped cells and reticulocytosis of 12%.",
    "actual_diagnosis": "21. Sickle cell disease, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of persistent knee pain that worsens with activity and improves with rest. Physical examination reveals crepitus and tenderness over the medial joint line of the right knee, with limited range of motion. X-rays show joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "Osteoarthritis, ICD-10 code M19.90"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with a persistent cough and frequent respiratory infections. Physical examination reveals digital clubbing and wheezing on auscultation. Sweat chloride testing shows an elevated level of 90 mmol/L, indicating abnormal chloride transport.",
    "actual_diagnosis": "25. Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with complaints of persistent feelings of restlessness and difficulty concentrating for the past six months. On physical examination, she exhibits mild tachycardia and diaphoresis but has no significant findings on neurological or cardiovascular assessments. Routine laboratory tests, including complete blood count and thyroid function tests, return normal, and no imaging studies are indicated.",
    "actual_diagnosis": "Anxiety disorder, unspecified, ICD-10 code F41.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of persistent sadness and lack of interest in activities she once enjoyed. On physical examination, she exhibits psychomotor retardation, poor eye contact, and flat affect. Laboratory tests, including a complete blood count and thyroid function tests, show no abnormalities, ruling out other potential causes of her symptoms.",
    "actual_diagnosis": "Clinical depression, ICD-10 code F32.9"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with a chief complaint of persistent heartburn and regurgitation after meals. On physical examination, he exhibits epigastric tenderness but no signs of acute distress. An upper gastrointestinal endoscopy shows evidence of mild esophagitis, and a pH monitoring test indicates abnormal acid exposure.",
    "actual_diagnosis": "Acid reflux, ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "An 82-year-old female presents with increasing forgetfulness and confusion over the past year, often misplacing items and repeating questions. Physical examination reveals disorientation to time and place, as well as difficulty following simple commands. Cognitive testing shows significant impairment in memory and executive function, while CT imaging of the brain indicates generalized atrophy without acute process.",
    "actual_diagnosis": "Dementia, unspecified, ICD-10 code F03.90"
  },
  {
    "doctor_vignette": "A 10-year-old girl presents with a chief complaint of multiple skin lesions. On physical examination, several café-au-lait spots and neurofibromas are noted on her back and arms. A recent MRI of the brain shows no evidence of tumors, ruling out complications. The family history reveals a maternal uncle with similar findings, raising suspicion for neurofibromatosis type 1.",
    "actual_diagnosis": "Neurofibromatosis, type 1, ICD-10 code Q85.00"
  },
  {
    "doctor_vignette": "A 4-year-old male presents with a 5-day history of high fever, conjunctival injection, and a rash. On examination, he has swollen cervical lymph nodes and red, cracked lips. Laboratory results show elevated inflammatory markers, including CRP and ESR, along with a normocytic anemia.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I72.5"
  },
  {
    "doctor_vignette": "A 52-year-old female presents with a chief complaint of bilateral joint pain and swelling in her hands and feet, which has persisted for the past three months. On physical examination, there is notable morning stiffness lasting over an hour, and tenderness with swelling in the metacarpophalangeal joints. Laboratory tests reveal positive rheumatoid factor and elevated anti-CCP antibodies, alongside an increased ESR.",
    "actual_diagnosis": "5. Rheumatoid arthritis, ICD-10 code M05.79"
  },
  {
    "doctor_vignette": "A 55-year-old male presents to the clinic with complaints of persistent headaches and occasional dizziness. On physical examination, his blood pressure is measured at 160/100 mmHg, and he is noted to have a BMI of 29. Laboratory results show elevated serum creatinine levels of 1.3 mg/dL and a lipid panel indicating hyperlipidemia.",
    "actual_diagnosis": "6. Hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "An 82-year-old female presents with progressive memory loss, frequently forgetting recent conversations and misplacing items. On physical examination, she demonstrates disorientation to time and place, along with difficulty in performing simple tasks. A CT scan of the brain shows mild cortical atrophy, particularly in the temporal lobes, consistent with neurodegenerative changes. Laboratory tests reveal no significant abnormalities in routine blood work.",
    "actual_diagnosis": "9. Alzheimer's disease, ICD-10 code G30.9"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with recurrent episodes of joint bleeding and prolonged bleeding after minor cuts. Physical examination reveals swollen knees and bruising on the forearms. Laboratory tests show aPTT of 45 seconds (normal range 25-35 seconds) while PT and platelet count are normal. Factor VIII levels are significantly low, confirming the diagnosis.",
    "actual_diagnosis": "11. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of joint pain and fatigue lasting for several weeks. On physical examination, she has bilateral swelling of the wrists and knees, a butterfly rash across her cheeks, and oral ulcers. Laboratory tests reveal positive antinuclear antibodies (ANA) and low complement levels, indicating an autoimmune process.",
    "actual_diagnosis": "15. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with persistent abdominal pain and diarrhea for the past six months. Physical examination reveals a distended abdomen and signs of malnutrition, including weight loss and dry skin. Laboratory tests show positive tissue transglutaminase antibodies (tTG-IgA) and low hemoglobin levels indicating anemia.",
    "actual_diagnosis": "10. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 72-year-old male presents with worsening shortness of breath and fatigue over the past month. Physical examination reveals bilateral lower extremity edema, jugular venous distension, and a third heart sound (S3). Chest X-ray shows cardiomegaly and pulmonary congestion, while BNP levels are elevated at 550 pg/mL.",
    "actual_diagnosis": "13. Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with complaints of unintentional weight loss, increased heart rate, and anxiety. On physical examination, she exhibits tremors, a warm and moist skin texture, and a noticeable goiter. Laboratory tests reveal elevated free T4 and suppressed TSH levels, indicating hyperthyroidism.",
    "actual_diagnosis": "16. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with excessive daytime sleepiness and episodes of sudden muscle weakness triggered by laughter. Physical examination reveals no abnormalities, but the patient reports experiencing vivid hallucinations during sleep onset. A polysomnography study shows short sleep latency and REM sleep occurring within 15 minutes of falling asleep, consistent with narcolepsy.",
    "actual_diagnosis": "20. Narcolepsy, ICD-10 code G47.419"
  },
  {
    "doctor_vignette": "A 22-year-old male presents with auditory hallucinations and disorganized speech. On physical examination, he appears unkempt, with flat affect and impaired insight. Neurological assessment reveals no focal deficits, and routine laboratory tests, including CBC and metabolic panel, are within normal limits. A brain MRI shows no structural abnormalities, ruling out other causes of his symptoms.",
    "actual_diagnosis": "19. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with acute pain and swelling in his right big toe, which started suddenly during the night. On examination, the toe is erythematous, warm, and exquisitely tender to touch. Serum uric acid levels are found to be elevated at 9.5 mg/dL, and a joint aspiration reveals needle-shaped monosodium urate crystals under polarized light.",
    "actual_diagnosis": "17. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with persistent abdominal pain and diarrhea for the past three months. On physical examination, she has tenderness in the right lower quadrant and mild abdominal distension. Laboratory tests reveal elevated C-reactive protein (CRP) and a colonoscopy shows skip lesions and cobblestoning in the terminal ileum.",
    "actual_diagnosis": "18. Crohn’s disease, ICD-10 code K50.90"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with fatigue, recurrent infections, and easy bruising over the past month. On physical examination, she has pallor, petechiae on her lower extremities, and splenomegaly. Complete blood count reveals a leukocytosis with 80% immature white blood cells and thrombocytopenia. Bone marrow biopsy confirms the diagnosis of acute leukemia.",
    "actual_diagnosis": "Acute leukemia, ICD-10 code C91.9"
  },
  {
    "doctor_vignette": "A 29-year-old male presents with fatigue and jaundice for the past week. On physical examination, he has scleral icterus and a tender hepatomegaly. Laboratory tests reveal elevated liver enzymes (AST 150 U/L, ALT 180 U/L) and a positive Hepatitis B surface antigen (HBsAg).",
    "actual_diagnosis": "Hepatitis B, ICD-10 code B16.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with severe right upper quadrant pain after a fatty meal. On physical examination, she exhibits tenderness in the right upper quadrant and a positive Murphy's sign. Laboratory tests show elevated bilirubin levels and a complete blood count indicating mild leukocytosis. An abdominal ultrasound reveals multiple gallstones in the gallbladder with no signs of cholecystitis.",
    "actual_diagnosis": "Cholelithiasis, ICD-10 code K80.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of itchy, red rash on her hands after using a new dishwashing detergent. Physical examination reveals erythematous, scaly patches with vesicles on the dorsal surfaces of both hands. No systemic symptoms are noted, and patch testing confirms sensitivity to one of the detergent's ingredients.",
    "actual_diagnosis": "Contact dermatitis, ICD-10 code L23.9"
  },
  {
    "doctor_vignette": "A 3-year-old female presents with developmental delays and difficulty with motor skills. Physical examination reveals spasticity in the lower extremities, an exaggerated deep tendon reflex, and a scissor gait. MRI of the brain shows periventricular leukomalacia, consistent with a diagnosis of cerebral palsy.",
    "actual_diagnosis": "Cerebral palsy, ICD-10 code G80.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of worsening shortness of breath and cough for the past week. Physical examination reveals decreased breath sounds and crackles on auscultation. A chest X-ray shows bilateral infiltrates, and a PCR test for COVID-19 returns positive.",
    "actual_diagnosis": "Pneumonia due to COVID-19, ICD-10 code J12.82"
  },
  {
    "doctor_vignette": "A 63-year-old female presents with persistent fatigue and recurrent kidney stones. On physical examination, she has noticeable muscle weakness and abdominal tenderness. Laboratory results reveal elevated serum calcium levels of 12.5 mg/dL and increased parathyroid hormone levels, confirming the diagnosis.",
    "actual_diagnosis": "Hyperparathyroidism, ICD-10 code E21.9"
  },
  {
    "doctor_vignette": "A 68-year-old female presents with progressive rigidity and bradykinesia of the right arm, accompanied by difficulty in speech and occasional episodes of dystonia. On physical examination, there is marked asymmetry, with the right side showing more severe motor impairment and a grasp reflex. MRI of the brain reveals asymmetrical cortical atrophy, particularly in the parietal lobe. Neurological assessment indicates significant cognitive decline with visuospatial deficits.",
    "actual_diagnosis": "Corticobasal degeneration, ICD-10 code G31.83"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with a chief complaint of swelling in the legs and around the eyes for the past week. On physical examination, he has significant bilateral lower extremity edema and periorbital swelling. Laboratory results reveal a 24-hour urine protein of 4.5 grams and serum albumin level of 2.0 g/dL, indicating hypoalbuminemia.",
    "actual_diagnosis": "Nephrotic syndrome, ICD-10 code N04.9"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with a chief complaint of persistent headaches and dizziness for the past month. On physical examination, his blood pressure is measured at 150/95 mmHg, with no other significant findings. Laboratory tests reveal normal renal function and electrolyte levels, ruling out secondary causes of hypertension.",
    "actual_diagnosis": "Essential hypertension, ICD-10 code I10"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with complaints of increased urinary frequency, nocturia, and a weak urinary stream. On physical examination, a smooth, enlarged prostate is palpated on digital rectal exam. Urinalysis shows no signs of infection, and a bladder ultrasound reveals post-void residual urine of 150 mL, indicating urinary retention.",
    "actual_diagnosis": "Benign prostatic hyperplasia, ICD-10 code N40.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with sudden onset of right-sided facial weakness, unable to smile or close her right eye. On physical examination, there is a notable droop of the right side of her mouth and inability to raise her right eyebrow. Neurological examination shows no other deficits and a CT scan of the head is unremarkable, ruling out other causes.",
    "actual_diagnosis": "Bell's palsy, ICD-10 code G51.0"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a chief complaint of a dull, bilateral headache that has persisted for the past week. Physical examination reveals tenderness in the scalp and neck muscles, with no neurological deficits noted. Laboratory tests and imaging studies, including a CT scan of the head, are unremarkable.",
    "actual_diagnosis": "Tension-type headache, ICD-10 code G44.209"
  },
  {
    "doctor_vignette": "A 72-year-old female presents with increasing forgetfulness over the past year, often misplacing items and struggling to recall recent conversations. On physical examination, she demonstrates difficulty with short-term memory tasks and her Mini-Mental State Examination score is 22/30. MRI of the brain shows mild cortical atrophy, particularly in the temporal lobes. There are no acute intracranial abnormalities.",
    "actual_diagnosis": "Alzheimer's disease, ICD-10 code G30.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of numbness and tingling in her right hand, particularly affecting the thumb, index, and middle fingers, which worsens at night. On physical exam, she demonstrates positive Tinel's sign and Phalen's maneuver. Nerve conduction studies reveal delayed median nerve conduction at the wrist, consistent with carpal tunnel syndrome.",
    "actual_diagnosis": "Carpal tunnel syndrome, ICD-10 code G56.0"
  },
  {
    "doctor_vignette": "A 28-year-old male recently returned from a trip to West Africa presents with a chief complaint of high fever and chills. Physical examination reveals splenomegaly and jaundice. Laboratory tests show a positive rapid diagnostic test for Plasmodium falciparum and a hemoglobin level of 9 g/dL indicating anemia.",
    "actual_diagnosis": "Malaria, ICD-10 code B50.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of increasing difficulty with movement and noticeable tremors in his right hand. Upon physical examination, he exhibits a resting tremor, bradykinesia, and rigidity in the upper extremities. Neurological imaging shows no evidence of structural lesions, but a DaTscan indicates decreased dopamine transporter uptake in the striatum, consistent with Parkinson’s disease.",
    "actual_diagnosis": "Parkinson’s disease, ICD-10 code G20"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with persistent fatigue and unexplained weight loss of 15 pounds over the past two months. Physical examination reveals palpable lymphadenopathy in the cervical and axillary regions. Laboratory tests show elevated lactate dehydrogenase (LDH) levels and a biopsy of the lymph nodes reveals atypical lymphoid cells. CT imaging confirms multiple enlarged lymph nodes throughout the abdomen and thorax.",
    "actual_diagnosis": "Non-Hodgkin lymphoma, ICD-10 code C85.9"
  },
  {
    "doctor_vignette": "A 30-year-old male presents with a persistent cough for the past three weeks, accompanied by night sweats and unintentional weight loss. On physical examination, there are decreased breath sounds and crackles in the right upper lung field. A chest X-ray reveals a right apical cavitary lesion, and sputum analysis shows acid-fast bacilli.",
    "actual_diagnosis": "Tuberculosis of the lung, ICD-10 code A15.0"
  },
  {
    "doctor_vignette": "A 27-year-old female presents with a chief complaint of persistent intrusive thoughts about contamination and excessive handwashing rituals. Physical examination reveals no significant findings, but the patient reports spending over three hours daily on these compulsions, leading to distress and impairment in her work and social life. No lab tests or imaging are necessary for diagnosis, as symptoms align with obsessive-compulsive disorder criteria.",
    "actual_diagnosis": "Obsessive-compulsive disorder, ICD-10 code F42.9"
  },
  {
    "doctor_vignette": "A 58-year-old male presents to the emergency department with severe chest pain radiating to his left arm and shortness of breath. On examination, he is diaphoretic, with a blood pressure of 90/60 mmHg and a heart rate of 110 bpm. An ECG reveals ST elevation in the anterior leads, and cardiac troponin levels are significantly elevated. These findings are consistent with acute myocardial infarction.",
    "actual_diagnosis": "Myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 3-year-old male presents with a 2-day history of irritability and pulling at his right ear. On physical exam, there is significant erythema and bulging of the right tympanic membrane with purulent discharge noted. No additional imaging is necessary as the clinical findings are consistent with acute otitis media.",
    "actual_diagnosis": "Acute otitis media, ICD-10 code H66.90"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with progressive shortness of breath and a persistent cough over the past six months. Physical examination reveals crackles on auscultation and clubbing of the fingers. High-resolution computed tomography (HRCT) of the chest shows ground-glass opacities and reticular patterns consistent with interstitial lung disease.",
    "actual_diagnosis": "Interstitial lung disease, ICD-10 code J84.10"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with fatigue, weight loss, and decreased libido over the past six months. Physical examination reveals hypotension and diminished body hair. Laboratory tests show low levels of ACTH, LH, and TSH, along with low cortisol and testosterone levels. MRI of the pituitary gland indicates an empty sella.",
    "actual_diagnosis": "Hypopituitarism, ICD-10 code E23.0"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with fatigue and joint pain in his hands. On physical examination, he has a bronze discoloration of the skin and hepatomegaly. Laboratory tests reveal elevated serum ferritin levels of 800 ng/mL and transferrin saturation of 95%.",
    "actual_diagnosis": "Hereditary hemochromatosis, ICD-10 code E83.110"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with fatigue and weakness over the past month. On physical examination, he is pale, and there is mild splenomegaly. Laboratory tests reveal a hemoglobin level of 10.5 g/dL, elevated serum ferritin, and normal iron studies, consistent with anemia of chronic disease.",
    "actual_diagnosis": "Anemia due to chronic disease, ICD-10 code D63.9"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with a chief complaint of worsening cough and shortness of breath for the past three days. On physical examination, he has decreased breath sounds in the right lower lung field and dullness to percussion. Chest X-ray reveals right lower lobe consolidation, and a sputum culture returns positive for Streptococcus pneumoniae.",
    "actual_diagnosis": "Pneumonia due to Streptococcus pneumoniae, ICD-10 code J18.0"
  },
  {
    "doctor_vignette": "A 14-year-old female presents to the emergency department with her mother after experiencing a generalized tonic-clonic seizure at school. On examination, she is currently alert but reports confusion and fatigue following the seizure. A brain MRI shows no structural abnormalities, and her serum electrolyte levels are within normal limits. The patient has a history of similar seizure episodes occurring sporadically over the past six months.",
    "actual_diagnosis": "Epilepsy, ICD-10 code G40.9"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with a persistent cough lasting three weeks, accompanied by night sweats and weight loss. On physical examination, he has decreased breath sounds in the right lung and dullness to percussion. A chest X-ray reveals an apical cavitary lesion, and sputum analysis shows acid-fast bacilli, confirming the diagnosis.",
    "actual_diagnosis": "Tuberculosis of the lung, ICD-10 code A15.9"
  },
  {
    "doctor_vignette": "A 15-year-old male presents with increasing fatigue and abdominal pain. On physical examination, he has a Kayser-Fleischer ring in his eyes and hepatomegaly. Laboratory tests reveal elevated serum copper levels and low ceruloplasmin. MRI of the liver shows signs of hepatic cirrhosis.",
    "actual_diagnosis": "Wilson's disease, ICD-10 code E83.01"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with a chief complaint of wheezing and shortness of breath after playing outside. Physical examination reveals bilateral expiratory wheezing and a prolonged expiratory phase. A peak flow measurement shows 60% of his personal best. The patient has a history of asthma-like symptoms exacerbated by environmental allergens, particularly pollen.",
    "actual_diagnosis": "Reactive airway disease, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "An 8-year-old male presents with a rapidly growing mass in the left thigh, which has been painful for the past month. Physical examination reveals a firm, non-tender, 5 cm palpable mass with limited range of motion. An MRI of the thigh shows a soft tissue mass extending into the surrounding muscles, consistent with a malignant neoplasm.",
    "actual_diagnosis": "Rhabdomyosarcoma, ICD-10 code C49.9"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with sudden, severe chest pain radiating to the back. On physical examination, a pulsatile abdominal mass is noted, and the patient exhibits hypotension. A chest X-ray reveals a widened mediastinum, and a subsequent CT scan confirms the presence of a thoracic aortic aneurysm.",
    "actual_diagnosis": "Aortic aneurysm, ICD-10 code I71.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with complaints of aching and swelling in her legs, particularly after prolonged standing. On physical examination, there are prominent, tortuous veins visible on the medial aspect of both lower extremities, with a notable increase in skin pigmentation around the ankles. Venous Doppler ultrasound reveals reflux in the great saphenous vein, confirming the diagnosis.",
    "actual_diagnosis": "Varicose veins of lower extremities, ICD-10 code I83.90"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with a chief complaint of a bulge in the right groin that increases in size with standing and decreases when lying down. On physical examination, a soft, reducible mass is palpated in the right inguinal region, with no signs of tenderness or bowel obstruction. An abdominal ultrasound confirms the presence of an inguinal hernia without any complications.",
    "actual_diagnosis": "Hernia, unspecified, ICD-10 code K40.90"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with extreme fatigue, weight loss, and low blood pressure. Physical examination reveals hyperpigmentation of the skin and orthostatic hypotension. Laboratory tests show hyponatremia, hyperkalemia, and an elevated ACTH level with low cortisol levels in the morning.",
    "actual_diagnosis": "Adrenal insufficiency, ICD-10 code E27.9"
  },
  {
    "doctor_vignette": "A 20-year-old male presents with complaints of chest pain and palpitations. On physical examination, he is noted to have tall stature, long limbs, and arachnodactyly. A transthoracic echocardiogram reveals a dilated aortic root. Genetic testing confirms a mutation in the FBN1 gene associated with Marfan syndrome.",
    "actual_diagnosis": "Marfan syndrome, ICD-10 code Q87.4"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with severe lower back pain radiating down his left leg. On examination, he demonstrates positive straight leg raise and reduced sensation in the left S1 dermatome. MRI of the lumbar spine reveals a herniated disc at the L5-S1 level compressing the left S1 nerve root.",
    "actual_diagnosis": "Herniated disc, ICD-10 code M51.2"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with severe right upper quadrant pain that started suddenly after a fatty meal. On physical examination, she exhibits tenderness in the right upper quadrant with a positive Murphy's sign. An abdominal ultrasound reveals multiple gallstones within the gallbladder and thickening of the gallbladder wall. Laboratory tests show elevated liver enzymes and bilirubin levels.",
    "actual_diagnosis": "Gallbladder stones, ICD-10 code K80.9"
  },
  {
    "doctor_vignette": "A 34-year-old female presents to the emergency department with difficulty breathing and facial swelling after eating shrimp at a restaurant. Physical examination reveals angioedema of the face and lips, wheezing on auscultation, and a rash covering her torso. Laboratory results show elevated serum tryptase levels and a low oxygen saturation of 85%.",
    "actual_diagnosis": "Severe allergic reaction, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of facial pain and pressure for the past week. On physical examination, there is tenderness over the maxillary sinuses and purulent nasal discharge is observed. A CT scan of the sinuses shows mucosal thickening and fluid levels in the maxillary sinuses, consistent with sinusitis.",
    "actual_diagnosis": "Acute sinusitis, ICD-10 code J01.90"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a chief complaint of debilitating headaches occurring 15 or more days per month for the past six months, often accompanied by nausea and light sensitivity. Physical examination reveals no neurological deficits, but she exhibits tenderness to palpation in the pericranial muscles. MRI of the brain is unremarkable, ruling out secondary causes of headache.",
    "actual_diagnosis": "Chronic migraine, ICD-10 code G43.701"
  },
  {
    "doctor_vignette": "A 28-year-old woman presents with fatigue, joint pain, and a butterfly rash across her cheeks. On examination, she has mild oral ulcers and swelling in her hands. Laboratory tests reveal a positive antinuclear antibody (ANA) test and low complement levels (C3 and C4).",
    "actual_diagnosis": "6. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with concerns about social interactions and difficulty understanding nonverbal cues. On examination, he displays limited eye contact, has a narrow range of interests, and engages in repetitive behaviors such as hand-flapping. No significant findings are noted on developmental screening tests, and laboratory tests are within normal limits.",
    "actual_diagnosis": "Asperger's syndrome, ICD-10 code F84.5"
  },
  {
    "doctor_vignette": "A 54-year-old male presents with increased thirst and frequent urination over the past month. Physical examination reveals a BMI of 32, elevated blood pressure at 145/90 mmHg, and a fasting blood glucose level of 180 mg/dL. His HbA1c is measured at 8.5%, indicating poor glycemic control.",
    "actual_diagnosis": "4. Type 2 diabetes mellitus, ICD-10 code E11.9"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with auditory hallucinations, stating he hears voices telling him to harm himself. On examination, he exhibits disorganized speech and a flat affect. There are no acute medical issues noted on laboratory tests, and a CT scan of the brain reveals no structural abnormalities. He has a history of declining social and occupational functioning over the past six months.",
    "actual_diagnosis": "12. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with progressive enlargement of his hands and feet over the past five years, along with deepening of his voice and increased sweating. Physical examination reveals pronounced facial changes, including a prominent jaw and enlarged nose, as well as increased spacing between his teeth. Serum growth hormone levels are elevated, and MRI of the sella shows a pituitary adenoma.",
    "actual_diagnosis": "10. Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "A 6-year-old boy presents with recurrent episodes of joint swelling and pain after minor injuries. On physical examination, there is notable hemarthrosis in his right knee and a history of easy bruising. Laboratory tests reveal a prolonged activated partial thromboplastin time (aPTT) and a normal prothrombin time (PT), with factor VIII levels significantly decreased. These findings suggest a bleeding disorder consistent with his symptoms.",
    "actual_diagnosis": "14. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with severe pain and swelling in his right big toe, which began suddenly overnight. On examination, the affected joint is erythematous, warm, and tender to touch. Serum uric acid levels are measured at 9.5 mg/dL, indicating hyperuricemia. Joint aspiration reveals the presence of monosodium urate crystals.",
    "actual_diagnosis": "13. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 28-year-old male presents with a chief complaint of red, scaly patches on his elbows and knees that have been persistent for several months. On physical examination, there are well-defined erythematous plaques covered with silvery scales. There is no evidence of joint swelling or tenderness. Laboratory results show elevated serum levels of inflammatory markers but no signs of infection or other dermatological conditions.",
    "actual_diagnosis": "17. Psoriasis, ICD-10 code L40.9"
  },
  {
    "doctor_vignette": "A 32-year-old African American female presents with persistent dry cough and fatigue for the past three months. On examination, she has bilateral hilar lymphadenopathy noted on chest X-ray and mild erythema nodosum on her lower extremities. Laboratory tests reveal elevated serum angiotensin-converting enzyme (ACE) levels and hypercalcemia, raising suspicion for granulomatous disease.",
    "actual_diagnosis": "19. Sarcoidosis, ICD-10 code D86.9"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with confusion and ataxia after a prolonged period of alcohol abuse. On examination, he demonstrates ophthalmoplegia and nystagmus. MRI of the brain reveals lesions in the thalamus and mammillary bodies. Serum thiamine levels are significantly low, confirming deficiency.",
    "actual_diagnosis": "Wernicke's encephalopathy, ICD-10 code G93.89"
  },
  {
    "doctor_vignette": "A 54-year-old obese male presents with complaints of excessive daytime sleepiness and loud snoring, as reported by his partner. Physical examination reveals a thick neck circumference and signs of hypertension. A home sleep study shows recurrent apneas and hypopneas during sleep, leading to significant oxygen desaturation.",
    "actual_diagnosis": "Obstructive sleep apnea, ICD-10 code G47.30"
  },
  {
    "doctor_vignette": "A 12-year-old male presents with a chief complaint of wheezing and shortness of breath that worsens at night. On physical examination, he has prolonged expiratory phase and diffuse wheezing bilaterally. Peak expiratory flow rate is measured at 60% of predicted value, indicating significant airway obstruction. A history of allergen exposure and previous asthma attacks is noted.",
    "actual_diagnosis": "Bronchial asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with a chief complaint of high fever and severe cough lasting for three days. Physical examination reveals tachypnea, hypoxia with an oxygen saturation of 88%, and bilateral crackles on auscultation. Chest X-ray shows bilateral infiltrates, and a PCR test for SARS-CoV-2 is positive.",
    "actual_diagnosis": "Severe acute respiratory syndrome, ICD-10 code B97.21"
  },
  {
    "doctor_vignette": "A 65-year-old male with a history of rheumatic heart disease presents with fever, chills, and a new heart murmur. On examination, he has splinter hemorrhages and petechiae on his extremities. Blood cultures reveal the presence of Streptococcus viridans, and an echocardiogram shows vegetations on the mitral valve.",
    "actual_diagnosis": "Infective endocarditis, ICD-10 code I33.0"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with complaints of unintentional weight loss, increased heart rate, and anxiety over the past three months. Physical examination reveals a fine tremor in her hands, and a thyroid exam shows a diffusely enlarged gland. Laboratory results indicate elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "8. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of tremors in his right hand that have been progressively worsening over the past six months. Physical examination reveals a resting tremor, bradykinesia, and rigidity in the right upper extremity. Gait analysis shows shuffling steps and decreased arm swing. MRI of the brain shows no significant abnormalities, ruling out other causes of the symptoms.",
    "actual_diagnosis": "12. Parkinson's disease, ICD-10 code G20"
  },
  {
    "doctor_vignette": "A 28-year-old female presents to the emergency department with difficulty breathing and swelling of the face and throat after eating shellfish. On exam, she exhibits hives, wheezing, and tachycardia. Vital signs show a blood pressure of 85/50 mmHg, and an oxygen saturation of 88% on room air. Serum tryptase levels are elevated, confirming an anaphylactic reaction.",
    "actual_diagnosis": "13. Severe allergic reaction, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with a persistent productive cough and difficulty gaining weight. On examination, he has digital clubbing and coarse lung sounds bilaterally. Sweat chloride test results show elevated levels, confirming the diagnosis. His family history reveals that his older sister was diagnosed with cystic fibrosis at a young age.",
    "actual_diagnosis": "14. Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with a chief complaint of severe pain and swelling in his right big toe that started suddenly overnight. On physical exam, the toe is erythematous, swollen, and extremely tender to touch. Serum uric acid levels are found to be significantly elevated at 9.5 mg/dL, confirming the diagnosis of gout.",
    "actual_diagnosis": "16. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with auditory hallucinations and disorganized speech, expressing beliefs that he is being watched. On physical exam, he displays flat affect and poor eye contact. No abnormalities are found on routine laboratory tests, and a brain MRI shows no structural abnormalities. His symptoms have persisted for over six months, impacting his social and occupational functioning.",
    "actual_diagnosis": "11. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 30-year-old female presents with chronic diarrhea and abdominal bloating for the past six months. Physical examination reveals significant weight loss and abdominal tenderness. Serological tests show elevated tissue transglutaminase antibodies (tTG-IgA) and a low hemoglobin level indicating iron deficiency anemia. A duodenal biopsy confirms villous atrophy.",
    "actual_diagnosis": "9. Celiac disease, ICD-10 code K90.0"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of increasing shortness of breath and a chronic cough that has persisted for several months. On physical examination, he exhibits wheezing, decreased breath sounds, and use of accessory muscles for breathing. A chest X-ray shows hyperinflation of the lungs, and pulmonary function tests reveal an FEV1/FVC ratio of 60%, consistent with obstructive disease.",
    "actual_diagnosis": "18. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with progressive chorea and cognitive decline over the past year. Physical examination reveals involuntary movements, slurred speech, and rigidity. Family history is significant for Huntington's disease, with her mother diagnosed in her early 50s. Genetic testing confirms the CAG repeat expansion in the HTT gene.",
    "actual_diagnosis": "20. Huntington's disease, ICD-10 code G10"
  },
  {
    "doctor_vignette": "A 12-year-old male presents with a chief complaint of persistent wheezing and coughing, especially at night. Physical exam reveals prolonged expiratory phase and use of accessory muscles for breathing. Peak expiratory flow rate is measured at 60% of predicted values, indicating significant airway obstruction. No acute infections are noted on chest X-ray, ruling out pneumonia.",
    "actual_diagnosis": "17. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 68-year-old female presents with a chief complaint of persistent back pain after a recent fall. Physical examination reveals a stooped posture and tenderness over the lumbar spine. A DEXA scan shows a T-score of -3.2, indicating severe osteoporosis. No fractures are noted on X-ray, but the patient's history of frequent falls raises concerns for future complications.",
    "actual_diagnosis": "6. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with a chief complaint of frequent respiratory infections and persistent cough. On physical examination, she has fingertip clubbing and wheezing upon auscultation. Sweat chloride test reveals a high chloride concentration of 90 mmol/L, consistent with cystic fibrosis.",
    "actual_diagnosis": "9. Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 26-year-old female presents with a chief complaint of persistent abdominal pain and diarrhea for the past three months. On physical examination, she has tenderness in the right lower quadrant and signs of malnutrition. Laboratory tests reveal elevated C-reactive protein (CRP) and anemia, while a CT scan shows thickening of the terminal ileum consistent with inflammation.",
    "actual_diagnosis": "8. Crohn's disease, ICD-10 code K50.90"
  },
  {
    "doctor_vignette": "A 58-year-old male presents to the emergency department with chest pain radiating to his left arm, accompanied by shortness of breath and diaphoresis. On examination, he is diaphoretic and has a blood pressure of 90/60 mmHg, with a heart rate of 100 bpm and an irregular rhythm. An ECG shows ST-segment elevation in the anterior leads, and cardiac troponin levels are elevated at 5.0 ng/mL, indicating myocardial injury.",
    "actual_diagnosis": "7. Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with fatigue, weight gain, and cold intolerance. On physical examination, she has dry skin, thinning hair, and bradycardia. Laboratory tests reveal an elevated TSH level of 8.5 mIU/L and a low free T4 level of 0.7 ng/dL, indicating hypothyroidism.",
    "actual_diagnosis": "11. Hypothyroidism, ICD-10 code E03.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with complaints of gradual peripheral vision loss over the past year. On physical examination, the intraocular pressure is measured at 28 mmHg in both eyes, and a visual field test reveals significant constriction of the visual fields. Fundoscopic examination shows cupping of the optic nerves consistent with glaucoma.",
    "actual_diagnosis": "13. Glaucoma, ICD-10 code H40.9"
  },
  {
    "doctor_vignette": "A 62-year-old male presents to the emergency department with a chief complaint of high fever and confusion for the past two days. On physical exam, he is noted to be tachycardic with a heart rate of 120 bpm, hypotensive with a blood pressure of 85/55 mmHg, and has warm, flushed skin. Laboratory results reveal a white blood cell count of 18,000 cells/mm³ and blood cultures are pending, suggesting a possible infectious source.",
    "actual_diagnosis": "14. Sepsis, ICD-10 code A41.9"
  },
  {
    "doctor_vignette": "A 12-year-old female presents with a chief complaint of wheezing and shortness of breath, especially at night and during physical activity. On physical examination, she exhibits prolonged expiratory wheezes and uses accessory muscles for breathing. Peak flow measurements show a marked reduction in her expiratory flow rate, indicating significant airway obstruction.",
    "actual_diagnosis": "16. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with auditory hallucinations and delusions of persecution, stating that he believes he is being watched. On examination, he appears disheveled, with flat affect and disorganized speech. Neurological exam is unremarkable, and routine blood tests show no abnormalities. A psychiatric evaluation confirms the presence of psychotic symptoms persisting for over six months.",
    "actual_diagnosis": "15. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with recurrent joint swelling and pain in his knees after minor injuries. On physical examination, there is notable swelling and tenderness in the right knee joint, and he has a history of easy bruising. Laboratory tests reveal a significantly prolonged activated partial thromboplastin time (aPTT) with normal prothrombin time (PT) and low factor VIII levels.",
    "actual_diagnosis": "17. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 24-year-old male presents with chronic lower back pain and stiffness that improves with physical activity but worsens at rest. On physical examination, he exhibits decreased lumbar flexion and tenderness over the sacroiliac joints. MRI of the pelvis reveals bilateral sacroiliitis. He also tests positive for HLA-B27 antigen.",
    "actual_diagnosis": "18. Ankylosing spondylitis, ICD-10 code M45.9"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with severe pain and swelling in his right big toe that began suddenly overnight. On examination, the joint is erythematous, warm, and exquisitely tender to touch. Elevated serum uric acid levels of 8.5 mg/dL are noted, and joint aspiration reveals needle-shaped crystals under polarized light.",
    "actual_diagnosis": "20. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "An 8-year-old boy presents with complaints of difficulty concentrating in school and impulsiveness at home. On examination, he exhibits fidgeting behavior and struggles to stay seated during the visit. No laboratory tests are indicated for diagnosis, but teacher reports confirm persistent inattention and hyperactivity across multiple settings.",
    "actual_diagnosis": "21. Attention-deficit hyperactivity disorder (ADHD), ICD-10 code F90.9"
  },
  {
    "doctor_vignette": "A 45-year-old male presents for a routine check-up with complaints of fatigue and occasional chest discomfort. Physical examination reveals a BMI of 29, with a notable xanthoma on his elbows. Laboratory results show total cholesterol of 280 mg/dL, LDL of 180 mg/dL, and triglycerides of 200 mg/dL, indicating elevated lipid levels.",
    "actual_diagnosis": "22. Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "A 20-year-old female college student presents with fatigue and pallor. On physical examination, she exhibits conjunctival pallor and tachycardia. Laboratory results reveal a hemoglobin level of 10 g/dL and low ferritin levels of 8 ng/mL, indicating iron deficiency. The patient reports heavy menstrual periods, which may contribute to her condition.",
    "actual_diagnosis": "19. Iron deficiency anemia, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 58-year-old male with a history of diabetes and hypertension presents with fatigue and swelling in his legs. On physical exam, he has elevated blood pressure, bilateral lower extremity edema, and decreased urine output. Laboratory results show a serum creatinine level of 8.5 mg/dL and a glomerular filtration rate (GFR) of 10 mL/min, indicating severe renal impairment.",
    "actual_diagnosis": "23. End-stage renal disease, ICD-10 code N18.6"
  },
  {
    "doctor_vignette": "A 22-year-old female college student presents with excessive daytime sleepiness and episodes of sudden muscle weakness triggered by laughter. Physical examination reveals no neurological deficits, but the patient reports difficulty staying awake during lectures and frequent naps throughout the day. A polysomnography study shows short sleep latency and REM sleep onset within 15 minutes, consistent with narcolepsy.",
    "actual_diagnosis": "25. Narcolepsy, ICD-10 code G47.419"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with progressive muscle weakness and difficulty speaking over the past six months. Physical examination reveals fasciculations in the tongue, atrophy of the hand muscles, and hyperreflexia in the lower extremities. Electromyography shows widespread denervation and reinnervation patterns, supporting a diagnosis of motor neuron disease.",
    "actual_diagnosis": "24. Amyotrophic lateral sclerosis, ICD-10 code G12.21"
  },
  {
    "doctor_vignette": "A 30-year-old female veteran presents with persistent nightmares and flashbacks related to her combat experience. On examination, she exhibits signs of hypervigilance and avoids discussions about her military service. There are no abnormal lab results, but a PTSD checklist reveals significant distress. She reports difficulty concentrating and has a heightened startle response.",
    "actual_diagnosis": "Post-traumatic stress disorder, ICD-10 code F43.12"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of worsening cough and shortness of breath over the past three days. On physical examination, he exhibits decreased breath sounds and crackles in the right lower lung field. A chest X-ray reveals a right lower lobe infiltrate, and a rapid influenza test is positive for influenza A.",
    "actual_diagnosis": "Pneumonia due to influenza, ICD-10 code J10.9"
  },
  {
    "doctor_vignette": "A 3-year-old male presents with a chief complaint of ear pain and irritability for the past two days. On physical examination, the child exhibits a fever of 102°F, and the otoscopic exam reveals a bulging, erythematous tympanic membrane in the right ear with decreased mobility. No imaging is necessary as the clinical findings are consistent with the diagnosis.",
    "actual_diagnosis": "Acute otitis media, ICD-10 code H65.9"
  },
  {
    "doctor_vignette": "A 5-year-old male presents with a chief complaint of fatigue and frequent infections. Physical examination reveals significant muscle wasting, a distended abdomen, and skin changes indicating edema. Laboratory tests show a serum albumin level of 2.0 g/dL and a weight-for-height z-score below -3 standard deviations, consistent with severe acute malnutrition.",
    "actual_diagnosis": "Severe acute malnutrition, ICD-10 code E40"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of painful anal bleeding during bowel movements that has persisted for two weeks. On physical examination, there are external hemorrhoids visible at the anal verge, and tenderness is noted on palpation. No significant lab or imaging results are required for diagnosis, as the findings are consistent with hemorrhoidal disease.",
    "actual_diagnosis": "Hemorrhoids, ICD-10 code I84.9"
  },
  {
    "doctor_vignette": "A 22-year-old female college student presents with excessive daytime sleepiness, experiencing uncontrollable sleep episodes during lectures and while studying. On physical examination, she shows no neurological deficits, but reports cataplexy episodes triggered by laughter. Polysomnography reveals a shortened sleep latency of 2 minutes and multiple sleep-onset REM periods.",
    "actual_diagnosis": "Narcolepsy, ICD-10 code G47.4"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with persistent headaches, palpitations, and episodes of sweating. On examination, her blood pressure is noted to be 180/110 mmHg during these episodes. Urinary catecholamine levels are significantly elevated, and a CT scan reveals a 3 cm adrenal mass consistent with a pheochromocytoma.",
    "actual_diagnosis": "Pheochromocytoma, ICD-10 code C74.1"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a chief complaint of persistent fatigue lasting over six months, unrelieved by rest. Physical examination reveals mild cervical lymphadenopathy and tenderness in the muscles. Laboratory tests show normal complete blood count and thyroid function, ruling out other causes of fatigue.",
    "actual_diagnosis": "Chronic fatigue syndrome, ICD-10 code G93.3"
  },
  {
    "doctor_vignette": "A 12-year-old female presents with her mother, complaining of dark, velvety patches on her neck and armpits that have been gradually increasing over the past six months. Physical examination reveals thickened, hyperpigmented skin in these areas, with no signs of inflammation or pruritus. Laboratory tests show elevated insulin levels, and the patient's BMI is in the 95th percentile, indicating obesity.",
    "actual_diagnosis": "Acanthosis nigricans, ICD-10 code L82"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with elevated cholesterol levels and a recent history of chest pain. Physical examination reveals xanthomas on the elbows and tendons, along with a BMI of 32. Laboratory tests show a total cholesterol level of 320 mg/dL and triglycerides at 180 mg/dL, indicating a lipid metabolism disorder.",
    "actual_diagnosis": "Lipid metabolism disorder, ICD-10 code E78.9"
  },
  {
    "doctor_vignette": "A 4-year-old male presents with a 5-day history of fever, conjunctivitis, and a rash. On examination, he has swollen cervical lymph nodes and cracked lips. Laboratory tests show elevated inflammatory markers, including an increased ESR and CRP, along with thrombocytosis. Echocardiogram reveals a dilated coronary artery, raising concern for vasculitis.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I00"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with fatigue, jaundice, and abdominal discomfort. On physical examination, he has palpable hepatomegaly and scleral icterus. Laboratory tests reveal elevated liver enzymes (AST 150 U/L, ALT 180 U/L) and positive anti-HCV antibodies, confirming chronic hepatitis C infection.",
    "actual_diagnosis": "Hepatitis C, ICD-10 code B18.2"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with sudden onset of lower extremity weakness and sensory loss. On physical examination, she demonstrates decreased strength in both legs, along with hyperreflexia and a sensory level at T10. MRI of the spine reveals a T2 hyperintense lesion involving the spinal cord at the thoracic level, consistent with inflammation. Laboratory tests show elevated oligoclonal bands in the cerebrospinal fluid, indicating an inflammatory process.",
    "actual_diagnosis": "Transverse myelitis, ICD-10 code G37.3"
  },
  {
    "doctor_vignette": "A 25-year-old male presents to the emergency department with difficulty breathing and swelling of the lips after eating a peanut butter sandwich. Physical examination reveals wheezing, urticaria on the trunk, and hypotension. Serum tryptase is elevated, confirming an anaphylactic reaction.",
    "actual_diagnosis": "Anaphylaxis due to food, ICD-10 code T78.2"
  },
  {
    "doctor_vignette": "A 68-year-old female presents with a chief complaint of persistent knee pain that worsens with activity and improves with rest. On physical examination, there is notable crepitus and tenderness over the medial aspect of the right knee, along with decreased range of motion. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "Osteoarthritis, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with persistent fatigue and unexplained weight loss over the past three months. Physical examination reveals lymphadenopathy in the cervical and axillary regions, as well as splenomegaly. A CT scan of the abdomen shows enlarged lymph nodes in the retroperitoneal space, and a biopsy confirms lymphoproliferative disorder. Blood tests reveal elevated lactate dehydrogenase (LDH) levels and anemia.",
    "actual_diagnosis": "Non-Hodgkin lymphoma, ICD-10 code C85.90"
  },
  {
    "doctor_vignette": "A 24-year-old female presents with excessive daytime sleepiness and episodes of sudden muscle weakness triggered by laughter. Physical examination reveals no neurological deficits, but the patient is observed to fall asleep during the visit. A polysomnography study shows reduced REM sleep latency and multiple sleep-onset REM periods, consistent with narcolepsy.",
    "actual_diagnosis": "Narcolepsy, ICD-10 code G47.41"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of worsening cough and fever for the past three days. On examination, she has decreased breath sounds in the right lung and crackles on auscultation. A chest X-ray reveals right lower lobe infiltrates, and rapid influenza testing is positive for Influenza A.",
    "actual_diagnosis": "Pneumonia due to influenza, ICD-10 code J10.1"
  },
  {
    "doctor_vignette": "A 5-year-old male presents with a 5-day history of high fever, persistent conjunctival injection, and a strawberry tongue. On physical examination, he has a diffuse rash and cervical lymphadenopathy. Laboratory tests reveal elevated inflammatory markers, including ESR and CRP, along with a normal white blood cell count.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I25.1"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with joint pain and a rash on her cheeks that worsens with sun exposure. On physical exam, there is a butterfly rash noted on the face, and tenderness is present in multiple joints. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated anti-double-stranded DNA antibodies.",
    "actual_diagnosis": "Lupus erythematosus, systemic, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 3-year-old male presents with a high fever, irritability, and vomiting. On physical exam, he exhibits a positive Brudzinski's sign and neck stiffness. A lumbar puncture reveals cloudy cerebrospinal fluid with an elevated white blood cell count predominantly consisting of neutrophils, and a positive culture for Streptococcus pneumoniae.",
    "actual_diagnosis": "Bacterial meningitis, ICD-10 code A37.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with fatigue and persistent lower extremity edema. On physical examination, there is notable bilateral pitting edema and a blood pressure of 150/90 mmHg. Laboratory tests reveal an elevated serum creatinine level of 2.5 mg/dL and a glomerular filtration rate (GFR) of 30 mL/min, indicating impaired kidney function.",
    "actual_diagnosis": "8. Chronic kidney disease, ICD-10 code N18.9"
  },
  {
    "doctor_vignette": "A 68-year-old female presents with a chief complaint of persistent lower back pain that worsened over the past few months. On physical examination, she exhibits a decreased range of motion in the lumbar spine and has a noticeable kyphotic posture. A DEXA scan reveals a T-score of -2.8 in the lumbar spine, indicating significant bone density loss.",
    "actual_diagnosis": "7. Osteoporosis, ICD-10 code M81.0"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of progressive loss of skin pigmentation over the past 6 months. Physical examination reveals well-defined, depigmented macules on the face, hands, and elbows. No other significant findings are noted, and laboratory tests show normal complete blood count and thyroid function tests, ruling out autoimmune conditions.",
    "actual_diagnosis": "Vitiligo, ICD-10 code L80"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with a chief complaint of wheezing and shortness of breath after playing soccer. On examination, he exhibits prolonged expiratory phase and diffuse wheezing bilaterally. A peak flow measurement shows a reading of 60% of his predicted value, indicating significant airway obstruction. A recent chest X-ray is unremarkable, ruling out other causes of his symptoms.",
    "actual_diagnosis": "6. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 55-year-old male presents with a chief complaint of severe pain and swelling in his right big toe, which began suddenly overnight. On examination, the toe is erythematous, warm, and tender to touch, with marked swelling. Serum uric acid levels are found to be elevated at 9.2 mg/dL, supporting the diagnosis of gout.",
    "actual_diagnosis": "10. Gout, ICD-10 code M10.9"
  },
  {
    "doctor_vignette": "A 29-year-old female presents with a chief complaint of unintentional weight loss and increased heart rate. On physical examination, she has a fine tremor in her hands, moist skin, and a palpable goiter. Laboratory tests reveal elevated free T4 and suppressed TSH levels, confirming hyperthyroidism.",
    "actual_diagnosis": "13. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 72-year-old male presents to the emergency department with palpitations and shortness of breath for the past two days. On examination, his heart rate is irregularly irregular, and he exhibits mild edema in the lower extremities. An ECG shows atrial fibrillation with a rapid ventricular response, and a chest X-ray reveals mild cardiomegaly.",
    "actual_diagnosis": "14. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 42-year-old male presents with severe abdominal pain radiating to the back, onset after a weekend of heavy drinking. On physical examination, he is diaphoretic with tenderness in the epigastric region and decreased bowel sounds. Laboratory tests reveal elevated serum amylase and lipase levels, and an abdominal ultrasound shows peritoneal fluid and inflammation around the pancreas.",
    "actual_diagnosis": "15. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 22-year-old male presents with auditory hallucinations and disorganized thoughts, stating he hears voices telling him to harm himself. On examination, he displays flat affect and poor eye contact, with no significant neurological deficits. Routine lab tests are unremarkable, and a CT scan of the brain shows no structural abnormalities, ruling out other causes of his symptoms.",
    "actual_diagnosis": "18. Schizophrenia, ICD-10 code F20.9"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with widespread musculoskeletal pain, fatigue, and sleep disturbances lasting over six months. On physical examination, tenderness is noted in multiple trigger points, including the neck, shoulders, and hips. Routine laboratory tests, including complete blood count and metabolic panel, show no abnormalities, and imaging studies reveal no structural issues. The patient reports significant daily functional impairment due to her symptoms.",
    "actual_diagnosis": "17. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 75-year-old male presents with shortness of breath and fatigue that worsens with exertion. Physical examination reveals bilateral lower extremity edema, jugular venous distention, and crackles upon auscultation of the lungs. A chest X-ray shows cardiomegaly and pulmonary congestion, while a B-type natriuretic peptide (BNP) level is significantly elevated at 900 pg/mL.",
    "actual_diagnosis": "12. Congestive heart failure, ICD-10 code I50.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with worsening muscle weakness, particularly in her eyelids and limbs, that increases throughout the day. On examination, she exhibits ptosis and diplopia, with normal strength in the morning that declines by afternoon. Repetitive nerve stimulation test reveals a decremental response, and acetylcholine receptor antibody test returns positive. ",
    "actual_diagnosis": "21. Myasthenia gravis, ICD-10 code G70.00"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with worsening fatigue and decreased urine output over the past month. On physical exam, he has bilateral peripheral edema and a blood pressure of 180/100 mmHg. Laboratory tests reveal a serum creatinine level of 8.5 mg/dL and a glomerular filtration rate (GFR) of 10 mL/min, indicating severely impaired kidney function.",
    "actual_diagnosis": "20. End-stage renal disease, ICD-10 code N18.6"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of persistent joint pain and fatigue. On physical examination, she has a butterfly-shaped rash on her face, along with swelling in her wrists and knees. Laboratory tests reveal a positive antinuclear antibody (ANA) test and elevated anti-dsDNA antibodies, with a mild anemia noted in her complete blood count.",
    "actual_diagnosis": "11. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 19-year-old female presents with joint hypermobility and recurrent shoulder dislocations. Physical examination reveals hyperextensible skin and a positive Beighton score of 7/9. Family history is notable for similar symptoms in her mother and sister. Genetic testing confirms a mutation associated with Ehlers-Danlos syndrome.",
    "actual_diagnosis": "22. Ehlers-Danlos syndrome, ICD-10 code Q79.6"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with a chief complaint of persistent cough and recurrent respiratory infections. Physical examination reveals digital clubbing and wheezing on auscultation. Sweat chloride test shows elevated levels at 90 mmol/L, confirming the diagnosis.",
    "actual_diagnosis": "24. Cystic fibrosis, ICD-10 code E84.9"
  },
  {
    "doctor_vignette": "A 35-year-old male presents with complaints of progressive enlargement of his hands and feet, along with facial changes such as a protruding jaw and enlarged nose. On physical examination, notable features include thickened skin, wider hands, and a prominent brow. Serum insulin-like growth factor 1 (IGF-1) levels are significantly elevated, and MRI reveals a pituitary adenoma. ",
    "actual_diagnosis": "23. Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "A 7-year-old male presents with recurrent episodes of easy bruising and prolonged bleeding following minor injuries. On physical examination, multiple bruises of varying ages are noted on his arms and legs, and there is slight swelling in his right knee after a fall. APTT is significantly prolonged, while PT and platelet count remain normal, indicating a potential factor VIII deficiency.",
    "actual_diagnosis": "25. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 24-year-old African American female presents to the emergency department with severe abdominal pain and fatigue. On physical examination, she exhibits splenomegaly and has pallor. Laboratory tests reveal a hemoglobin level of 6.5 g/dL, elevated reticulocyte count, and the presence of sickle-shaped red blood cells on the peripheral blood smear.",
    "actual_diagnosis": "26. Sickle cell disease, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with swelling and pain in her right leg, particularly in the calf. On physical examination, there is notable tenderness and warmth in the affected area, with a positive Homan's sign. Doppler ultrasound confirms the presence of a thrombus in the right popliteal vein.",
    "actual_diagnosis": "19. Deep vein thrombosis, ICD-10 code I82.90"
  },
  {
    "doctor_vignette": "A 30-year-old female presents with fatigue, weight loss, and increased pigmentation of her skin. On physical examination, she has low blood pressure and hyperkalemia is noted on her lab results. Serum cortisol levels are low, and an ACTH stimulation test shows inadequate response, confirming adrenal insufficiency.",
    "actual_diagnosis": "27. Addison's disease, ICD-10 code E27.1"
  },
  {
    "doctor_vignette": "A 25-year-old male presents with progressive muscle weakness and atrophy in his lower extremities. On physical examination, he exhibits areflexia, high-arched feet, and a noticeable foot drop. Nerve conduction studies reveal reduced conduction velocities consistent with a demyelinating neuropathy. Genetic testing confirms a mutation in the PMP-22 gene, supporting the diagnosis.",
    "actual_diagnosis": "28. Charcot-Marie-Tooth disease, ICD-10 code G60.0"
  },
  {
    "doctor_vignette": "A 25-year-old male presents with complaints of increasing chest pain and palpitations. Upon examination, he demonstrates a tall stature, long limbs, and arachnodactyly, with a high arched palate. An echocardiogram reveals a dilated aortic root consistent with Marfan syndrome.",
    "actual_diagnosis": "30. Marfan syndrome, ICD-10 code Q87.4"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with excessive daytime sleepiness and episodes of sudden muscle weakness triggered by laughter. Physical examination reveals no neurological deficits, but she demonstrates difficulty maintaining wakefulness during a brief cognitive assessment. Polysomnography indicates a short sleep latency and multiple sleep-onset REM periods, confirming the diagnosis.",
    "actual_diagnosis": "29. Narcolepsy, ICD-10 code G47.419"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with left calf swelling and pain after a long flight. Physical examination reveals a tender, swollen left calf with a positive Homan's sign. Ultrasound of the lower extremity shows a non-compressible deep vein consistent with thrombosis. D-dimer levels are elevated, further supporting the diagnosis.",
    "actual_diagnosis": "Deep vein thrombosis, ICD-10 code I82.409"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of worsening shortness of breath and persistent cough for the past week. On physical examination, he exhibits fever, decreased breath sounds on the right side, and crackles upon auscultation. A chest X-ray reveals right lower lobe consolidation, and a PCR test confirms SARS-CoV-2 infection.",
    "actual_diagnosis": "Pneumonia due to Covid-19, ICD-10 code U07.1"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with a chief complaint of severe anxiety and palpitations. On examination, she is febrile with a temperature of 102°F, tachycardic at 150 beats per minute, and exhibits tremors and a diffuse goiter. Laboratory results show elevated free T4 levels at 5.5 ng/dL and suppressed TSH levels at <0.01 mIU/L.",
    "actual_diagnosis": "Thyroid storm, ICD-10 code E05.0"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with lower back pain radiating to both legs, worsening with walking and relieved by sitting. Physical examination reveals diminished reflexes in the lower extremities and bilateral lower limb weakness. MRI of the lumbar spine shows significant narrowing of the spinal canal at L3-L4 due to degenerative changes.",
    "actual_diagnosis": "Spinal stenosis, ICD-10 code M48.0"
  },
  {
    "doctor_vignette": "A 25-year-old male presents to the emergency department with sudden-onset sharp chest pain and dyspnea after lifting heavy weights. On physical examination, he exhibits decreased breath sounds on the right side and hyper-resonance on percussion. A chest X-ray reveals a large right-sided pneumothorax with mediastinal shift. Oxygen saturation is 92% on room air.",
    "actual_diagnosis": "Pneumothorax, ICD-10 code J93.9"
  },
  {
    "doctor_vignette": "A 19-year-old female presents with complaints of frequent episodes of binge eating followed by purging. On physical examination, she is underweight with a BMI of 17, dental erosion is noted, and her skin has signs of dehydration. Laboratory tests reveal hypokalemia and metabolic alkalosis.",
    "actual_diagnosis": "Bulimia nervosa, ICD-10 code F50.2"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with progressive stiffness and difficulty using his right hand, which he describes as feeling clumsy. On examination, there is marked rigidity in the right arm and an asymmetric posture with the right side slightly flexed. He exhibits a phenomenon known as 'alien hand syndrome,' where he cannot control his right hand's movements. MRI shows asymmetric cortical atrophy, particularly in the parietal and frontal lobes, consistent with corticobasal degeneration.",
    "actual_diagnosis": "Corticobasal degeneration, ICD-10 code G31.8"
  },
  {
    "doctor_vignette": "An 11-year-old female presents with excessive thirst, frequent urination, and unexplained weight loss over the past month. Physical examination reveals dehydration and a fruity-smelling breath. Blood glucose level is found to be 350 mg/dL, and ketones are present in the urine.",
    "actual_diagnosis": "4. Diabetes mellitus type 1, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of persistent knee pain that worsens with activity and improves with rest. On physical examination, there is tenderness and crepitus on palpation of the right knee, along with limited range of motion. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "6. Osteoarthritis, ICD-10 code M15.9"
  },
  {
    "doctor_vignette": "A 10-year-old male presents to the emergency department with a chief complaint of wheezing and shortness of breath after playing outside in cold weather. On physical examination, he exhibits prolonged expiratory phase, use of accessory muscles for breathing, and decreased breath sounds bilaterally. Peak expiratory flow rate is measured at 60% of predicted, indicating significant airflow obstruction.",
    "actual_diagnosis": "7. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 24-year-old female presents with abdominal pain and diarrhea that has persisted for the last three months. On physical examination, she has tenderness in the right lower quadrant and a palpable mass. Laboratory tests reveal elevated C-reactive protein (CRP) and anemia, while a CT scan shows transmural inflammation of the terminal ileum with strictures.",
    "actual_diagnosis": "9. Crohn's disease, ICD-10 code K50.90"
  },
  {
    "doctor_vignette": "A 24-year-old female presents with a chief complaint of extreme mood swings, ranging from euphoric to deeply depressed over the past six months. On physical examination, she demonstrates rapid speech and increased energy during the manic phase, while during the depressive phase, she appears lethargic and withdrawn. No significant lab abnormalities are noted, and a mood chart reveals episodes of mania and depression lasting several days each.",
    "actual_diagnosis": "13. Bipolar disorder, ICD-10 code F31.9"
  },
  {
    "doctor_vignette": "A 25-year-old female presents to the emergency department after experiencing a generalized tonic-clonic seizure lasting approximately 3 minutes. On physical examination, she is alert but disoriented postictally, with no focal neurological deficits noted. A CT scan of the head is unremarkable, and routine blood tests show normal electrolyte levels. This is her first seizure episode.",
    "actual_diagnosis": "14. Epilepsy, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with fatigue and decreased urine output over the past month. Physical examination reveals bilateral lower extremity edema and hypertension. Laboratory tests show a serum creatinine level of 2.5 mg/dL and an estimated glomerular filtration rate (eGFR) of 45 mL/min, indicating stage 3 chronic kidney disease.",
    "actual_diagnosis": "15. Chronic kidney disease stage 3, ICD-10 code N18.3"
  },
  {
    "doctor_vignette": "A 42-year-old female presents to the emergency department with severe right upper quadrant pain and nausea lasting 24 hours. On physical examination, she has tenderness in the right upper quadrant with a positive Murphy's sign. Laboratory tests reveal leukocytosis with a white blood cell count of 14,500/µL, and an abdominal ultrasound shows gallbladder wall thickening and pericholecystic fluid, consistent with acute cholecystitis.",
    "actual_diagnosis": "11. Acute cholecystitis, ICD-10 code K81.0"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with a chief complaint of tremors in his right hand that have progressively worsened over the last six months. During the physical exam, notable findings include a resting tremor, bradykinesia, and rigidity in the upper extremities. Dopamine transporter (DAT) imaging reveals decreased uptake in the putamen, consistent with Parkinsonian syndromes.",
    "actual_diagnosis": "17. Parkinson's disease, ICD-10 code G20"
  },
  {
    "doctor_vignette": "A 72-year-old male presents to the emergency department with palpitations and shortness of breath that started suddenly three hours ago. Upon examination, his heart rate is irregularly irregular, and he has a blood pressure of 110/70 mmHg. An ECG reveals atrial fibrillation with a rapid ventricular response, and laboratory tests show elevated levels of BNP, indicating heart strain.",
    "actual_diagnosis": "18. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 12-year-old African American male presents with severe fatigue and recurrent pain episodes in his chest and abdomen. On physical examination, he has pallor and mild jaundice, with splenomegaly noted on palpation. A complete blood count reveals a hemoglobin level of 7.5 g/dL and a peripheral blood smear shows sickle-shaped red blood cells.",
    "actual_diagnosis": "Sickle cell anemia, ICD-10 code D57.1"
  },
  {
    "doctor_vignette": "A 45-year-old male presents for a routine check-up, expressing concern about his family history of heart disease. Physical examination reveals a BMI of 30, with xanthomas noted on his elbows. Laboratory tests show elevated total cholesterol at 280 mg/dL and triglycerides at 180 mg/dL. LDL levels are significantly high at 170 mg/dL, prompting further evaluation.",
    "actual_diagnosis": "19. Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "A 67-year-old male presents with a chief complaint of persistent shortness of breath and a chronic cough with sputum production. On physical examination, he exhibits wheezing and prolonged expiration, along with decreased breath sounds bilaterally. A chest X-ray shows hyperinflation of the lungs, and spirometry reveals a FEV1/FVC ratio of 0.55, indicating obstructive lung disease.",
    "actual_diagnosis": "5. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  },
  {
    "doctor_vignette": "A 28-year-old woman presents with fatigue and pallor. On physical examination, she has conjunctival pallor and tachycardia. Laboratory tests reveal a hemoglobin level of 9.2 g/dL, low ferritin of 10 ng/mL, and low serum iron. These findings are consistent with iron deficiency anemia.",
    "actual_diagnosis": "11. Iron deficiency anemia, ICD-10 code D50.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of persistent heartburn and regurgitation, especially after meals. On physical examination, she has epigastric tenderness and reports a sour taste in her mouth. An upper endoscopy reveals erosive esophagitis, and a pH probe test shows abnormal acid exposure in the esophagus.",
    "actual_diagnosis": "14. Gastroesophageal reflux disease, ICD-10 code K21.9"
  },
  {
    "doctor_vignette": "A 72-year-old female presents with increasing forgetfulness, particularly misplacing items and repeating questions. On physical examination, she shows signs of disorientation to time and place, along with mild aphasia. A CT scan of the head reveals generalized cortical atrophy, particularly in the temporal and parietal lobes, consistent with neurodegenerative changes. Neuropsychological testing indicates significant impairment in memory and executive function.",
    "actual_diagnosis": "15. Alzheimer’s disease, ICD-10 code G30.9"
  },
  {
    "doctor_vignette": "A 58-year-old female presents with swelling and pain in her left leg, which she noticed after a long-haul flight. On physical examination, there is significant unilateral edema and tenderness in the calf, with a positive Homan's sign. Doppler ultrasound reveals a thrombus in the left popliteal vein.",
    "actual_diagnosis": "16. Deep vein thrombosis, ICD-10 code I82.409"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of worsening knee pain, especially during weight-bearing activities. On physical examination, there is noticeable crepitus, tenderness along the joint line, and limited range of motion in the right knee. An X-ray shows joint space narrowing and osteophyte formation, consistent with osteoarthritis.",
    "actual_diagnosis": "8. Osteoarthritis of the knee, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with a chief complaint of unintentional weight loss and increased anxiety. On physical examination, she exhibits a fine tremor, heat intolerance, and a rapid heart rate of 110 beats per minute. Laboratory tests reveal a suppressed TSH level and elevated free T4 and T3 levels, indicating hyperthyroidism.",
    "actual_diagnosis": "17. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with widespread musculoskeletal pain and fatigue persisting for over six months. Physical examination reveals tender points in multiple areas, including the neck, shoulders, and hips, with no significant neurological deficits. Comprehensive lab tests show normal results, ruling out other conditions such as rheumatoid arthritis and thyroid dysfunction.",
    "actual_diagnosis": "21. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with a chief complaint of persistent joint pain and stiffness, particularly in the hands and wrists, which worsens in the morning. On physical exam, there is notable swelling and tenderness in the metacarpophalangeal joints bilaterally, along with a decreased range of motion. Laboratory tests reveal a positive rheumatoid factor and elevated C-reactive protein levels, indicating inflammation.",
    "actual_diagnosis": "18. Rheumatoid arthritis, ICD-10 code M06.9"
  },
  {
    "doctor_vignette": "A 12-year-old male presents with a chief complaint of wheezing and shortness of breath, especially during physical activity. On physical examination, he exhibits prolonged expiratory wheezes and decreased breath sounds bilaterally. Peak expiratory flow rate (PEFR) is recorded at 60% of predicted, indicating significant airflow obstruction. No chest X-ray abnormalities are noted, supporting the diagnosis of asthma exacerbation.",
    "actual_diagnosis": "20. Asthma, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 10-year-old male presents with persistent fatigue, fever, and easy bruising over the past month. Physical examination reveals pallor, petechiae on the extremities, and splenomegaly. Complete blood count shows leukocytosis with 80% lymphoblasts and thrombocytopenia. Bone marrow biopsy confirms the presence of acute lymphoblastic leukemia.",
    "actual_diagnosis": "22. Acute lymphoblastic leukemia, ICD-10 code C91.0"
  },
  {
    "doctor_vignette": "A 32-year-old male presents for a routine check-up, reporting no specific complaints. Physical examination reveals a body mass index of 29 and xanthomas on his elbows. A lipid panel shows total cholesterol of 280 mg/dL and LDL cholesterol of 180 mg/dL. Family history is significant for hyperlipidemia and coronary artery disease.",
    "actual_diagnosis": "23. Hyperlipidemia, ICD-10 code E78.5"
  },
  {
    "doctor_vignette": "An 18-month-old male presents with a 5-day history of high fever, persistent irritability, and a rash. On physical examination, he has conjunctival injection, cracked lips, and cervical lymphadenopathy. Laboratory tests reveal an elevated ESR and thrombocytosis, while echocardiography shows no coronary artery abnormalities.",
    "actual_diagnosis": "Kawasaki disease, ICD-10 code I.max"
  },
  {
    "doctor_vignette": "A 68-year-old male presents to the emergency department with palpitations and shortness of breath that started abruptly over the last hour. Physical examination reveals an irregularly irregular pulse with a rapid heart rate of 130 beats per minute and bilateral lung crackles. An ECG shows atrial fibrillation with a rapid ventricular response, and a chest X-ray reveals mild pulmonary congestion.",
    "actual_diagnosis": "25. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 5-year-old male presents with a chief complaint of itchy, red patches on his arms and cheeks. Physical examination reveals dry, scaly skin with excoriated areas and erythematous lesions typical of atopic dermatitis. No lab tests are indicated, as the diagnosis is clinical based on the characteristic appearance of the skin.",
    "actual_diagnosis": "24. Eczema, ICD-10 code L30.9"
  },
  {
    "doctor_vignette": "A 45-year-old female presents with recurrent episodes of vertigo lasting 20 minutes to several hours, accompanied by tinnitus and a sensation of fullness in the right ear. On physical examination, she demonstrates a positive Romberg test and nystagmus on lateral gaze. Audiometry reveals a moderate sensorineural hearing loss in the right ear, and an MRI of the brain shows no abnormalities, ruling out other causes of her symptoms.",
    "actual_diagnosis": "Meniere's disease, ICD-10 code H81.1"
  },
  {
    "doctor_vignette": "A 68-year-old male presents with persistent abdominal pain and significant weight loss over the past few months. Physical examination reveals a palpable mass in the epigastric region and mild jaundice. A CT scan of the abdomen shows a thickened gastric wall and enlarged regional lymph nodes, while a biopsy confirms malignant cells consistent with gastric adenocarcinoma.",
    "actual_diagnosis": "Stomach cancer, ICD-10 code C16.9"
  },
  {
    "doctor_vignette": "A 68-year-old female presents to the emergency department with confusion and a high fever of 39.5°C. On examination, she is hypotensive with a blood pressure of 85/50 mmHg, tachycardic at 120 bpm, and has cool, clammy skin. Laboratory results reveal leukocytosis with a white blood cell count of 18,000/µL and positive blood cultures for E. coli.",
    "actual_diagnosis": "Septic shock, ICD-10 code R65.21"
  },
  {
    "doctor_vignette": "A 55-year-old male with a history of chronic alcoholism presents with hematemesis and melena. On physical exam, he is noted to have jaundice and ascites, along with spider angiomata. Liver function tests reveal elevated AST and ALT levels, and an abdominal ultrasound shows signs of portal hypertension with splenomegaly.",
    "actual_diagnosis": "Esophageal varices, ICD-10 code I85.00"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with fatigue, joint pain, and a facial rash that appears in a butterfly distribution across her cheeks. On examination, she has oral ulcers and signs of arthritis in her hands. Laboratory tests reveal a positive anti-nuclear antibody (ANA) test and low complement levels, consistent with systemic lupus erythematosus.",
    "actual_diagnosis": "4. Systemic lupus erythematosus, ICD-10 code M32.9"
  },
  {
    "doctor_vignette": "A 10-year-old female presents with excessive thirst, frequent urination, and fatigue over the past two weeks. On physical examination, she is noted to have dry mucous membranes and weight loss of 5 kg since her last visit. Laboratory tests reveal a random blood glucose level of 350 mg/dL and an HbA1c of 11.5%.",
    "actual_diagnosis": "6. Type 1 diabetes mellitus, ICD-10 code E10.9"
  },
  {
    "doctor_vignette": "A 67-year-old female presents with persistent right knee pain that worsens with activity and improves with rest. On physical examination, there is notable crepitus, decreased range of motion, and tenderness along the medial joint line. X-rays reveal joint space narrowing and osteophyte formation consistent with osteoarthritis.",
    "actual_diagnosis": "9. Osteoarthritis of the knee, ICD-10 code M17.9"
  },
  {
    "doctor_vignette": "A 58-year-old male presents to the emergency department with severe chest pain radiating to his left arm and shortness of breath. Physical examination reveals diaphoresis, tachycardia, and elevated blood pressure. An ECG shows ST-segment elevations in leads II, III, and aVF, and cardiac troponin levels are markedly elevated. The patient has a history of hypertension and smoking.",
    "actual_diagnosis": "11. Acute myocardial infarction, ICD-10 code I21.9"
  },
  {
    "doctor_vignette": "A 5-year-old male presents to the emergency department with a chief complaint of excessive bleeding following a minor fall while playing. On physical examination, there are multiple bruises on his arms and legs, and his right knee is swollen and tender. Laboratory tests reveal a prolonged activated partial thromboplastin time (aPTT) of 60 seconds, while prothrombin time (PT) and platelet count are normal.",
    "actual_diagnosis": "7. Hemophilia A, ICD-10 code D66"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with fatigue and persistent lower back pain. On physical examination, there is mild edema in the lower extremities and hypertension is noted at 150/90 mmHg. Laboratory results show an elevated serum creatinine level of 2.1 mg/dL and a glomerular filtration rate (GFR) of 45 mL/min, indicating moderate chronic kidney disease.",
    "actual_diagnosis": "15. Chronic kidney disease, stage 3, ICD-10 code N18.30"
  },
  {
    "doctor_vignette": "A 22-year-old female presents to the emergency department after experiencing a generalized tonic-clonic seizure at home. On examination, she is postictal, exhibiting confusion and muscle soreness, with no focal neurological deficits noted. A CT scan of the head is unremarkable, and routine laboratory tests including electrolytes and toxicology screen return normal. The patient has no previous history of seizures.",
    "actual_diagnosis": "13. Epilepsy, unspecified, ICD-10 code G40.909"
  },
  {
    "doctor_vignette": "A 72-year-old male presents with increasing shortness of breath and fatigue during exertion. Physical examination reveals a systolic ejection murmur best heard at the right second intercostal space, along with a weak pulse and elevated blood pressure. An echocardiogram shows a significantly narrowed aortic valve with a peak gradient of 60 mmHg and a left ventricular hypertrophy pattern on EKG.",
    "actual_diagnosis": "17. Aortic stenosis, ICD-10 code I35.0"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with widespread musculoskeletal pain and fatigue lasting for over six months. On physical examination, she exhibits tenderness in multiple trigger points, including the neck, shoulders, and lower back. Laboratory tests show normal complete blood count and metabolic panel, ruling out other conditions. No imaging studies were performed as they would not provide additional diagnostic information.",
    "actual_diagnosis": "20. Fibromyalgia, ICD-10 code M79.7"
  },
  {
    "doctor_vignette": "A 12-year-old female presents to the emergency department with a chief complaint of shortness of breath and wheezing that worsened after playing outside. Physical examination reveals increased respiratory effort with a prolonged expiratory phase and diffuse wheezing on auscultation. Peak flow measurements indicate a significant reduction in airflow, at 60% of her personal best. There are no abnormal findings on chest X-ray, ruling out other acute respiratory conditions.",
    "actual_diagnosis": "18. Asthma, unspecified, ICD-10 code J45.909"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with complaints of unintentional weight loss, increased heart rate, and anxiety over the past three months. On examination, she exhibits a fine tremor in her hands, and her thyroid gland is palpably enlarged. Laboratory tests reveal elevated levels of free T4 and suppressed TSH.",
    "actual_diagnosis": "9. Hyperthyroidism, ICD-10 code E05.90"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with gradual vision loss and halos around lights. On examination, her intraocular pressure is found to be elevated at 28 mmHg in both eyes, and a visual field test reveals peripheral vision loss. Fundoscopic examination shows cupping of the optic nerve head, indicating possible glaucomatous damage.",
    "actual_diagnosis": "12. Glaucoma, ICD-10 code H40.9"
  },
  {
    "doctor_vignette": "A 72-year-old female presents to the emergency department with palpitations and shortness of breath that started suddenly two hours ago. On physical examination, her heart rate is irregularly irregular at 130 beats per minute, and she has mild bilateral pedal edema. An ECG shows atrial fibrillation with a rapid ventricular response, and her electrolytes reveal hypokalemia.",
    "actual_diagnosis": "13. Atrial fibrillation, ICD-10 code I48.91"
  },
  {
    "doctor_vignette": "A 70-year-old female presents with fatigue and weakness over the past few months. On physical examination, she has pale conjunctiva and mild splenomegaly. Laboratory tests reveal a hemoglobin level of 10 g/dL, low serum iron, and elevated ferritin levels, indicating anemia of chronic disease likely related to her history of rheumatoid arthritis.",
    "actual_diagnosis": "16. Anemia due to chronic disease, ICD-10 code D63.8"
  },
  {
    "doctor_vignette": "A 25-year-old female presents with worsening muscle weakness, particularly in her eyelids and arms, over the past month. On physical examination, she exhibits ptosis and diplopia, with muscle strength significantly improved after rest and worsened with repetitive testing. Serological tests reveal positive acetylcholine receptor antibodies, supporting the diagnosis.",
    "actual_diagnosis": "19. Myasthenia gravis, ICD-10 code G70.00"
  },
  {
    "doctor_vignette": "A 35-year-old male presents to the emergency department with severe epigastric pain radiating to the back, accompanied by nausea and vomiting. On physical examination, he has significant tenderness in the upper abdomen and is noted to have a mild fever. Laboratory tests reveal elevated serum amylase and lipase levels, and an abdominal ultrasound shows peritoneal fluid consistent with acute pancreatitis.",
    "actual_diagnosis": "17. Acute pancreatitis, ICD-10 code K85.9"
  },
  {
    "doctor_vignette": "A 28-year-old female veteran presents with persistent anxiety and flashbacks to combat experiences. On physical examination, she exhibits hypervigilance and a startle response to sudden noises. She reports sleep disturbances and avoidance of situations that remind her of the trauma. No significant abnormalities are found on routine lab tests and imaging.",
    "actual_diagnosis": "20. Post-traumatic stress disorder, ICD-10 code F43.12"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with worsening fatigue and shortness of breath over the past month. Physical examination reveals bilateral lower extremity edema and a blood pressure of 180/100 mmHg. Laboratory tests show serum creatinine of 7.5 mg/dL and a BUN of 60 mg/dL, indicating severe renal dysfunction. Additionally, a urinalysis reveals proteinuria and hematuria.",
    "actual_diagnosis": "18. End-stage renal disease, ICD-10 code N18.6"
  },
  {
    "doctor_vignette": "A 45-year-old male presents with complaints of progressive enlargement of his hands and feet over the past few years, along with noticeable facial changes including a protruding jaw and enlarged nose. Physical examination reveals increased hand and foot size, thickened skin, and frontal bossing. Serum IGF-1 levels are markedly elevated, and an MRI of the pituitary gland shows a large adenoma.",
    "actual_diagnosis": "22. Acromegaly, ICD-10 code E22.0"
  },
  {
    "doctor_vignette": "A 32-year-old female presents with progressive dyspnea and a persistent dry cough over the past six months. On physical examination, she exhibits bilateral crackles on auscultation and clubbing of the fingers. A high-resolution CT scan of the chest reveals ground-glass opacities and reticular patterns consistent with interstitial lung disease. Pulmonary function tests show a restrictive pattern with a reduced forced vital capacity.",
    "actual_diagnosis": "23. Interstitial lung disease, ICD-10 code J84.10"
  },
  {
    "doctor_vignette": "A 52-year-old female presents with a chief complaint of dry mouth and dry eyes for the past six months. On examination, she exhibits bilateral parotid gland enlargement and has a decreased tear production test. Laboratory findings reveal positive anti-Ro (SSA) antibodies and a labial salivary gland biopsy shows focal lymphocytic sialadenitis, consistent with Sjögren's syndrome.",
    "actual_diagnosis": "24. Sjögren's syndrome, ICD-10 code M35.0"
  },
  {
    "doctor_vignette": "A 28-year-old female presents with persistent feelings of worry and restlessness over the past six months. On physical examination, she exhibits mild tachycardia and tremors of the hands. Routine lab tests, including complete blood count and thyroid function tests, return within normal limits, ruling out physiological causes of her symptoms.",
    "actual_diagnosis": "Anxiety disorder, ICD-10 code F41.9"
  },
  {
    "doctor_vignette": "A 12-year-old African American male presents to the emergency department with severe abdominal pain and fatigue. On examination, he demonstrates pallor and jaundice, with splenomegaly noted on palpation. A complete blood count reveals a hemoglobin level of 6.5 g/dL and a peripheral blood smear shows sickle-shaped cells.",
    "actual_diagnosis": "Sickle cell anemia, ICD-10 code D57.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with persistent fatigue and unexplained weight loss over the past three months. On physical examination, he has palpable lymphadenopathy in the cervical and axillary regions as well as splenomegaly. Laboratory tests reveal elevated lactate dehydrogenase (LDH) and a lymphocyte count of 5,000/mm³. A CT scan of the abdomen shows enlarged lymph nodes in the retroperitoneal space.",
    "actual_diagnosis": "Non-Hodgkin lymphoma, ICD-10 code C82.9"
  },
  {
    "doctor_vignette": "A 65-year-old male presents to the emergency department with a chief complaint of decreased urine output for the past 48 hours. Physical examination reveals hypertension and peripheral edema. Laboratory tests show elevated serum creatinine levels at 4.5 mg/dL and blood urea nitrogen (BUN) of 35 mg/dL, indicating acute renal impairment.",
    "actual_diagnosis": "Acute renal failure, ICD-10 code N17.9"
  },
  {
    "doctor_vignette": "A 3-week-old male infant presents with a chief complaint of failure to pass meconium within the first 48 hours of life. Physical examination reveals abdominal distension and a palpable fecal mass in the lower abdomen. A contrast enema shows a narrow distal colon with proximal dilation, indicating a lack of ganglion cells.",
    "actual_diagnosis": "Hirschsprung disease, ICD-10 code Q43.0"
  },
  {
    "doctor_vignette": "A 23-year-old female presents with left lower abdominal pain that started two days ago, worsening with movement. On physical examination, there is tenderness in the left adnexal area and a palpable mass. An ultrasound reveals a 5 cm simple cyst on the left ovary, with no signs of torsion or rupture.",
    "actual_diagnosis": "25. Ovarian cyst, ICD-10 code N83.20"
  },
  {
    "doctor_vignette": "A 35-year-old female presents with progressive dysphagia for solids and liquids over the past six months, accompanied by episodes of regurgitation and weight loss. On physical examination, she is mildly dehydrated with a distended abdomen. A barium swallow study reveals a dilated esophagus and incomplete lower esophageal sphincter relaxation. Endoscopy shows no obstruction but confirms the absence of peristalsis in the esophagus.",
    "actual_diagnosis": "Achalasia, ICD-10 code K22.0"
  },
  {
    "doctor_vignette": "A 62-year-old male presents with worsening shortness of breath over the past month. On physical examination, he has elevated blood pressure of 160/95 mmHg, bilateral lower extremity edema, and a third heart sound (S3 gallop). A recent echocardiogram reveals left ventricular hypertrophy and reduced ejection fraction of 45%.",
    "actual_diagnosis": "5. Hypertensive heart disease, ICD-10 code I11.9"
  },
  {
    "doctor_vignette": "A 65-year-old female presents with a chief complaint of persistent knee pain that worsens with activity and improves with rest. On physical examination, there is notable crepitus and tenderness upon palpation of the medial joint line, along with a decreased range of motion. X-rays reveal joint space narrowing and osteophyte formation in the knee, consistent with degenerative changes.",
    "actual_diagnosis": "7. Osteoarthritis, ICD-10 code M19.90"
  },
  {
    "doctor_vignette": "A 65-year-old male presents with a chief complaint of increasing shortness of breath and a persistent cough for the past six months. On physical exam, he has expiratory wheezes, decreased breath sounds, and a prolonged expiratory phase. A chest X-ray shows hyperinflated lungs, and spirometry reveals a FEV1/FVC ratio of 60%, indicating obstructive lung disease.",
    "actual_diagnosis": "6. Chronic obstructive pulmonary disease, ICD-10 code J44.9"
  }
]